{"1":{"Alohomora":[{"text":"grabbed Harry’s wand, tapped the lock, and whispered, “Alohomora!” The lock clicked and the door swung open","index":225174},{"text":"wouldn’t budge, not even when Hermione tried her Alohomora Charm. “Now what?” said Ron. “These birds … they","index":393854}],"(Anti-Cheating Spell)":[{"text":"the exams, which had been bewitched with an Anti-Cheating spell. They had practical exams as well.","index":369400}],"Bluebell Flames":[{"text":"something, and sent a jet of the same bluebell flames she had used on Snape at the","index":391833}],"Locomotor Mortis":[{"text":"wanting to hurt Harry. “Now, don’t forget, it’s Locomotor Mortis,” Hermione muttered as Ron slipped his wand","index":312503}],"Mimblewimble":[{"text":"gone very pale, whispered something that sounded like “Mimblewimble.” Hagrid stared wildly at Harry. “But yeh must","index":71789}],"Petrificus Totalus":[{"text":"really sorry about this.” She raised her wand. “Petrificus Totalus!” she cried, pointing it at Neville. Neville’s","index":384816}],"Switching Spell":[{"text":"got from Professor McGonagall for knowing about Switching Spells.” “Go away.” “All right, but I warned","index":219247}],"Wingardium Leviosa":[{"text":"the next table, wasn’t having much more luck. “Wingardium Leviosa!” he shouted, waving his long arms like","index":241280},{"text":"of her gown, flicked her wand, and said, “Wingardium Leviosa!” Their feather rose off the desk and","index":241592},{"text":"the first spell that came into his head: “Wingardium Leviosa!” The club flew suddenly out of the","index":248545}]},"2":{"Aparecium":[{"text":"She tapped the diary three times and said, “Aparecium!” Nothing happened. Undaunted, Hermione shoved her hand back","index":332845}],"Apparate":[{"text":"car!” said Ron impatiently. “They know how to Apparate! You know, just vanish and reappear at home!","index":95270},{"text":"we’re all underage and we’re not allowed to Apparate yet. …” Harry’s feeling of panic turned suddenly to","index":95422}],"Expelliarmus":[{"text":"and pointed them at their opponent; Snape cried: “Expelliarmus!” There was a dazzling flash of scarlet light","index":270287},{"text":"temper. He pulled out his wand and shouted, “Expelliarmus!” and just as Snape had disarmed Lockhart, so","index":341663},{"text":"Lockhart had barely raised his, when Harry bellowed, “Expelliarmus!” Lockhart was blasted backward, falling over his trunk;","index":426827}],"Homorphus":[{"text":"my remaining strength and performed the immensely complex Homorphus Charm — he let out a piteous moan — go","index":228788}],"Lumos":[{"text":"sycamore tree. Harry took out his wand, murmured, “Lumos!” and a tiny light appeared at the end","index":388472},{"text":"them turned to stare into the darkness ahead. “Lumos!” Harry muttered to his wand and it lit","index":432052}],"Obliviate":[{"text":"Spellotaped wand high over his head and yelled, “Obliviate!” The wand exploded with the force of a","index":434270}],"Peskipiksi Pesternomi":[{"text":"up his sleeves, brandished his wand, and bellowed, “Peskipiksi Pesternomi!” It had absolutely no effect; one of","index":144664}],"Rictusempra":[{"text":"pointed his wand straight at Malfoy and shouted, “Rictusempra!” A jet of silver light hit Malfoy in","index":272763}],"Serpensortia":[{"text":"shouted. Malfoy raised his wand quickly and bellowed, “Serpensortia!” The end of his wand exploded. Harry watched,","index":275777}],"Tarantallegra":[{"text":"Malfoy pointed his wand at Harry’s knees, choked, “Tarantallegra!” and the next second Harry’s legs began to","index":273250}]},"3":{"Alohomora":[{"text":"back of Harry’s robes with her left hand. “Alohomora!” The window sprang open. “How — how — ?” said Black","index":591575}],"Apparate":[{"text":"he get in?” “Maybe he knows how to Apparate,” said a Ravenclaw a few feet away. “Just","index":230243},{"text":"stop people entering by stealth. You can’t just Apparate in here. And I’d like to see","index":230761},{"text":"said Ron, looking very impressed, “you’ve learned to Apparate!” “ ’Course I haven’t,” said Harry. He dropped his","index":280942},{"text":"They were drawing nearer — “He must have Disapparated, Severus. We should have left somebody in the","index":597502},{"text":"him. When this gets out —” “HE DIDN’T DISAPPARATE!” Snape roared, now very close at hand. “YOU","index":597609},{"text":"roared, now very close at hand. “YOU CAN’T APPARATE OR DISAPPARATE INSIDE THIS CASTLE! THIS — HAS — SOMETHING","index":597669},{"text":"close at hand. “YOU CAN’T APPARATE OR DISAPPARATE INSIDE THIS CASTLE! THIS — HAS — SOMETHING — TO — DO","index":597684}],"(Cheering Charm)":[{"text":"“Come along, quickly, wands out, we’re experimenting with Cheering Charms today, we’ve already divided into pairs —” Harry","index":419777},{"text":"up all lesson. “She could’ve done with a Cheering Charm on her too,” said Ron as the","index":420255},{"text":"class left for lunch, all grinning broadly — the Cheering Charms had left them with a feeling of","index":420348},{"text":"their apple pie, the after-effects of the Cheering Charms were wearing off, and Harry and Ron","index":420520},{"text":"looking extremely harassed. “I can’t believe I missed Cheering Charms! And I bet they come up in","index":422145},{"text":"something useful. I could be catching up on Cheering Charms —” Professor Trelawney rustled past. “Would anyone like","index":424672},{"text":"right; Professor Flitwick did indeed test them on Cheering Charms. Harry slightly overdid his out of nerves","index":453003}],"Confundus":[{"text":"had bewitched them, I saw it immediately. A Confundus Charm, to judge by their behavior. They seemed","index":551786}],"Dissendium":[{"text":"next to his figure. The word inside said, “Dissendium.” “Dissendium!” Harry whispered, tapping the stone witch again.","index":276444},{"text":"to his figure. The word inside said, “Dissendium.” “Dissendium!” Harry whispered, tapping the stone witch again. At","index":276458},{"text":"Longbottom. Harry quickly pulled out his wand, muttered, “Dissendium!” and shoved his bag into the statue, but","index":395060},{"text":"hump again?” “You — you tap it and say, ‘Dissendium,’ ” said Harry. “But —” Hermione didn’t wait for the","index":466498}],"Expecto Patronum":[{"text":"“The incantation is this —” Lupin cleared his throat. “Expecto patronum!” “Expecto patronum,” Harry repeated under his breath,","index":339254},{"text":"is this —” Lupin cleared his throat. “Expecto patronum!” “Expecto patronum,” Harry repeated under his breath, “expecto patronum.”","index":339274},{"text":"patronum!” “Expecto patronum,” Harry repeated under his breath, “expecto patronum.” “Concentrating hard on your happy memory?” “Oh","index":339327},{"text":"first broom ride. “Expecto patrono — no, patronum — sorry — expecto patronum, expecto patronum —” Something whooshed suddenly out of","index":339517},{"text":"ride. “Expecto patrono — no, patronum — sorry — expecto patronum, expecto patronum —” Something whooshed suddenly out of the end","index":339535},{"text":"A wave of piercing cold broke over him — “Expecto patronum!” Harry yelled. “Expecto patronum! Expecto —” But the","index":340499},{"text":"cold broke over him — “Expecto patronum!” Harry yelled. “Expecto patronum! Expecto —” But the classroom and the dementor","index":340533},{"text":"breath; one rotting hand was extending toward Harry — “Expecto patronum!” Harry yelled. “Expecto patronum! Expecto pat —” White","index":342624},{"text":"was extending toward Harry — “Expecto patronum!” Harry yelled. “Expecto patronum! Expecto pat —” White fog obscured his senses","index":342658},{"text":"of it; the room fell cold and dark — “EXPECTO PATRONUM!” Harry bellowed. “EXPECTO PATRONUM! EXPECTO PATRONUM!” The","index":344689},{"text":"fell cold and dark — “EXPECTO PATRONUM!” Harry bellowed. “EXPECTO PATRONUM! EXPECTO PATRONUM!” The screaming inside Harry’s head","index":344725},{"text":"and dark — “EXPECTO PATRONUM!” Harry bellowed. “EXPECTO PATRONUM! EXPECTO PATRONUM!” The screaming inside Harry’s head had started","index":344743},{"text":"robes, he whipped out his wand and roared, “Expecto patronum!” Something silver-white, something enormous, erupted from","index":375037},{"text":"Black, and only Black, and began to chant: “Expecto patronum! Expecto patronum!” Black gave a shudder, rolled","index":547741},{"text":"only Black, and began to chant: “Expecto patronum! Expecto patronum!” Black gave a shudder, rolled over, and","index":547759},{"text":"I’m going to go and live with him. “Expecto patronum! Hermione, help me! Expecto patronum!” “Expecto —” Hermione","index":547918},{"text":"live with him. “Expecto patronum! Hermione, help me! Expecto patronum!” “Expecto —” Hermione whispered, “expecto — expecto —” But she","index":547955},{"text":"around Harry and Hermione, and were getting closer. … “EXPECTO PATRONUM!” Harry yelled, trying to blot the screaming","index":548190},{"text":"trying to blot the screaming from his ears. “EXPECTO PATRONUM!” A thin wisp of silver escaped his","index":548268},{"text":"to him. He was alone … completely alone. … “Expecto — expecto patronum —” Harry felt his knees hit the cold","index":548468},{"text":"okay — I’m going to live with him — “Expecto patronum!” he gasped. By the feeble light of","index":548679},{"text":"aside. “No — no —” Harry gasped. “He’s innocent … expecto — expecto patronum —” He could feel them watching him, hear","index":549028},{"text":"fog was blinding him. He had to fight … expecto patronum … he couldn’t see … and in the distance,","index":549611},{"text":"in the distance, he heard the familiar screaming … expecto patronum … he groped in the mist for Sirius,","index":549703},{"text":"behind the bush and pulled out his wand. “EXPECTO PATRONUM!” he yelled. And out of the end","index":586922}],"Expelliarmus":[{"text":"bared in a grin. It was Sirius Black. “Expelliarmus!” he croaked, pointing Ron’s wand at them. Harry’s","index":483775},{"text":"Black himself, crumpled and bleeding at Harry’s feet. “Expelliarmus!” Lupin shouted. Harry’s wand flew once more out","index":490720},{"text":"step toward him, he had raised his wand. “Expelliarmus!” he yelled — except that his wasn’t the only","index":515874},{"text":"and back to the earth in a heap. “Expelliarmus!” Harry yelled, pointing his own wand at Pettigrew;","index":545142}],"Ferula":[{"text":"tapped Ron’s leg with his wand, and muttered, “Ferula.” Bandages spun up Ron’s leg, strapping it tightly","index":538597}],"Fidelius":[{"text":"told them that their best chance was the Fidelius Charm.” “How does that work?” said Madam Rosmerta,","index":291335},{"text":"heavily. “And then, barely a week after the Fidelius Charm had been performed —” “Black betrayed them?” breathed","index":292763}],"Impervius":[{"text":"Hermione tapped them with her wand and said, “Impervius!” “There!” she said, handing them back to Harry.","index":251248}],"Lumos":[{"text":"was just a stray cat or — something else. “Lumos,” Harry muttered, and a light appeared at the","index":45628},{"text":"pitch dark. He held up his wand, muttered, “Lumos!” and saw that he was in a very","index":276920},{"text":"pointed. Ron pulled out his wand and muttered, “Lumos!” A beam of light fell across the grass,","index":366338},{"text":"his wand, blinking blood out of his eyes — “Lumos!” he whispered. The wandlight showed him the trunk","index":477980}],"Mobiliarbus":[{"text":"right toward him. Somewhere above him, Hermione whispered, “Mobiliarbus!” The Christmas tree beside their table rose a","index":286307}],"Mobilicorpus":[{"text":"We can take him like this. …” He muttered, “Mobilicorpus.” As though invisible strings were tied to Snape’s","index":539185}],"Nox":[{"text":"being dragged upstairs. They reached the dark landing. “Nox,” they whispered together, and the lights at the","index":482640}],"Riddikulus":[{"text":"the charm without wands first. After me, please … riddikulus!” “Riddikulus!” said the class together. “Good,” said Professor","index":190215},{"text":"charm without wands first. After me, please … riddikulus!” “Riddikulus!” said the class together. “Good,” said Professor Lupin.","index":190229},{"text":"you will raise your wand — thus — and cry ‘Riddikulus’ — and concentrate hard on your grandmother’s clothes. If","index":191986},{"text":"upon him, reaching inside his robes. “R — r — riddikulus!” squeaked Neville. There was a noise like a","index":194300},{"text":"slowly, dragging its feet, its stiff arms rising — “Riddikulus!” cried Parvati. A bandage unraveled at the mummy’s","index":194906},{"text":"the hair on Harry’s head stand on end — “Riddikulus!” shouted Seamus. The banshee made a rasping noise","index":195362},{"text":"to creep along the floor like a crab. “Riddikulus!” yelled Dean. There was a snap, and the","index":195854},{"text":"a moment, Harry thought Ron had frozen. Then — “Riddikulus!” bellowed Ron, and the spider’s legs vanished; it","index":196180},{"text":"the air in front of Lupin, who said, “Riddikulus!” almost lazily. Crack! “Forward, Neville, and finish him","index":196631},{"text":"back. This time Neville charged forward looking determined. “Riddikulus!” he shouted, and they had a split second’s","index":196846},{"text":"though for how much longer, he wasn’t sure — “Riddikulus!” roared Lupin, springing forward. There was a loud","index":345218}],"Waddiwasi":[{"text":"He raised the wand to shoulder height, said, “Waddiwasi!” and pointed it at Peeves. With the force","index":185857}]},"4":{"Accio":[{"text":"pointed her wand at George’s pocket and said, “Accio!” Several small, brightly colored objects zoomed out of","index":100655},{"text":"that Mrs. Weasley managed to find them all. “Accio! Accio! Accio!” she shouted, and toffees zoomed from","index":101236},{"text":"Mrs. Weasley managed to find them all. “Accio! Accio! Accio!” she shouted, and toffees zoomed from all","index":101243},{"text":"Weasley managed to find them all. “Accio! Accio! Accio!” she shouted, and toffees zoomed from all sorts","index":101250},{"text":"dragon. Right …” He raised his wand once more. “Accio Dictionary!” The heavy book soared out of Hermione’s","index":516171},{"text":"was his only chance. … He raised his wand. “Accio Firebolt!” he shouted. Harry waited, every fiber of","index":527200},{"text":"horrible expression of dawning comprehension on his face — “Accio Parchment!” The map flew up into the air,","index":704600},{"text":"into a smile, saw him raise his wand. “Accio!” Harry yelled, pointing his wand at the Triwizard","index":998393}],"(Age Line)":[{"text":"temptation,” said Dumbledore, “I will be drawing an Age Line around the Goblet of Fire once it","index":379259},{"text":"for bed. Good night to you all.” “An Age Line!” Fred Weasley said, his eyes glinting, as","index":379972},{"text":"did find a way to get over the Age Line. … “Where is he?” said Ron, who wasn’t","index":380777},{"text":"by one, the Beauxbatons students stepped across the Age Line and dropped their slips of parchment into","index":389170},{"text":"injust.” “We were under the impression that your Age Line would keep out younger contestants, Dumbledore,” said","index":408339},{"text":"lip curling. “He could not have crossed the Age Line,” said Professor McGonagall sharply. “I am","index":409627},{"text":"had done it, how he had tricked Dumbledore’s Age Line and managed to get his name into","index":423144},{"text":"grimace. “Well … no one else got across the Age Line,” said Ron. “Not even Fred and George.","index":424656}],"Apparate":[{"text":"I can repair your fireplace before I Disapparate.” Harry was ready to bet that the Dursleys","index":66268},{"text":"bowl of porridge toward him. “Why can’t we Apparate too?” “Because you’re not of age and you","index":97792},{"text":"stairs. “You have to pass a test to Apparate?” Harry asked. “Oh yes,” said Mr. Weasley, tucking","index":98027},{"text":"said Fred, grinning. “He failed the first time, Apparated five miles south of where he meant to,","index":99405},{"text":"are coming from all over the world. Some Apparate, of course, but we have to set up","index":103368},{"text":"Apparition point. For those who don’t want to Apparate, or can’t, we use Portkeys. They’re objects that","index":103565},{"text":"is over. See you later, Arthur.” He Disapparated. “I thought Mr. Bagman was Head of Magical","index":114570},{"text":"strolling out of the woods toward them. “Just Apparated, Dad,” said Percy loudly. “Ah, excellent, lunch!” They","index":127623},{"text":"of the devil! Barty!” A wizard had just Apparated at their fireside, and he could not have","index":133303},{"text":"Crouch nodded curtly, and both of them Disapparated. “What’s happening at Hogwarts, Dad?” said Fred at","index":136925},{"text":"quite distracted, and without another word, he Disapparated with a small pop! “Not exactly on top","index":189372},{"text":"dressing gown, shaking her head. “They’ll have Disapparated.” “I don’t think so,” said a wizard with","index":195735},{"text":"then there was another pop, and Ludo Bagman Apparated right next to Mr. Weasley. Looking breathless and","index":197924},{"text":"Weasley. “Whoever conjured the Mark could have Disapparated right after they’d done it, leaving Harry’s wand","index":204862},{"text":"who it was; it looks like they Disapparated. Now excuse me, please, I want to get","index":209210},{"text":"the moment they saw it. They all Disapparated before we’d got near enough to unmask any","index":212351},{"text":"were the Death Eaters, why did they Disapparate when they saw the Dark Mark?” said Ron.","index":213742},{"text":"cloak over his shoulders and preparing to Disapparate. “Molly, are you going to be all right","index":238299},{"text":"the corner, she, Bill, and Charlie had Disapparated. Harry, Ron, and Hermione went back to their","index":244280},{"text":"away. …” “A Portkey?” Ron suggested. “Or they could Apparate — maybe you’re allowed to do it under seventeen","index":357465},{"text":"under seventeen wherever they come from?” “You can’t Apparate inside the Hogwarts grounds, how often do I","index":357559},{"text":"back. “How d’you know where he Disapparated to?” “Come off it,” said Ron incredulously. “Are","index":783041},{"text":"up to Disapparating or anything.” “You can’t Disapparate on the Hogwarts grounds, haven’t I told you","index":842304},{"text":"wasn’t anywhere on there.” “So he did Disapparate?” said Ron. “You can’t Disapparate on the grounds,","index":850607},{"text":"he did Disapparate?” said Ron. “You can’t Disapparate on the grounds, Ron!” said Hermione. “There are","index":850642},{"text":"of any Death Eater, we were to Disapparate, and Apparate, instantly, at his side. This Mark","index":1059614},{"text":"any Death Eater, we were to Disapparate, and Apparate, instantly, at his side. This Mark has been","index":1059628}],"Avada Kedavra":[{"text":"the air. “Yes?” said Moody, looking at her. “Avada Kedavra,” Hermione whispered. Several people looked uneasily around","index":317948},{"text":"his lopsided mouth. “Yes, the last and worst. Avada Kedavra … the Killing Curse.” He put his hand","index":318139},{"text":"and Harry felt a sudden thrill of foreboding. “Avada Kedavra!” Moody roared. There was a flash of","index":318540},{"text":"present and listened to what Moody was saying. “Avada Kedavra’s a curse that needs a powerful bit","index":320763},{"text":"whole class jumped again. “Now … those three curses — Avada Kedavra, Imperius, and Cruciatus — are known as the","index":321313},{"text":"his stuff, Moody, doesn’t he? When he did Avada Kedavra, the way that spider just died, just","index":324356},{"text":"voice, which screeched the words to the night: “Avada Kedavra!” A blast of green light blazed through","index":950846},{"text":"which Moody had always warned … the un-blockable Avada Kedavra curse — and Voldemort was right — his mother","index":983850},{"text":"was ready. As Harry shouted, “Expelliarmus!” Voldemort cried, “Avada Kedavra!” A jet of green light issued from","index":988349}],"Avis":[{"text":"sees … quite rigid … ten and a quarter inches … Avis!” The hornbeam wand let off a blast like","index":459904}],"Confundus":[{"text":"Moody. “It would have needed an exceptionally strong Confundus Charm to bamboozle that goblet into forgetting that","index":414092}],"Conjunctivitis":[{"text":"right now! I was going to suggest a Conjunctivitis Curse, as a dragon’s eyes are its weakest","index":603302}],"Crucio":[{"text":"again, pointed it at the spider, and muttered, “Crucio!” At once, the spider’s legs bent in upon","index":316722},{"text":"of the chair. It was pointing at Wormtail. “Crucio!” said the cold voice. Wormtail screamed, screamed as","index":861107},{"text":"you’re doing?” And then Harry heard Krum’s voice. “Crucio!” The air was suddenly full of Cedric’s yells.","index":935854},{"text":"Voldemort began to laugh. He raised his wand. “Crucio!” The Death Eater on the ground writhed and","index":966336},{"text":"turned to face Harry. He raised his wand. “Crucio!” It was pain beyond anything Harry had ever","index":981206}],"Deletrius":[{"text":"thick gray smoke: the ghost of a spell. “Deletrius!” Mr. Diggory shouted, and the smoky skull vanished","index":202729}],"Densaugeo":[{"text":"the same time, both acted. “Furnunculus!” Harry yelled. “Densaugeo!” screamed Malfoy. Jets of light shot from both","index":443228}],"Diffindo":[{"text":"pulled out his wand, and took careful aim. “Diffindo!” Cedric’s bag split. Parchment, quills, and books spilled","index":505981}],"(Drought Charm)":[{"text":"thing to dry up puddles and ponds, that Drought Charm, but that was nowhere near powerful enough","index":724504}],"Engorgio":[{"text":"he said, pointing his wand at the spider. “Engorgio!” The spider swelled. It was now larger than","index":316486}],"Ennervate":[{"text":"wand, pointed it at Winky, and said, “Rennervate!” Winky stirred feebly. Her great brown eyes opened","index":199298},{"text":"pointed his wand at him, and muttered, “Rennervate.” Krum opened his eyes. He looked dazed. When","index":836328},{"text":"wand at the man’s chest and said, “Rennervate.” Crouch’s son opened his eyes. His face was","index":1019567}],"Expecto Patronum":[{"text":"Ron and Hermione, raised his wand, and cried, “Expecto Patronum!” A silver stag erupted from the end","index":930534}],"Expelliarmus":[{"text":"spider opened its pincers once more and shouted “Expelliarmus!” It worked — the Disarming Spell made the spider","index":943757},{"text":"he had learned there was the Disarming Spell, “Expelliarmus” … and what use would it be to deprive","index":983521},{"text":"facing Voldemort. Voldemort was ready. As Harry shouted, “Expelliarmus!” Voldemort cried, “Avada Kedavra!” A jet of green","index":988316}],"(Extinguishing Spell)":[{"text":"“We’ll be on hand if it gets nasty, Extinguishing Spells at the ready. They wanted nesting mothers,","index":488221}],"Furnunculus":[{"text":"then, at exactly the same time, both acted. “Furnunculus!” Harry yelled. “Densaugeo!” screamed Malfoy. Jets of light","index":443199},{"text":"George, looking down at Crabbe. “Who used the Furnunculus Curse?” “Me,” said Harry. “Odd,” said George lightly.","index":1089231}],"Impedimenta":[{"text":"from its end and flew forward toward him. “Impedimenta!” Harry yelled. The spell hit the skrewt’s armor","index":934923},{"text":"staggered back a few paces and fell over. “IMPEDIMENTA!” The skrewt was inches from him when it","index":935059},{"text":"scuttled around, and ran at Harry instead. “Stupefy! Impedimenta! Stupefy!” But it was no use — the spider","index":943166},{"text":"tightly, he dashed out from behind the angel — “Impedimenta!” he bellowed, pointing his wand wildly over his","index":997678}],"Imperio":[{"text":"then pointed his wand at it and muttered, “Imperio!” The spider leapt from Moody’s hand on a","index":314093},{"text":"his wand, pointed it at Harry, and said, “Imperio!” It was the most wonderful feeling. Harry felt","index":341519},{"text":"said Dumbledore, also bowing. “Come,” said Madame Maxime imperiously to her students, and the Hogwarts crowd parted","index":363077},{"text":"ze meaning of zis, Dumbly-dorr?” she said imperiously. “I’d rather like to know that myself,","index":407772},{"text":"bowed low to him, and after regarding them imperiously for a moment, Buckbeak bent his scaly front","index":777579},{"text":"do that again,” said Voldemort softly. “Answer me! Imperio!” And Harry felt, for the third time in","index":986028}],"Incendio":[{"text":"Dursleys draw back against the wall as one. “Incendio!” said Mr. Weasley, pointing his wand at the","index":69475}],"Lumos":[{"text":"“Ron, where are you? Oh this is stupid — lumos!” She illuminated her wand and directed its narrow","index":180897},{"text":"stay there all night if he had to. … “Lumos,” Harry whispered fifteen minutes later as he opened","index":729207},{"text":"to Dumbledore. “They were definitely somewhere around here. …” “Lumos,” Dumbledore said, lighting his wand and holding it","index":835449},{"text":"underwater again. He pulled out his wand, muttered, “Lumos,” and heard Cedric do the same just behind","index":928147}],"Obliviate":[{"text":"thin air next to Mr. Roberts’s front door. “Obliviate!” he said sharply, pointing his wand at Mr.","index":113623}],"Orchideous":[{"text":"checking for scratches or bumps; then he muttered, “Orchideous!” and a bunch of flowers burst from the","index":458124}],"Point Me":[{"text":"deepened to navy. He reached a second fork. “Point Me,” he whispered to his wand, holding it","index":928935},{"text":"He had a choice of paths up ahead. “Point Me!” he whispered again to his wand, and","index":941972}],"Priori Incantatem":[{"text":"and give him back his wand.” \fChapter 34 Priori Incantatem Wormtail approached Harry, who scrambled to find","index":982364},{"text":"on whose face there was an arrested look. “Priori Incantatem,” he muttered. His eyes gazed into Harry’s","index":1039245}],"Prior Incantato":[{"text":"and placed it tip to tip with Harry’s. “Prior Incantato!” roared Mr. Diggory. Harry heard Hermione gasp,","index":202431}],"Quietus":[{"text":"pointed his wand at his throat and muttered, “Quietus.” “They’ll be talking about this one for years,”","index":173874}],"Reducio":[{"text":"spider’s legs relaxed, but it continued to twitch. “Reducio,” Moody muttered, and the spider shrank back to","index":317394}],"Reducto":[{"text":"spell to slow down and obstruct attackers; the Reductor Curse, which would enable him to blast solid","index":908455},{"text":"able to blast it out of the way. “Reducto!” he said. The spell shot straight through the","index":931514},{"text":"He supposed he should have known better; the Reductor Curse was for solid objects. What would happen","index":931639},{"text":"into Cedric’s. When none appeared, he tried the Reductor Curse again. It wasn’t very effective, but it","index":936023}],"Relashio":[{"text":"robes, and were attempting to drag him down. “Relashio!” Harry shouted, except that no sound came out.","index":739953}],"Rennervate":[{"text":"own wand, pointed it at Winky, and said, “Rennervate!” Winky stirred feebly. Her great brown eyes opened","index":199297},{"text":"again, pointed his wand at him, and muttered, “Rennervate.” Krum opened his eyes. He looked dazed. When","index":836327},{"text":"his wand at the man’s chest and said, “Rennervate.” Crouch’s son opened his eyes. His face was","index":1019566}],"Reparo":[{"text":"reproachfully, and she pulled out her wand, muttered “Reparo!” and the glass shards flew back into a","index":251231}],"Riddikulus":[{"text":"wake of his silver Patronus. “You’re a boggart! Riddikulus!” There was a loud crack, and the shape-shifter","index":930824}],"Sonorus":[{"text":"directed it at his own throat, and said “Sonorus!” and then spoke over the roar of sound","index":151411},{"text":"he had done at the World Cup, said, “Sonorus!” and his voice boomed out across the dark","index":735545},{"text":"now pointed his wand at his throat, muttered, “Sonorus,” and his magically magnified voice echoed into the","index":926905}],"Stupefy":[{"text":"two and pulled them down onto the ground. “STUPEFY!” roared twenty voices — there was a blinding series","index":193358},{"text":"of the dragon keepers pull out his wand. “Stupefy!” they shouted in unison, and the Stunning Spells","index":485884},{"text":"from Harry’s wand, which he pointed at it. “Stupefy!” The spell hit the skrewt’s armor and rebounded;","index":934696},{"text":"looked up. Krum turned and began to run. “Stupefy!” Harry yelled. The spell hit Krum in the","index":936478},{"text":"path and began to bear down upon Cedric. “Stupefy!” Harry yelled; the spell hit the spider’s gigantic,","index":942942},{"text":"jerked, scuttled around, and ran at Harry instead. “Stupefy! Impedimenta! Stupefy!” But it was no use — the","index":943157},{"text":"around, and ran at Harry instead. “Stupefy! Impedimenta! Stupefy!” But it was no use — the spider was","index":943179},{"text":"in excruciating pain. He could hear Cedric yelling “Stupefy!” too, but his spell had no more effect","index":943616},{"text":"he had done with the skrewt, and shouted “Stupefy!” just as Cedric yelled the same thing. The","index":944044},{"text":"Harry plunged his own hand into his robes — “Stupefy!” There was a blinding flash of red light,","index":1012065}],"Switching Spell":[{"text":"reveal that you can’t even perform a simple Switching Spell in front of anyone from Durmstrang!” Professor","index":349508},{"text":"whispering nonstop at his elbow. “Well, there are Switching Spells … but what’s the point of Switching it?","index":502774}],"(Unbreakable Charm)":[{"text":"to London,” said Hermione. “I’ve put an Unbreakable Charm on the jar, you see, so she","index":1086909}]},"5":{"Accio":[{"text":"hopefully toward the other side of the table — “Accio!”— and it zoomed gloomily back into his hand.","index":626740},{"text":"let’s all have a drink while we’re waiting. Accio Butterbeer!” He raised his wand as he spoke","index":802139},{"text":"Please remain seated while I collect your parchment! Accio!” More than a hundred rolls of parchment zoomed","index":1089235},{"text":"word, they raised their wands and said together, “Accio Brooms!” Harry heard a loud crash somewhere in","index":1144470},{"text":"his mouth when the female Death Eater shrieked, “Accio Proph —” Harry was just ready for her. He","index":1330198},{"text":"lying inside the jar full of glittering wind. “Accio Wand!” cried Hermione. Harry’s wand flew from a","index":1342936},{"text":"at the tank. “Honest, Harry, they’re brains — look — Accio Brain!” The scene seemed momentarily frozen. Harry, Ginny,","index":1355682},{"text":"of the spell. Dolohov raised his wand again. “Accio Proph —” Sirius hurtled out of nowhere, rammed Dolohov","index":1365092},{"text":"POTTER, AND YOU WILL GIVE IT TO ME — Accio Prophecy! ACCIO PROPHECY!” Harry laughed again because he","index":1380134},{"text":"YOU WILL GIVE IT TO ME — Accio Prophecy! ACCIO PROPHECY!” Harry laughed again because he knew it","index":1380150}],"Alohomora":[{"text":"door of the Janus Thickey ward and muttered “Alohomora.” The door swung open and she led the","index":862292},{"text":"“So even if she’s bewitched the door so Alohomora won’t work, which I bet she has —” “What","index":1115626},{"text":"have been on an ordinary door and said, “Alohomora!” Nothing happened. “Sirius’s knife!” said Harry, and he","index":1318875},{"text":"charmed shut. “Stand aside!” said a rough voice. “Alohomora!” As the door flew open, Harry, Hermione, and","index":1340367}],"Apparate":[{"text":"me? Hang on — it was him! He Disapparated from the front of my house!” “Yes, yes,","index":34082},{"text":"going to tell Dumbledore what’s happened, I can’t Apparate —” “I’ve got an owl, you can borrow","index":36854},{"text":"said Lupin. “Only way. You’re too young to Apparate, they’ll be watching the Floo Network, and it’s","index":84122},{"text":"much again. “Bill didn’t feel the need to Apparate every few feet! Charlie didn’t Charm everything he","index":139946},{"text":"Mum’ll be back up here.” “You two just Apparated on my knees!” “Yeah, well, it’s harder in","index":164572},{"text":"off briskly around the square. “No, I usually Apparate,” said Mr. Weasley, “but obviously you can’t, and","index":205731},{"text":"Theory, by Wilbert Slinkhard.” Crack. Fred and George Apparated right beside Harry. He was so used to","index":267972},{"text":"And with another loud crack, the twins Disapparated. “Those two!” said Hermione furiously, staring up at","index":275182},{"text":"takin’ a long journey an’ don’ want ter Apparate — an’ here’s another couple, look —” Two more horses","index":748666},{"text":"perhaps that will remind you that you can’t Apparate or Disapparate inside Hogwarts. Even Voldemort couldn’t just","index":843439},{"text":"remind you that you can’t Apparate or Disapparate inside Hogwarts. Even Voldemort couldn’t just make you","index":843454},{"text":"when, with a loud crack, Fred and George Apparated at the foot of his bed. “Merry Christmas,”","index":846682},{"text":"to his feet. “Well, he can’t have Disapparated!” cried Umbridge. “You can’t inside this school —” “The","index":1055530},{"text":"You-Know-Who, he grabbed a woman and Disapparated!” “I know, Williamson, I know, I saw him","index":1389297}],"Avada Kedavra":[{"text":"of weapon?” said Harry. “Something worse than the Avada Kedavra — ?” “That’s enough.” Mrs. Weasley spoke from the","index":160865},{"text":"“But there can’t be anything worse than the Avada Kedavra curse, can there?” said Ron. “What’s worse","index":165156},{"text":"have irked me too often, for too long. AVADA KEDAVRA!” Harry had not even opened his mouth","index":1381929}],"Bat-Bogey Hex":[{"text":"on the receiving end of one of her Bat-Bogey Hexes, have you?” “Shhh!” said Fred, half-rising","index":166151},{"text":"too. “But Ginny was best, she got Malfoy — Bat-Bogey Hex — it was superb, his whole face","index":1292443}],"(Cheering Charm)":[{"text":"“I’m not sure I did myself justice on Cheering Charms, I just ran out of time — did","index":1210429}],"Colloportus":[{"text":"the threshold before slamming the door behind them — “Colloportus!” gasped Hermione and the door sealed itself with","index":1338834},{"text":"in time to slam the door against Bellatrix. “Colloportus!” shouted Harry, and he heard three bodies slam","index":1354019},{"text":"in his haste to reach the next door. “Colloportus!” There were footsteps running along behind the doors;","index":1354616}],"Crucio":[{"text":"own arm … heard the high, cold voice say, “Crucio!” The man on the floor let out a","index":1238643},{"text":"ID DO DEM, HARRY!” Bellatrix raised her wand. “Crucio!” Neville screamed, his legs drawn up to his","index":1361197},{"text":"himself out from behind the fountain and bellowed “Crucio!” Bellatrix screamed. The spell had knocked her off","index":1377409},{"text":"the fountain on the other side. She screamed, “Crucio!” and he was forced to duck down again","index":1378179}],"Diffindo":[{"text":"pulled tight against him like an octopus’s body. “Diffindo!” yelled Harry, trying to sever the feelers wrapping","index":1356806}],"(Disillusionment Charm)":[{"text":"you.” “You need to what?” said Harry nervously. “Disillusionment Charm,” said Moody, raising his wand. “Lupin says","index":89926},{"text":"his back this time and knew that the Disillusionment Charm must have lifted. “Now stay still, everyone,","index":100508},{"text":"a moment he thought someone was putting a Disillusionment Charm on him again, then he realized that","index":204596}],"Entrail-Expelling":[{"text":"captioned URQUHART RACKHARROW, 1612–1697, INVENTOR OF THE ENTRAIL-EXPELLING CURSE. There were only three patients. Mr.","index":820751}],"Evanesco":[{"text":"dinner plates. Bill took out his wand, muttered “Evanesco!” and the scrolls vanished. “Sit down, Harry,” said","index":133549},{"text":"which means that this mess is utterly worthless. Evanesco.” The contents of Harry’s potion vanished; he was","index":389420}],"Expecto Patronum":[{"text":"it came. Stumbling backward, Harry raised his wand. “Expecto Patronum!” A silvery wisp of vapor shot from","index":29741},{"text":"for him. A rushing noise filled Harry’s ears. “Expecto Patronum!” His voice sounded dim and distant. … Another","index":30133},{"text":"into his mind as he fought for breath — “EXPECTO PATRONUM!” An enormous silver stag erupted from the","index":30920},{"text":"directly at Umbridge, and imagined her being sacked. “Expecto Patronum!” The silver stag erupted from the end","index":1214814}],"Expelliarmus":[{"text":"thinking, the first thing we should do is Expelliarmus, you know, the Disarming Charm. I know it’s","index":658272},{"text":"eyes and folding his arms. “I don’t think Expelliarmus is exactly going to help us against You-Know-Who,","index":658466},{"text":"The room was suddenly full of shouts of “Expelliarmus!”: Wands flew in all directions, missed spells hit","index":659265},{"text":"wince as the feeble spell whooshed over them. “Expelliarmus!” said Neville, and Harry, caught unawares, felt his","index":659909},{"text":"out-of-bounds. He blew his whistle; everybody stopped shouting, “Expelliarmus!” and the last couple of wands clattered to","index":664417},{"text":"was halfway into the air when James shouted, “Expelliarmus!” Snape’s wand flew twelve feet into the air","index":1095353},{"text":"wand wildly at the struggling pair he cried, “EXPELLIARMUS!” Both Harry’s and the Death Eater’s wands flew","index":1341309}],"Flagrate":[{"text":"the door of the brain room behind them. “Flagrate!” She drew with her wand in midair and","index":1313506}],"(Flying Charm)":[{"text":"his sneering drawl. “Why would anyone put a Flying Charm on a moldy old log like that?”","index":486339}],"Impedimenta":[{"text":"care, not until somebody in the vicinity yelled “IMPEDIMENTA!” and only when he was knocked over backward","index":694035},{"text":"room was soon full of intermittent cries of “Impedimenta!” People froze for a minute or so, during","index":763014},{"text":"him. Sirius let out a bark of laughter. “Impedimenta!” he said, pointing his wand at Snape, who","index":1095500},{"text":"inside. With a cry of triumph, both yelled, “IMPEDIMENTA!” Harry, Hermione, and Neville were all knocked backward","index":1345374},{"text":"own wand back over his shoulder and yelled, “Impedimenta!” Malfoy was blasted off his back. As Harry","index":1367283}],"Imperio":[{"text":"half-shrugged but did not argue. Mrs. Weasley beckoned imperiously to her sons and Hermione. One by one","index":161867},{"text":"You two — Crabbe — Goyle —” She beckoned them forward imperiously and they came, shuffling their large feet and","index":1451246}],"Impervius":[{"text":"out his wand, tapped his glasses and said, “Impervius!” “I think we all ought to try that,”","index":635263},{"text":"would really help visibility — all together, come on — Impervius! Okay. Let’s go.” They all stowed their wands","index":635430},{"text":"visibility was still very poor even with the Impervius Charm; light was fading fast and curtains of","index":635717}],"Incarcerous":[{"text":"Umbridge pointed her wand at Magorian and screamed, “Incarcerous!” Ropes flew out of midair like thick snakes,","index":1282873}],"Legilimens":[{"text":"powers are needed for this. … Brace yourself, now. … Legilimens!” Snape had struck before Harry was ready, before","index":902573},{"text":"on the count of three … one — two — three — Legilimens!” A great black dragon was rearing in front","index":905283},{"text":"mind! We shall try again! Get ready, now! Legilimens!” He was watching Uncle Vernon hammering the letter","index":906790},{"text":"again. …” He raised his wand. “One — two — three — Legilimens!” A hundred dementors were swooping toward Harry across","index":1000892},{"text":"clear his mind, for Snape had already cried “Legilimens!” He was hurtling along the corridor toward the","index":1003381},{"text":"said Dumbledore. “But I am a sufficiently accomplished Legilimens myself to know when I am being lied","index":1414776}],"Lumos":[{"text":"the ground like spiders. “Where’s — wand — come on — Lumos!” He said the spell automatically, desperate for light","index":29258},{"text":"third voice, this one completely unfamiliar, a woman’s. “Lumos.” A wand tip flared, illuminating the hall with","index":77020},{"text":"her back on her feet. They both murmured “Lumos!” and their wand tips ignited. Hagrid’s face swam","index":1168786}],"Nox":[{"text":"through the house, oozing under doorways like some noxious gas, so that all of them became infected","index":871960}],"Obliteration":[{"text":"leaving no trace behind them due to the Obliteration Charm Hermione was performing as they went. “Then","index":738980}],"Permanent Sticking":[{"text":"a month but we think she put a Permanent Sticking Charm on the back of the canvas.","index":130924},{"text":"at the opposite wall. “She’ll have put another Permanent Sticking Charm on the back of it, I","index":182868},{"text":"to attach it to his forehead with a Permanent Sticking Charm did he wrap it tenderly in","index":280816}],"Petrificus Totalus":[{"text":"to his feet, wand up, but Sirius said, “Petrificus Totalus!” and Snape keeled over again at once,","index":1099008},{"text":"out; he was thrust aside by his fellow. “Petrificus Totalus!” shouted Harry, as the second Death Eater","index":1346023},{"text":"at everything around him. Harry seized his chance: “PETRIFICUS TOTALUS!” The spell hit Dolohov before he could","index":1348189},{"text":"on Harry and Hermione. Springing up, Harry yelled, “Petrificus Totalus!” Once again, Dolohov’s arms and legs snapped","index":1365537}],"Portus":[{"text":"his desk. He raised his wand and murmured “Portus”; for a moment the kettle trembled, glowing with","index":792367},{"text":"threshold before slamming the door behind them — “Colloportus!” gasped Hermione and the door sealed itself with","index":1338839},{"text":"time to slam the door against Bellatrix. “Colloportus!” shouted Harry, and he heard three bodies slam","index":1354024},{"text":"his haste to reach the next door. “Colloportus!” There were footsteps running along behind the doors;","index":1354621},{"text":"He pointed his wand at it and muttered, “Portus.” The head glowed blue and trembled noisily against","index":1391759}],"Protego":[{"text":"were growing fainter … Harry raised his own wand. “Protego!” Snape staggered; his wand flew upward, away from","index":1001333},{"text":"Harry was just ready for her. He shouted “Protego!” before she had finished her spell, and though","index":1330255},{"text":"had used on Hermione just as Harry yelled, “Protego!” Harry felt something streak across his face like","index":1364847},{"text":"so fast he barely had time to duck. “Protego!” The jet of red light, his own Stunning","index":1379006}],"Reducto":[{"text":"how Parvati Patil had produced such a good Reductor Curse that she had reduced the table carrying","index":666859},{"text":"yelled Harry. Five different voices behind him bellowed “REDUCTO!” Five curses flew in five different directions and","index":1337134},{"text":"of them grabbed Ginny’s foot, I used the Reductor Curse and blew up Pluto in his face,","index":1352470}],"Reparo":[{"text":"bowl on the floor. Ron nodded and left. “Reparo,” Harry muttered, pointing his wand at the broken","index":552979},{"text":"thing within was swirling in its draining potion. “Reparo!” hissed Snape, and the jar sealed itself once","index":1002167},{"text":"folded, causing the cup to crack into two. “Reparo!” said Hermione quickly, mending Ron’s cup with a","index":1151983}],"Riddikulus":[{"text":"was downstairs — “Mrs. Weasley?” Harry croaked. “R-r-riddikulus!’’ Mrs. Weasley sobbed, pointing her shaking wand at","index":294001},{"text":"empty. Mrs. Weasley sobbed harder than ever. “R-riddikulus!” she sobbed again. Crack. Mr. Weasley’s body replaced","index":294213},{"text":"down his face. “No!” Mrs. Weasley moaned. “No … riddikulus! Riddikulus! RIDDIKULUS!” Crack. Dead twins. Crack. Dead Percy.","index":294381},{"text":"his face. “No!” Mrs. Weasley moaned. “No … riddikulus! Riddikulus! RIDDIKULUS!” Crack. Dead twins. Crack. Dead Percy. Crack.","index":294393},{"text":"face. “No!” Mrs. Weasley moaned. “No … riddikulus! Riddikulus! RIDDIKULUS!” Crack. Dead twins. Crack. Dead Percy. Crack. Dead","index":294405},{"text":"own wand he said, very firmly and clearly, “Riddikulus!” Harry’s body vanished. A silvery orb hung in","index":294884}],"Scourgify":[{"text":"could do with a bit of cleaning, too — Scourgify —” She pointed her wand at Hedwig’s cage; a","index":88227},{"text":"all this easily.” She pulled out her wand. “Scourgify!” The Stinksap vanished. “Sorry,” said Neville again, in","index":313861},{"text":"happened. “Wash out your mouth,” said James coldly. “Scourgify!” Pink soap bubbles streamed from Snape’s mouth at","index":1096801}],"Silencio":[{"text":"wonder if Umbridge knows how close it was. Silencio!” The bullfrog on which she was practicing her","index":628203},{"text":"green balloon and emitted a high-pitched whistle. “Silencio!” said Hermione hastily, pointing her wand at Harry’s","index":628576},{"text":"not stupid, he knows she nearly got him. Silencio!” The large and ugly raven in front of","index":628898},{"text":"front of him let out a derisive caw. “Silencio! SILENCIO!” The raven cawed more loudly. “It’s the","index":628975},{"text":"of him let out a derisive caw. “Silencio! SILENCIO!” The raven cawed more loudly. “It’s the way","index":628985},{"text":"and replacing it with her own fat bullfrog. “Silencio!” The raven continued to open and close its","index":629307},{"text":"Oh — oh, right,” said Ron, very flustered. “Er — Silencio!” He jabbed at the bullfrog so hard that","index":629608},{"text":"Death Eater nearest Harry, “IN AN OFFICE OFF —” “Silencio!” cried Hermione, and the man’s voice was extinguished.","index":1345847}],"Stupefy":[{"text":"all over the school unless we do something — Stupefy!” A jet of red light shot out of","index":1071314},{"text":"him by the shoulder; he heard Hermione shout “Stupefy!” and the hand released him at once. They","index":1338330},{"text":"wand out from under the desk he shouted, “STUPEFY!” A jet of red light hit the nearest","index":1340760},{"text":"sideways as Neville took aim again and shouted, “STUPEFY!” The jet of red light flew right over","index":1341783},{"text":"off with his free hand and shouted, “STUP —” “STUPEFY!” screamed Hermione, who had just caught up with","index":1342359},{"text":"Harry whirled around to face him and gasped, “STUPEFY!” The Death Eater keeled over backward and his","index":1363888},{"text":"pathetic little boy, can never hope to compete —” “Stupefy!” yelled Harry. He had edged right around to","index":1378774}],"Switching Spell":[{"text":"and theories. He forgot the definition of a Switching Spell during his written exam next morning, but","index":1213483}],"Tarantallegra":[{"text":"Dolohov, his long pale face twisted with glee. “Tarantallegra!” he shouted, his wand pointing at Neville, whose","index":1364549}],"Wingardium Leviosa":[{"text":"spinning their long, colored tentacles, but he shouted, “Wingardium Leviosa!” and they flew into the air away","index":1375174}]},"6":{"Accio":[{"text":"out of his hand, by saying the words “Accio Wand!” over and over again in his head,","index":227766},{"text":"cleared his throat and said loudly, wand aloft, “Accio Horcrux!” With a noise like an explosion, something","index":840734},{"text":"do it.” Harry raised his wand at once. “Accio Rosmerta’s Brooms!” A second later they heard a","index":871004}],"Aguamenti":[{"text":"Ron. “And we’re supposed to be practicing that Aguamenti Charm from Flitwick! Anyway, explain what? How are","index":322663},{"text":"registered the golden locket lying curled beneath it. “Aguamenti!” he shouted, jabbing the goblet with his wand.","index":860303},{"text":"began to pant. “But I had some — wait — Aguamenti!” said Harry again, pointing his wand at the","index":860577},{"text":"was drawing great, rattling breaths that sounded agonizing. “Aguamenti — Aguamenti — AGUAMENTI!” The goblet filled and emptied once","index":860964},{"text":"drawing great, rattling breaths that sounded agonizing. “Aguamenti — Aguamenti — AGUAMENTI!” The goblet filled and emptied once more.","index":860976},{"text":"great, rattling breaths that sounded agonizing. “Aguamenti — Aguamenti — AGUAMENTI!” The goblet filled and emptied once more. And","index":860988},{"text":"put out your house,” said Harry, “the charm’s ‘Aguamenti’ …” “Knew it was summat like that,” mumbled Hagrid,","index":906902},{"text":"raised a smoldering pink, flowery umbrella and said, “Aguamenti!” A jet of water flew out of the","index":907025},{"text":"wand arm, which felt like lead, and murmured “Aguamenti” too: Together, he and Hagrid poured water on","index":907145}],"Alohomora":[{"text":"open the gates, he found them chained shut. “Alohomora!” he said confidently, pointing his wand at the","index":232789}],"Anapneo":[{"text":"too fast, turned purple, and began to choke. “Anapneo,” said Slughorn calmly, pointing his wand at Belby,","index":210733}],"Apparate":[{"text":"his senses, Harry realized that he had just Apparated for the first time in his life. “Are","index":87113},{"text":"in his pocket. “Professor, why couldn’t we just Apparate directly into your old colleague’s house?” “Because it","index":89388},{"text":"unwanted Apparators. At Hogwarts, for instance —” “— you can’t Apparate anywhere inside the buildings or grounds,” said Harry","index":89740},{"text":"indicating that Harry should sit down too. “Ogden Apparated back to the Ministry and returned with reinforcements","index":313472},{"text":"seized his fallen case, then — CRACK — he Disapparated. Harry swore at the top of his voice,","index":364784},{"text":"tightly he might have been hoping to Disapparate with him, Slughorn led him purposefully into the","index":469340},{"text":"fast it was as though she had Disapparated; one moment she was there, the next, she","index":473800},{"text":"me!” “Yeah, but you wouldn’t be able to Apparate in here, not in the castle …” “Not the","index":528084},{"text":"point, is it? Everyone would know I could Apparate if I wanted.” Ron was not the only","index":528174},{"text":"Professor Flitwick flat on his face. “Harry’s already Apparated,” Ron told a slightly abashed Seamus, after Professor","index":528941},{"text":"you may know, it is usually impossible to Apparate or Disapparate within Hogwarts. The headmaster has lifted","index":571527},{"text":"it is usually impossible to Apparate or Disapparate within Hogwarts. The headmaster has lifted this enchantment,","index":571542},{"text":"emphasize that you will not be able to Apparate outside the walls of this Hall, and that","index":571734},{"text":"were looking positively alarmed at being asked to Apparate so quickly. “— two —” Harry tried to fix his","index":574923},{"text":"don’t care? Don’t you want to learn to Apparate?” said Ron incredulously. “I’m not fussed, really,","index":577448},{"text":"if you don’t hurry up, you’ll have to Apparate on an empty stomach. … Might make it easier,","index":583850},{"text":"this notice; he had still not managed to Apparate and feared he would not be ready for","index":669757},{"text":"whether ready or not. “At least you can Apparate, though!” said Ron tensely. “You’ll have no trouble","index":670018},{"text":"Kreacher made one last deep bow and Disapparated. “You’d better go and get some sleep too,","index":677856},{"text":"“What d’you think?” “Wish I could Disapparate like a house-elf,” said Ron, staring at","index":681149},{"text":"Ronald Weasley, the boy so solid he cannot Apparate half an inch across a room.” “No!” whispered","index":689396},{"text":"Ernie, and Draco Malfoy. “All too young to Apparate just yet?” said Slughorn genially. “Not turned seventeen","index":707490},{"text":"we be Apparating?” “Yes,” said Dumbledore. “You can Apparate now, I believe?” “Yes,” said Harry, “but I","index":829089},{"text":"his weakened voice. “We’re nearly there. … I can Apparate us both back. … Don’t worry. …” “I am not","index":866929},{"text":"dressing gown embroidered with dragons. “I saw you Apparate as I was pulling my bedroom curtains! Thank","index":869510},{"text":"hear him. … In the end, he managed to Apparate out, even though he’d never passed his test.","index":879104},{"text":"for the gates beyond which they could Disapparate — by the looks of them, the huge blond","index":899386},{"text":"soon be beyond the gates, able to Disapparate — Harry tore past Hagrid and his opponent, took","index":900997},{"text":"circling the gates. Snape had managed to Disapparate just beyond the school’s boundaries. “Hagrid,” muttered Harry,","index":905843},{"text":"be here within seconds, he has just Disapparated from the Ministry.” “Thank you, Everard,” said Professor","index":938508}],"Avada Kedavra":[{"text":"this day how the Riddles died, for the Avada Kedavra curse does not usually leave any sign","index":545447},{"text":"his wand and pointed it directly at Dumbledore. “Avada Kedavra!” A jet of green light shot from","index":892403},{"text":"and then Snape — and Snape did it. The Avada Kedavra.” Harry couldn’t go on. Madam Pomfrey burst","index":918238}],"Avis":[{"text":"living room, which Ginny had decorated so lavishly that it was rather like sitting in a","index":490781}],"Bat-Bogey Hex":[{"text":"saw this young lady perform the most marvelous Bat-Bogey Hex as I was passing her carriage!","index":213710},{"text":"her reputation as an accomplished caster of the Bat-Bogey Hex, soared over to intervene before things","index":431577}],"Crucio":[{"text":"dodged them: Amycus was giggling, enjoying the sport: “Crucio — Crucio — you can’t dance forever, pretty —” “Impedimenta!” yelled","index":895398},{"text":"them: Amycus was giggling, enjoying the sport: “Crucio — Crucio — you can’t dance forever, pretty —” “Impedimenta!” yelled Harry.","index":895407}],"Diffindo":[{"text":"and tapped the cover with his wand, muttering, “Diffindo!” The cover fell off. He did the same","index":325948}],"(Disillusionment Charm)":[{"text":"aware of emergency measures such as Shield and Disillusionment Charms, and, in the case of underage family","index":62302}],"Ennervate":[{"text":"it wasn’t poison, wake up, wake up — Rennervate!” he cried, his wand pointing at Dumbledore’s chest;","index":859888},{"text":"flash of red light but nothing happened. “Rennervate — sir — please —” Dumbledore’s eyelids flickered; Harry’s heart leapt.","index":860006}],"Episkey":[{"text":"he stayed stock-still and closed his eyes. “Episkey,” said Tonks. Harry’s nose felt very hot, and","index":230338},{"text":"pointing his wand at Demelza’s mouth, and saying “Episkey.” “And Ginny, don’t call Ron a prat, you’re","index":423640}],"Expelliarmus":[{"text":"open and somebody erupted through it and shouted, “Expelliarmus!” Harry’s body became instantly rigid and immobile, and","index":874343},{"text":"He could not understand how it had happened — Expelliarmus was not a Freezing Charm — Then, by the","index":874566}],"Impedimenta":[{"text":"them crumpled, but more were coming toward him. “Impedimenta! Incarcerous!” A few of them stumbled, one or","index":862604},{"text":"sport: “Crucio — Crucio — you can’t dance forever, pretty —” “Impedimenta!” yelled Harry. His jinx hit Amycus in the","index":895452},{"text":"using his shortcut were closing in behind him. … “Impedimenta!” he yelled as he rolled over again, crouching","index":900359}],"Imperio":[{"text":"snowy owl. Her amber eyes surveyed the room imperiously, her head swiveling occasionally to gaze at her","index":61189},{"text":"tight satin slippers. “Hurry up, Hokey!” said Hepzibah imperiously. “He said he’d come at four, it’s only","index":647112}],"Incarcerous":[{"text":"crumpled, but more were coming toward him. “Impedimenta! Incarcerous!” A few of them stumbled, one or two","index":862617}],"Incendio":[{"text":"as the huge Death Eater behind him yelled, “Incendio!” Harry heard an explosive bang and a dancing","index":901488},{"text":"let buy their products.” “We tried everything, Lumos, Incendio,” said Ginny. “Nothing would penetrate the darkness; all","index":923762}],"Langlock":[{"text":"Harry aimed his wand at Peeves and said, “Langlock!” Peeves clutched at his throat, gulped, then swooped","index":627316}],"Legilimens":[{"text":"Dark Lord, the greatest wizard, the most accomplished Legilimens the world has ever seen?” Bellatrix said nothing,","index":40312}],"Levicorpus":[{"text":"into a corner of the page, the scribble: Levicorpus (nvbl) While the wind and sleet pounded relentlessly","index":353041},{"text":"he gave it an upward flick and said Levicorpus! inside his head. “Aaaaaaaargh!” There was a flash","index":353594},{"text":"it, spells he invented. One of them was Levicorpus —” “Oh, that one had a great vogue during","index":500551},{"text":"the incantation sprang to mind without conscious thought: Levicorpus! Ron yelled as his heel was wrenched upward","index":587127},{"text":"wall beside him; Harry threw himself sideways, thought Levicorpus! and flicked his wand, but Malfoy blocked the","index":782056}],"Liberacorpus":[{"text":"that this was the counter-jinx, Harry thought Liberacorpus! with all his might. There was another flash","index":354292}],"Lumos":[{"text":"slowly, his wand raised and at the ready. “Lumos.” Dumbledore’s wand tip ignited, casting its light up","index":93130},{"text":"flecks of cold salt spray hitting his face. “Lumos,” said Dumbledore, as he reached the boulder closest","index":832812},{"text":"they let buy their products.” “We tried everything, Lumos, Incendio,” said Ginny. “Nothing would penetrate the darkness;","index":923755}],"Muffliato":[{"text":"Argus Filch); and, perhaps most useful of all, Muffliato, a spell that filled the ears of anyone","index":352374},{"text":"talk at all if Harry had used the Muffliato spell on anyone in the vicinity. Sitting up","index":352718},{"text":"when she had turned away again, “should’ve used Muffliato, Harry.” “No, we shouldn’t!” said Hermione at once,","index":414836},{"text":"the door of Madam Pomfrey’s office and muttered, “Muffliato!” so that she would not come running. Then","index":625749},{"text":"Madam Pomfrey’s office door to check that the Muffliato spell was still working; there was no sign","index":628444},{"text":"next morning’s Charms lesson (having first cast the Muffliato spell upon those nearest them). They were both","index":767763}],"Nox":[{"text":"mediocre to the last degree, though as obnoxious and self-satisfied as was his father before","index":48185},{"text":"what difference does that make?” asked Filch obnoxiously. “I’m a ruddy teacher, aren’ I, yeh","index":605698}],"Oppugno":[{"text":"was looking relieved that nothing worse had happened. “Oppugno!” came a shriek from the doorway. Harry spun","index":449478}],"Petrificus Totalus":[{"text":"broken object it was so important to mend? “Petrificus Totalus!” Without warning, Malfoy pointed his wand at","index":225183},{"text":"of the dead rising from the black water. “Petrificus Totalus!” yelled Harry, struggling to cling to the","index":862004},{"text":"upon him, trailing waterlogged rags, sunken faces leering. “Petrificus Totalus!” Harry bellowed again, backing away as he","index":862444},{"text":"the tower top, was disappearing through the door. “Petrificus Totalus!” The Death Eater buckled as though hit","index":893468},{"text":"and mouth, hot greedy breath at his throat — “Petrificus Totalus!” Harry felt Fenrir collapse against him; with","index":894765}],"Protego":[{"text":"all thought of nonverbal spells forgotten, he yelled, “Protego!” His Shield Charm was so strong Snape was","index":265285}],"Reducto":[{"text":"and a voice shouted, “They’ve blocked the stairs — Reducto! REDUCTO!” Harry’s heart leapt: So these four had","index":890578},{"text":"a voice shouted, “They’ve blocked the stairs — Reducto! REDUCTO!” Harry’s heart leapt: So these four had not","index":890587}],"Relashio":[{"text":"same time; Ogden raised his wand and cried, “Relashio!” Gaunt was thrown backward, away from his daughter;","index":312139}],"Rennervate":[{"text":"said it wasn’t poison, wake up, wake up — Rennervate!” he cried, his wand pointing at Dumbledore’s chest;","index":859887},{"text":"a flash of red light but nothing happened. “Rennervate — sir — please —” Dumbledore’s eyelids flickered; Harry’s heart leapt.","index":860005}],"Reparo":[{"text":"Ogden had lifted his own and said firmly, “Reparo.” The pot mended itself instantly. Gaunt looked for","index":304366},{"text":"then swapped the covers, tapped each, and said, “Reparo!” There sat the Prince’s copy, disguised as a","index":326108},{"text":"the pod, hit the bowl, and shattered it. “Reparo,” he said hastily, poking the pieces with his","index":418332},{"text":"the broken scales with her wand and said, “Reparo.” The girl did not say thank you, but","index":631485}],"Revelio":[{"text":"of his bag and raised her wand. “Specialis Revelio!” she said, rapping it smartly on the front","index":285283},{"text":"words aloud. Ernie Macmillan, however, was muttering, “Specialis Revelio!” over his cauldron, which sounded impressive, so Harry","index":561196}],"Sectumsempra":[{"text":"ignored her. He had just found an incantation (“Sectumsempra!”) scrawled in a margin above the intriguing words","index":668967},{"text":"all the difference in the world. \fChapter 24 Sectumsempra Exhausted but delighted with his night’s work, Harry","index":767587},{"text":"folded down; turning to it, he saw the Sectumsempra spell, captioned “For Enemies,” that he had marked","index":774830},{"text":"slipped as Malfoy, his face contorted, cried, “Cruci —” “SECTUMSEMPRA!” bellowed Harry from the floor, waving his wand","index":782558},{"text":"Hermione, clearly stung. “But you can’t call that Sectumsempra spell good, Ginny, look where it’s landed him!","index":795102},{"text":"at the air with his wand, Harry yelled, “Sectumsempra! SECTUMSEMPRA!” But though gashes appeared in their sodden","index":862836},{"text":"the air with his wand, Harry yelled, “Sectumsempra! SECTUMSEMPRA!” But though gashes appeared in their sodden rags","index":862850},{"text":"ointment. Harry remembered how Snape had mended Malfoy’s Sectumsempra wounds so easily with his wand. “Can’t you","index":916238},{"text":"said Harry bitterly. “He knew when I used Sectumsempra. He didn’t really need Legilimency. … He might even","index":953220}],"Specialis Revelio":[{"text":"out of his bag and raised her wand. “Specialis Revelio!” she said, rapping it smartly on the","index":285273},{"text":"the words aloud. Ernie Macmillan, however, was muttering, “Specialis Revelio!” over his cauldron, which sounded impressive, so","index":561186}],"Stupefy":[{"text":"opponent, took aim at Snape’s back, and yelled, “Stupefy!” He missed; the jet of red light soared","index":901088}],"Tergeo":[{"text":"Hermione. “Come here —” She raised her wand, said “Tergeo!” and siphoned off the dried blood. “Thanks,” said","index":238457}],"(Unbreakable Vow)":[{"text":"will you swear it? Will you make the Unbreakable Vow?” “The Unbreakable Vow?” Snape’s expression was blank,","index":55061},{"text":"it? Will you make the Unbreakable Vow?” “The Unbreakable Vow?” Snape’s expression was blank, unreadable. Bellatrix, however,","index":55084},{"text":"his hand. “Certainly, Narcissa, I shall make the Unbreakable Vow,” he said quietly. “Perhaps your sister will","index":55541},{"text":"a sob before it slammed. \fChapter 15 The Unbreakable Vow Snow was swirling against the icy windows","index":450011},{"text":"mother I would protect you. I made the Unbreakable Vow, Draco —” “Looks like you’ll have to break","index":481812},{"text":"he’d made an Unbreakable Oath or something —” “An Unbreakable Vow?” said Ron, looking stunned. “Nah, he can’t","index":484597},{"text":"does it mean?” “Well, you can’t break an Unbreakable Vow. …” “I’d worked that much out for","index":484761}]},"7":{"Accio":[{"text":"on to the bike for dear life. “Hagrid — Accio Hagrid!” The motorbike sped up, sucked toward the","index":90785},{"text":"“I just did a Summoning Charm. You know — Accio. And — they zoomed out of Dumbledore’s study window","index":149287},{"text":"where he had left his glasses, and said, “Accio Glasses!” Although they were only around a foot","index":164816},{"text":"his jeans. She raised her wand and said, “Accio Locket!” Nothing happened. Ron, who had been searching","index":278793},{"text":"the room again, raised his wand, and murmured, “Accio Locket.” Nothing happened, but he had not expected","index":373482},{"text":"it into the depths of the magical bag. “Accio Dittany!” A small brown bottle zoomed out of","index":401986},{"text":"d’you reckon it’s too early in the season? Accio Salmon!” There were several distinct splashes and then","index":439909},{"text":"whispered the voice. “Yesss … hold you … hold you …” “Accio … Accio Wand …” But nothing happened and he needed","index":509628},{"text":"the voice. “Yesss … hold you … hold you …” “Accio … Accio Wand …” But nothing happened and he needed his","index":509636},{"text":"the wand at the silvery shape and murmured, “Accio Sword.” It did not stir. He had not","index":551906},{"text":"get up there without touching anything?” asked Ron. “Accio Cup!” cried Hermione, who had evidently forgotten in","index":807669},{"text":"he could not remember where to go next. … “Accio Diadem!” cried Hermione in desperation, but nothing flew","index":928611}],"Aguamenti":[{"text":"shot red sparks into his eyebrows, which ignited. “Aguamenti!” screamed Hermione, and a jet of water streamed","index":329685},{"text":"which were crumbling to soot at their touch. “Aguamenti!” Harry bawled, but the jet of water that","index":935215}],"Alohomora":[{"text":"pointed her wand at the handle and said, “Alohomora.” There was a click, and the door swung","index":276624}],"Apparate":[{"text":"within the Department of Magical Transport. If Potter Apparates or uses the Floo Network, we shall know","index":8101},{"text":"the Floo Network, place a Portkey here, or Apparate in or out. All done in the name","index":66930},{"text":"he heard the faintest pop as Kingsley Disapparated just beyond the Burrow’s boundaries. Mr. and Mrs.","index":112519},{"text":"Mad-Eye tried to stop him, but he Disapparated. Voldemort’s curse hit Mad-Eye full in the","index":113723},{"text":"say we find a quiet place to Disapparate and head for the countryside. Once we’re there,","index":243389},{"text":"obvious, isn’t it, Harry?” said Ron. “He Disapparated!” “But … you couldn’t Apparate in and out of","index":289175},{"text":"Harry?” said Ron. “He Disapparated!” “But … you couldn’t Apparate in and out of that cave,” said Harry,","index":289207},{"text":"is it?” said Ron. “I mean, they can Apparate and Disapparate in and out of Hogwarts when","index":289353},{"text":"Ron. “I mean, they can Apparate and Disapparate in and out of Hogwarts when we can’t.”","index":289369},{"text":"the square outside —” “We know —” “I had to Apparate very precisely onto the top step outside the","index":302696},{"text":"so quickly? It’s impossible to track anyone who Apparates, unless you grab hold of them as they","index":303818},{"text":"of the wedding guests were able to Disapparate before they arrived.” “Were they Death Eaters or","index":304677},{"text":"information, none of the rest of us Disapparated,” said Hermione. “Well, you’re a bunch of bleedin’","index":326790},{"text":"He had nearly lost his balance as he Apparated onto the top step just outside the front","index":332059},{"text":"three of us go we’ll have to Disapparate separately,” Ron was saying. “We can’t all fit","index":343859},{"text":"house from across the misty square. Hermione Disapparated with Ron first, then came back for Harry.","index":350832},{"text":"a little Ministry witch with flyaway gray hair Apparated feet from them, blinking a little in the","index":352118},{"text":"back there.” “What d’you — ?” “As we Disapparated, Yaxley caught hold of me and I couldn’t","index":403269},{"text":"what had happened the last time they had Apparated to the first place Hermione had thought of","index":405419},{"text":"show they had camped there. Then they Disapparated to the outskirts of a small market town.","index":424318},{"text":"to her face. “He’s g-g-gone! Disapparated!” She threw herself into a chair, curled up,","index":463300},{"text":"delay: She and Harry grasped hands and Disapparated, reappearing on a windswept heather-covered hillside. The","index":465633},{"text":"agreed to make the journey. They were to Apparate to the village under cover of darkness, so","index":481318},{"text":"your eyes. … But perhaps we ought to Disapparate under the Invisibility Cloak, just in case?” Half","index":544688},{"text":"and Hermione clutching the beaded bag, they Disapparated. The usual tightness engulfed them; Harry’s feet parted","index":544858},{"text":"to come back the minute I’d Disapparated, but I walked straight into a gang of","index":572838},{"text":"wand, Disarmed the bloke holding mine, and Disapparated. I didn’t do it so well, Splinched myself","index":574199},{"text":"where I needed to go. So I Disapparated and came out on the side of a","index":577679},{"text":"out and went inside me, and I Disapparated and arrived here in these woods. I still","index":578663},{"text":"from the breezy hillside to which they Disapparated next morning. From their high vantage point the","index":593599},{"text":"the next lot of hills.” So they Disapparated a few miles farther north. “Aha!” shouted Ron,","index":595616},{"text":"scalp. “On three! One — two — three —” They Disapparated, pulling the prisoners with them. Harry struggled, trying","index":680297},{"text":"swarthy face. Ron was now trying to Disapparate without a wand. “There’s no way out, Ron,”","index":697051},{"text":"revealing Dobby the house-elf, who had just Apparated into their midst. “DOB — !” Harry hit Ron on","index":699946},{"text":"He cut to the essentials. “You can Disapparate out of this cellar?” he asked Dobby, who","index":700571},{"text":"and soon he would be close enough to Apparate to them, and Harry could see no way","index":708398},{"text":"hand and spun on the spot to Disapparate. As he turned into darkness he caught one","index":710793},{"text":"working and they would be able to Disapparate. Once past the gate, Griphook spoke. “I should","index":783862}],"Avada Kedavra":[{"text":"as she turned slowly away from him again. “Avada Kedavra.” The flash of green light illuminated every","index":17735},{"text":"died the same as if I’d used Avada Kedavra! Expelliarmus saved me from Voldemort two years","index":102723},{"text":"his hand! … He laughed before casting the curse. … “Avada Kedavra!” The green light filled the cramped hallway,","index":514982},{"text":"stomach the small ones whining in the orphanage — “Avada Kedavra!” And then he broke: He was nothing,","index":517009},{"text":"him out of the way. “It’s that Mudblood! Avada Kedavra!” Harry saw Hermione dive aside, and his","index":933597},{"text":"which narrowly missed. Crabbe wheeled around and screamed, “Avada Kedavra!” again. Ron leapt out of sight to","index":934428},{"text":"best hope to the heavens, pointing Draco’s wand: “Avada Kedavra!” “Expelliarmus!” The bang was like a cannon","index":1103161}],"Avis":[{"text":"stand beside him, giving him a soppy, slavish look that Harry hoped with all his heart","index":76722}],"Bluebell Flames":[{"text":"pool and the forest, the only illumination the bluebell flames still shimmering in a bowl on the","index":569497}],"Cascading":[{"text":"were fewer than twenty feet away, but the cascading river made it impossible to tell for sure.","index":439451}],"Caterwauling":[{"text":"couple more, Longbottom? There’s a curfew and a Caterwauling Charm on the whole village!” “I know, that’s","index":845472}],"Cave Inimicum":[{"text":"thud at the end of a guy rope. “Cave Inimicum,” Hermione finished with a skyward flourish. “That’s","index":407375},{"text":"I can’t believe we got out of that!” “Cave Inimicum … Didn’t I say it was an Erumpent","index":634932}],"Confringo":[{"text":"his wand at the falling sidecar, and yelled, “Confringo!” He knew a dreadful, gut-wrenching pang for","index":86433},{"text":"Hermione with him; as it struck, Hermione screamed, “Confringo!” and her spell flew around the room, exploding","index":511659}],"Confundus":[{"text":"trail; this must be it. No doubt a Confundus Charm has been placed upon Dawlish. It would","index":5117}],"Crucio":[{"text":"else did you take, what else? ANSWER ME! CRUCIO!” Hermione’s screams echoed off the walls upstairs, Ron","index":697581},{"text":"done that.” As Amycus spun around, Harry shouted, “Crucio!” The Death Eater was lifted off his feet.","index":876787},{"text":"on?” “Harry?” mimicked Crabbe. “What’s going — no, Potter! Crucio!” Harry had lunged for the tiara; Crabbe’s curse","index":932865},{"text":"no man alive can threaten me now! Watch! Crucio!” Harry had been expecting it, knew his body","index":1075739}],"(Cushioning Charm)":[{"text":"landing painlessly on the rocky passage floor. “C-Cushioning Charm,” Hermione spluttered, as Ron pulled her to","index":800389}],"Defodio":[{"text":"at any moment; then he heard Hermione yelling, “Defodio!” She was helping the dragon enlarge the passageway,","index":813869}],"Deprimo":[{"text":"his face, then at the floor beneath them. “Deprimo!” She had blasted a hole in the sitting","index":634024}],"Descendo":[{"text":"out of the room onto the tiny landing. “Descendo,” muttered Ron, pointing his wand at the low","index":142551},{"text":"books and robes and unidentifiable junk, and shouted, “Descendo!” The wall began to totter, then the top","index":931813}],"Diffindo":[{"text":"of her hair and trembling all over. “D-diffindo,” she said, pointing her wand at Ron, who","index":245710},{"text":"I’m so sorry, Ron, my hand’s shaking! Diffindo!” The severed ropes fell away. Ron got to","index":245882},{"text":"“Well, I’ve had a change of heart. Diffindo!” Nothing happened. “Hermione, how do I get rid","index":392212},{"text":"then he pointed Hermione’s wand at the ice. “Diffindo.” It cracked with a sound like a bullet","index":553946}],"(Disillusionment Charm)":[{"text":"figures began to pop into sight as their Disillusionment Charms lifted. Dominating the scene was Hagrid, wearing","index":64152},{"text":"everything,” she whispered back, “Muffliato, Muggle-Repelling and Disillusionment Charms, all of it. They shouldn’t be able","index":438646},{"text":"the Invisibility Cloak for a start, and perhaps Disillusionment Charms would be sensible too, unless you think","index":479397},{"text":"is not a traveling cloak imbued with a Disillusionment Charm, or carrying a Bedazzling Hex, or else","index":615628},{"text":"didn’t need a Cloak, he could perform a Disillusionment Charm so powerful that he made himself completely","index":644867},{"text":"a second he had cast upon himself a Disillusionment Charm that hid him even from his own","index":749781}],"Duro":[{"text":"spun onto the floor, hitting the opposite wall. “Duro!” cried Hermione, pointing her wand at the tapestry,","index":953066}],"Engorgio":[{"text":"examine, and had decided was made of blackthorn. “Engorgio.” The spider gave a little shiver, bouncing slightly","index":586595}],"Erecto":[{"text":"“so Ron’s dad said I could borrow it. Erecto!” she added, pointing her wand at the misshapen","index":407106}],"Expecto Patronum":[{"text":"grasped her chin and forced her face back. “EXPECTO PATRONUM!” The silver stag soared from the tip","index":391536},{"text":"as we can muster; do yours, Hermione.” “Expec — Expecto patronum,” said Hermione. Nothing happened. “It’s the only","index":393264},{"text":"Mrs. Cattermole. “Bit unfortunate, really … Come on, Hermione. …” “Expecto patronum!” A silver otter burst from the end","index":393464},{"text":"the boy, after all?” “For him?” shouted Snape. “Expecto Patronum!” From the tip of his wand burst","index":1018750}],"Expelliarmus":[{"text":"the strangely blank face of Stanley Shunpike — Stan — “Expelliarmus!” Harry yelled. “That’s him, it’s him, it’s the","index":87376},{"text":"same as if I’d used Avada Kedavra! Expelliarmus saved me from Voldemort two years ago,” Harry","index":102738},{"text":"people! — would have expected you to attack back! Expelliarmus is a useful spell, Harry, but the Death","index":103465},{"text":"wand; Hermione, however, was too quick for him. “Expelliarmus!” Mundungus’s wand soared into the air, and Hermione","index":325332},{"text":"then went out. Harry pointed it at Hermione. “Expelliarmus!” Hermione’s wand gave a little jerk, but did","index":522244},{"text":"she turned her wand to face Ron instead — “Expelliarmus!” he roared, pointing Wormtail’s wand at Bellatrix, and","index":707033},{"text":"Their split second’s hesitation was all Harry needed. “Expelliarmus!” Goyle’s wand flew out of his hand and","index":934049},{"text":"to the heavens, pointing Draco’s wand: “Avada Kedavra!” “Expelliarmus!” The bang was like a cannon blast, and","index":1103178}],"Expulso":[{"text":"waitress, who collapsed in front of the door. “Expulso!” bellowed the Death Eater, and the table behind","index":245195}],"Fidelius":[{"text":"us, that greatly dilutes the power of the Fidelius Charm. Twenty times as many opportunities for the","index":131335},{"text":"but I’d already taken him inside the Fidelius Charm’s protection. Since Dumbledore died, we’re Secret-Keepers,","index":403856},{"text":"know what happened when the subjects of a Fidelius Charm died. Then the little lane along which","index":483323},{"text":"“I don’t … oh!” He could see it; the Fidelius Charm must have died with James and Lily.","index":495755},{"text":"his destination was in sight at last, the Fidelius Charm broken, though they did not know it","index":513758},{"text":"there is.” “How are they protected?” asked Harry. “Fidelius Charm. Dad’s Secret-Keeper. And we’ve done it","index":721428},{"text":"point, just beyond the boundary wall, where the Fidelius Charm stopped working and they would be able","index":783802}],"Fiendfyre":[{"text":"fragmented in his fingers. “It must have been Fiendfyre!” whimpered Hermione, her eyes on the broken pieces.","index":941316},{"text":"Hermione, her eyes on the broken pieces. “Sorry?” “Fiendfyre — cursed fire — it’s one of the substances that","index":941389}],"Flagrante":[{"text":"her blistered fingers. “They have added Gemino and Flagrante Curses!” said Griphook. “Everything you touch will burn","index":805966}],"Geminio":[{"text":"the locket’s gone — I need to duplicate it — Geminio! There … That should fool her. …” Hermione came running","index":392459}],"Glisseo":[{"text":"before their wands were fully raised, Hermione shouted, “Glisseo!” The stairs beneath their feet flattened into a","index":952745}],"Homenum Revelio":[{"text":"Hermione, and she raised her wand and said, “Homenum revelio.” Nothing happened. “Well, you’ve just had a","index":254299},{"text":"like this?” “I swear … I swear … Potter’s upstairs!” “Homenum revelio,” said the voice at the foot of","index":631896}],"Impedimenta":[{"text":"the middle of the oncoming figures and yelled, “Impedimenta!” The jinx hit the middle Death Eater in","index":85619}],"Imperio":[{"text":"whispered, for the first time in his life, “Imperio!” A curious sensation shot down Harry’s arm, a","index":795093},{"text":"thinking: Pointing his wand at Travers, he muttered, “Imperio!” once more. “Oh yes, I see,” said Travers,","index":795702},{"text":"the wizard.” Harry pointed his wand at Travers. “Imperio!” The wizard turned and set off along the","index":798630},{"text":"a Gringotts goblin. And we need the Clankers!” “Imperio!” Harry said again; his voice echoed through the","index":801428},{"text":"wand at the groggy Death Eater, and said, “Imperio.” Amycus got up, walked over to his sister,","index":878944}],"Impervius":[{"text":"to fix, so as an interim measure try Impervius to protect his belongings —” “Say it again, slowly","index":363621},{"text":"of Hufflepuff’s cup, hooking it onto the blade. “Impervius!” screeched Hermione in an attempt to protect herself,","index":809547}],"Levicorpus":[{"text":"her wand, pointed it at Harry, and whispered, “Levicorpus.” Hoisted into the air by his ankle, Harry","index":809098}],"Liberacorpus":[{"text":"pulled. The blistered goblin emerged by degrees, howling. “Liberacorpus!” yelled Harry, and with a crash he and","index":810012}],"Lumos":[{"text":"of the room. On the landing he whispered, “Lumos,” and started to climb the stairs by wandlight.","index":261861},{"text":"and even that was swallowed by the darkness. “Lumos,” said Harry, and his wand ignited. He gave","index":507054},{"text":"the wand resealed itself. Harry held it up. “Lumos!” The wand sparked feebly, then went out. Harry","index":522165},{"text":"Now fear came: Her presence had meant safety. “Lumos!” he whispered, and the wand-tip ignited. The","index":549845},{"text":"you? And hurry, we have very little time!” “Lumos!” Harry shone his lit wand around the vault:","index":805228},{"text":"raised Draco’s wand beneath the Cloak, and murmured, “Lumos.” The black stone with its jagged crack running","index":1033968}],"Meteolojinx Recanto":[{"text":"raining lately,” said Mr. Weasley. “Did you try Meteolojinx Recanto? It worked for Bletchley.” “Meteolojinx Recanto?” whispered","index":379472},{"text":"you try Meteolojinx Recanto? It worked for Bletchley.” “Meteolojinx Recanto?” whispered Ron. “No, I didn’t. Thanks, D","index":379520}],"Muffliato":[{"text":"Hermione tapped on the door and tiptoed inside. “Muffliato,” she whispered, waving her wand in the direction","index":194925},{"text":"purple-carpeted corridors were as hushed as though the Muffliato charm had been cast over the place. Her","index":368759},{"text":"making Hermione jump. He thought of casting the Muffliato charm upon Umbridge and Yaxley, but even murmuring","index":387597},{"text":"their clearing. “Salvio Hexia … Protego Totalum … Repello Muggletum … Muffliato … You could get out the tent, Harry. …” “Tent?”","index":406423},{"text":"Sneakoscope. It was not moving. “You cast the Muffliato charm over us, right?” he whispered to Hermione.","index":438514},{"text":"to Hermione. “I did everything,” she whispered back, “Muffliato, Muggle-Repelling and Disillusionment Charms, all of it.","index":438614}],"Nox":[{"text":"With difficulty he dragged it over himself, murmured, “Nox,” extinguishing his wandlight, and continued on his hands","index":966355}],"Obliviate":[{"text":"pointed her wand at Dolohov’s forehead and said, “Obliviate.” At once, Dolohov’s eyes became unfocused and dreamy.","index":247513},{"text":"dumbstruck look of one who had just been Obliviated; her eyes had even drifted out of focus.","index":280316},{"text":"face appeared over the top of the sideboard. “Obliviate!” cried Hermione, pointing her wand first into his","index":633924}],"Obscuro":[{"text":"slid into his portrait. At once, Hermione cried: “Obscuro!” A black blindfold appeared over Phineas Nigellus’s clever,","index":450559}],"Permanent Sticking":[{"text":"Sirius’s parents had been unable to remove the Permanent Sticking Charm that kept them on the wall,","index":263634}],"Petrificus Totalus":[{"text":"his hand as the Cloak slipped off him. “Petrificus Totalus!” screamed Hermione from out of sight, and","index":245406}],"Piertotum Locomotor":[{"text":"hunch-shouldered, muttering under his breath. “And now — Piertotum Locomotor!” cried Professor McGonagall. And all along","index":891112}],"Priori Incantatem":[{"text":"“He can’t know that, Harry, how could he — ?” “Priori Incantatem,” said Harry. “We left your wand and","index":743203}],"Protego":[{"text":"wands raised, and heard both of them shout, “Protego!”, a cry that was echoed on all sides","index":237205},{"text":"a heat haze upon their clearing. “Salvio Hexia … Protego Totalum … Repello Muggletum … Muffliato … You could get out","index":406385},{"text":"its owner’s pocket, Hermione had raised her own. “Protego!” she cried, and an invisible shield expanded between","index":462205},{"text":"out of Harry’s hands and he reacted instinctively. “Protego!” The invisible shield erupted between Ron and Hermione:","index":570792},{"text":"in a circle around them, waving her wand. “Protego Totalum … Salvio Hexia …” “That treacherous old bleeder!” Ron","index":634701},{"text":"pointed Bellatrix’s wand at the waterfall and cried, “Protego!” They saw the Shield Charm break the flow","index":801858},{"text":"any idea where the diadem of Ravenclaw is?” “— Protego Horribilis — the diadem of Ravenclaw?” squeaked Flitwick. “A","index":888978},{"text":"his wand and directed it at Molly Weasley. “Protego!” roared Harry, and the Shield Charm expanded in","index":1093061}],"Protego Horribilis":[{"text":"any idea where the diadem of Ravenclaw is?” “— Protego Horribilis — the diadem of Ravenclaw?” squeaked Flitwick. “A","index":888978}],"Protego Totalum":[{"text":"a heat haze upon their clearing. “Salvio Hexia … Protego Totalum … Repello Muggletum … Muffliato … You could get out","index":406385},{"text":"in a circle around them, waving her wand. “Protego Totalum … Salvio Hexia …” “That treacherous old bleeder!” Ron","index":634701}],"Reducio":[{"text":"Harry had forgotten Ron’s hatred of spiders. “Sorry — Reducio.” The spider did not shrink. Harry looked down","index":586863}],"Relashio":[{"text":"fool her. …” Hermione came running downstairs. “Let’s see. … Relashio!” The chains clinked and withdrew into the arms","index":392549},{"text":"it was no use. Pettigrew was turning blue. “Relashio!” said Ron, pointing the wand at the silver","index":704682},{"text":"chaining the beast to the floor, he yelled, “Relashio!” The cuffs broke open with loud bangs. “This","index":812419}],"Reparo":[{"text":"his flowery pink umbrella. “Hagrid! No! Let me!” “REPARO!” There was a deafening bang and the sidecar","index":84934},{"text":"it’s broken like this —” “Please, Hermione, try!” “R-Reparo.” The dangling half of the wand resealed itself.","index":522090},{"text":"very tip of the Elder Wand, and said, “Reparo.” As his wand resealed, red sparks flew out","index":1111839}],"Repello Muggletum":[{"text":"haze upon their clearing. “Salvio Hexia … Protego Totalum … Repello Muggletum … Muffliato … You could get out the tent,","index":406403}],"Revelio":[{"text":"and she raised her wand and said, “Homenum revelio.” Nothing happened. “Well, you’ve just had a big","index":254307},{"text":"this?” “I swear … I swear … Potter’s upstairs!” “Homenum revelio,” said the voice at the foot of the","index":631904}],"Salvio Hexia":[{"text":"had cast a heat haze upon their clearing. “Salvio Hexia … Protego Totalum … Repello Muggletum … Muffliato … You could","index":406370},{"text":"circle around them, waving her wand. “Protego Totalum … Salvio Hexia …” “That treacherous old bleeder!” Ron panted, emerging","index":634719}],"Sectumsempra":[{"text":"say —” “He lost his hood during the chase. Sectumsempra was always a speciality of Snape’s. I wish","index":106299},{"text":"his wand, pointing it directly at Lupin’s back — “Sectumsempra!” shouted Snape. But the spell, intended for the","index":1020485}],"(Stinging Jinx)":[{"text":"state?” “That wasn’t us.” “Looks more like a Stinging Jinx to me,” said Lucius. His gray eyes","index":686455}],"Stupefy":[{"text":"sidecar to avoid them. Wriggling around he cried, “Stupefy!” and a red bolt of light shot from","index":82546},{"text":"had just been, as Harry, still invisible, yelled, “Stupefy!” The great blond Death Eater was hit in","index":244686},{"text":"it concealed beneath the Invisibility Cloak, and said, “Stupefy!” There was a flash of red light; Umbridge","index":390492},{"text":"to draw his own wand, but too late: “Stupefy!” Yaxley slid to the ground to lie curled","index":390921},{"text":"“What d’you think you’re playing at, woman?” “Stupefy!” she screamed. “Stupefy!” They were no match for","index":690405},{"text":"think you’re playing at, woman?” “Stupefy!” she screamed. “Stupefy!” They were no match for her, even though","index":690430},{"text":"Narcissa, Draco, and Greyback wheeled about; Harry yelled, “Stupefy!” and Lucius Malfoy collapsed onto the hearth. Jets","index":707246},{"text":"pointed all of them at Greyback, and yelled, “Stupefy!” The werewolf was lifted off his feet by","index":709485},{"text":"knew that the only way out was through. “Stupefy!” he bellowed, and Ron and Hermione joined in:","index":811944}],"Tergeo":[{"text":"he pointed it at the rag and said, “Tergeo.” The wand siphoned off most of the grease.","index":138470},{"text":"fumbled with logs for the fire, he muttered “Tergeo”: The dust vanished from the photographs, and he","index":503344}],"Wingardium Leviosa":[{"text":"pointed his wand at the sidecar and shouted, “Wingardium Leviosa!” The sidecar rose like a cork, unsteerable","index":85197},{"text":"at a twig on the ground and said, “Wingardium Leviosa!” The twig flew up from the ground,","index":964791}]}}