{"1":{"Alohomora":[{"text":"could toward Peeves’s shouts. “Oh, move over,” Hermione snarled. She grabbed Harry’s wand, tapped the lock, and whispered, “<strong>Alohomora</strong>!” The lock clicked and the door swung open — they piled through it, shut it quickly, and pressed their","index":225174},{"text":"him. They tugged and heaved at the door, but it wouldn’t budge, not even when Hermione tried her <strong>Alohomora</strong> Charm. “Now what?” said Ron. “These birds … they can’t be here just for decoration,” said Hermione. They watched","index":393854}],"(Anti-Cheating Spell)":[{"text":"written papers. They had been given special, new quills for the exams, which had been bewitched with an <strong>Anti-Cheating spell</strong>. They had practical exams as well. Professor Flitwick called them one by one into his class","index":369400}],"Bluebell Flames":[{"text":"Hermione, and she whipped out her wand, waved it, muttered something, and sent a jet of the same <strong>bluebell flames</strong> she had used on Snape at the plant. In a matter of seconds, the two boys felt","index":391833}],"Locomotor Mortis":[{"text":"use it on Snape if he showed any sign of wanting to hurt Harry. “Now, don’t forget, it’s <strong>Locomotor Mortis</strong>,” Hermione muttered as Ron slipped his wand up his sleeve. “I know,” Ron snapped. “Don’t nag.” Back","index":312503}],"Mimblewimble":[{"text":"about to explode. “DURSLEY!” he boomed. Uncle Vernon, who had gone very pale, whispered something that sounded like “<strong>Mimblewimble</strong>.” Hagrid stared wildly at Harry. “But yeh must know about yer mom and dad,” he said. “I mean,","index":71789}],"Petrificus Totalus":[{"text":"desperately. Hermione stepped forward. “Neville,” she said, “I’m really, really sorry about this.” She raised her wand. “<strong>Petrificus Totalus</strong>!” she cried, pointing it at Neville. Neville’s arms snapped to his sides. His legs sprang together. His","index":384816}],"Switching Spell":[{"text":"the House Cup, and you’ll lose all the points I got from Professor McGonagall for knowing about <strong>Switching Spell</strong>s.” “Go away.” “All right, but I warned you, you just remember what I said when you’re on","index":219247}],"Wingardium Leviosa":[{"text":"had to put it out with his hat. Ron, at the next table, wasn’t having much more luck. “<strong>Wingardium Leviosa</strong>!” he shouted, waving his long arms like a windmill. “You’re saying it wrong,” Harry heard Hermione snap.","index":241280},{"text":"you’re so clever,” Ron snarled. Hermione rolled up the sleeves of her gown, flicked her wand, and said, “<strong>Wingardium Leviosa</strong>!” Their feather rose off the desk and hovered about four feet above their heads. “Oh, well done!”","index":241592},{"text":"what he was going to do he heard himself cry the first spell that came into his head: “<strong>Wingardium Leviosa</strong>!” The club flew suddenly out of the troll’s hand, rose high, high up into the air, turned","index":248545}]},"2":{"Aparecium":[{"text":"of her bag. “It might be invisible ink!” she whispered. She tapped the diary three times and said, “<strong>Aparecium</strong>!” Nothing happened. Undaunted, Hermione shoved her hand back into her bag and pulled out what appeared to be","index":332845}],"Apparate":[{"text":"way. “How will they get home?” “They don’t need the car!” said Ron impatiently. “They know how to <strong>Apparate</strong>! You know, just vanish and reappear at home! They only bother with Floo powder and the car because","index":95270},{"text":"They only bother with Floo powder and the car because we’re all underage and we’re not allowed to <strong>Apparate</strong> yet. …” Harry’s feeling of panic turned suddenly to excitement. “Can you fly it?” “No problem,” said Ron, wheeling","index":95422}],"Expelliarmus":[{"text":"three —” Both of them swung their wands above their heads and pointed them at their opponent; Snape cried: “<strong>Expelliarmus</strong>!” There was a dazzling flash of scarlet light and Lockhart was blasted off his feet: He flew backward","index":270287},{"text":"said, “As a school prefect —” but Harry had lost his temper. He pulled out his wand and shouted, “<strong>Expelliarmus</strong>!” and just as Snape had disarmed Lockhart, so Malfoy found the diary shooting out of his hand into","index":341663},{"text":"sell another book —” Harry reached his wand just in time. Lockhart had barely raised his, when Harry bellowed, “<strong>Expelliarmus</strong>!” Lockhart was blasted backward, falling over his trunk; his wand flew high into the air; Ron caught it,","index":426827}],"Homorphus":[{"text":"put my wand to his throat — I then screwed up my remaining strength and performed the immensely complex <strong>Homorphus</strong> Charm — he let out a piteous moan — go on, Harry — higher than that — good — the fur vanished — the","index":228788}],"Lumos":[{"text":"of the forest, and lifted his leg against a large sycamore tree. Harry took out his wand, murmured, “<strong>Lumos</strong>!” and a tiny light appeared at the end of it, just enough to let them watch the path","index":388472},{"text":"squinting around at the dark, slimy walls. All three of them turned to stare into the darkness ahead. “<strong>Lumos</strong>!” Harry muttered to his wand and it lit again. “C’mon,” he said to Ron and Lockhart, and","index":432052}],"Obliviate":[{"text":"body — say good-bye to your memories!” He raised Ron’s Spellotaped wand high over his head and yelled, “<strong>Obliviate</strong>!” The wand exploded with the force of a small bomb. Harry flung his arms over his head and","index":434270}],"Peskipiksi Pesternomi":[{"text":"round them up, they’re only pixies,” Lockhart shouted. He rolled up his sleeves, brandished his wand, and bellowed, “<strong>Peskipiksi Pesternomi</strong>!” It had absolutely no effect; one of the pixies seized his wand and threw it out of","index":144664}],"Rictusempra":[{"text":"seemed to be working, and wasting no more time, Harry pointed his wand straight at Malfoy and shouted, “<strong>Rictusempra</strong>!” A jet of silver light hit Malfoy in the stomach and he doubled up, wheezing. “I said disarm","index":272763}],"Serpensortia":[{"text":"wand?” But Lockhart wasn’t listening. “Three — two — one — go!” he shouted. Malfoy raised his wand quickly and bellowed, “<strong>Serpensortia</strong>!” The end of his wand exploded. Harry watched, aghast, as a long black snake shot out of it,","index":275777}],"Tarantallegra":[{"text":"the floor, but this was a mistake; gasping for breath, Malfoy pointed his wand at Harry’s knees, choked, “<strong>Tarantallegra</strong>!” and the next second Harry’s legs began to jerk around out of his control in a kind of","index":273250}]},"3":{"Alohomora":[{"text":"him, and she took out her wand, still gripping the back of Harry’s robes with her left hand. “<strong>Alohomora</strong>!” The window sprang open. “How — how — ?” said Black weakly, staring at the hippogriff. “Get on — there’s not much","index":591575}],"Apparate":[{"text":"people were asking one another the same question: “How did he get in?” “Maybe he knows how to <strong>Apparate</strong>,” said a Ravenclaw a few feet away. “Just appear out of thin air, you know.” “Disguised himself, probably,”","index":230243},{"text":"Hermione. “There are all sorts of enchantments on it, to stop people entering by stealth. You can’t just <strong>Apparate</strong> in here. And I’d like to see the disguise that could fool those dementors. They’re guarding every","index":230761},{"text":"“What are you doing here? How — how did you — ?” “Wow!” said Ron, looking very impressed, “you’ve learned to <strong>Apparate</strong>!” “ ’Course I haven’t,” said Harry. He dropped his voice so that none of the sixth years could hear","index":280942},{"text":"Harry was trying to hear what the voices were saying. They were drawing nearer — “He must have Dis<strong>apparate</strong>d, Severus. We should have left somebody in the room with him. When this gets out —” “HE DIDN’T DIS<strong>APPARATE</strong>!”","index":597502},{"text":"with him. When this gets out —” “HE DIDN’T DIS<strong>APPARATE</strong>!” Snape roared, now very close at hand. “YOU CAN’T <strong>APPARATE</strong> OR DIS<strong>APPARATE</strong> INSIDE THIS CASTLE! THIS — HAS — SOMETHING — TO — DO — WITH — POTTER!” “Severus — be reasonable — Harry has been","index":597669}],"(Cheering Charm)":[{"text":"said Professor Flitwick reprovingly as Harry opened the classroom door. “Come along, quickly, wands out, we’re experimenting with <strong>Cheering Charm</strong>s today, we’ve already divided into pairs —” Harry and Ron hurried to a desk at the back and","index":419777},{"text":"went to the bathroom or something?” But Hermione didn’t turn up all lesson. “She could’ve done with a <strong>Cheering Charm</strong> on her too,” said Ron as the class left for lunch, all grinning broadly — the <strong>Cheering Charm</strong>s","index":420255},{"text":"wasn’t at lunch either. By the time they had finished their apple pie, the after-effects of the <strong>Cheering Charm</strong>s were wearing off, and Harry and Ron had started to get slightly worried. “You don’t think Malfoy","index":420520},{"text":"of the ladder to Professor Trelawney’s classroom twenty minutes later, looking extremely harassed. “I can’t believe I missed <strong>Cheering Charm</strong>s! And I bet they come up in our exams; Professor Flitwick hinted they might!” Together they climbed","index":422145},{"text":"a waste of time,” Hermione hissed. “I could be practicing something useful. I could be catching up on <strong>Cheering Charm</strong>s —” Professor Trelawney rustled past. “Would anyone like me to help them interpret the shadowy portents within their","index":424672},{"text":"straight back upstairs for the Charms exam. Hermione had been right; Professor Flitwick did indeed test them on <strong>Cheering Charm</strong>s. Harry slightly overdid his out of nerves and Ron, who was partnering him, ended up in fits","index":453003}],"Confundus":[{"text":"fact, it was Potter, Weasley, and Granger, Minister. …” “No!” “Black had bewitched them, I saw it immediately. A <strong>Confundus</strong> Charm, to judge by their behavior. They seemed to think there was a possibility he was innocent. They","index":551786}],"Dissendium":[{"text":"back at the map. The tiniest speech bubble had appeared next to his figure. The word inside said, “<strong>Dissendium</strong>.” “<strong>Dissendium</strong>!” Harry whispered, tapping the stone witch again. At once, the statue’s hump opened wide enough to admit","index":276444},{"text":"at it. The minuscule writing next to it read Neville Longbottom. Harry quickly pulled out his wand, muttered, “<strong>Dissendium</strong>!” and shoved his bag into the statue, but before he could climb in himself, Neville came around the","index":395060},{"text":"“If he sees you. … How do you open the witch’s hump again?” “You — you tap it and say, ‘<strong>Dissendium</strong>,’ ” said Harry. “But —” Hermione didn’t wait for the rest of his sentence; she strode across the room, pushed","index":466498}],"Expecto Patronum":[{"text":"exactly as possible the wonderful, soaring sensation of his stomach. “The incantation is this —” Lupin cleared his throat. “<strong>Expecto patronum</strong>!” “<strong>Expecto patronum</strong>,” Harry repeated under his breath, “<strong>expecto patronum</strong>.” “Concentrating hard on your happy memory?” “Oh — yeah","index":339254},{"text":"yeah —” said Harry, quickly forcing his thoughts back to that first broom ride. “Expecto patrono — no, patronum — sorry — <strong>expecto patronum</strong>, <strong>expecto patronum</strong> —” Something whooshed suddenly out of the end of his wand; it looked like a wisp","index":339517},{"text":"to sweep silently toward Harry, drawing a deep, rattling breath. A wave of piercing cold broke over him — “<strong>Expecto patronum</strong>!” Harry yelled. “<strong>Expecto patronum</strong>! Expecto —” But the classroom and the dementor were dissolving. … Harry was falling again","index":340499},{"text":"and dark once more. The dementor glided forward, drawing its breath; one rotting hand was extending toward Harry — “<strong>Expecto patronum</strong>!” Harry yelled. “<strong>Expecto patronum</strong>! Expecto pat —” White fog obscured his senses … big, blurred shapes were moving around","index":342624},{"text":"case for the third time, and the dementor rose out of it; the room fell cold and dark — “<strong>EXPECTO PATRONUM</strong>!” Harry bellowed. “<strong>EXPECTO PATRONUM</strong>! <strong>EXPECTO PATRONUM</strong>!” The screaming inside Harry’s head had started again — except this time,","index":344689},{"text":"to think. Plunging a hand down the neck of his robes, he whipped out his wand and roared, “<strong>Expecto patronum</strong>!” Something silver-white, something enormous, erupted from the end of his wand. He knew it had shot","index":375037},{"text":"I’m leaving the Dursleys. He forced himself to think of Black, and only Black, and began to chant: “<strong>Expecto patronum</strong>! <strong>Expecto patronum</strong>!” Black gave a shudder, rolled over, and lay motionless on the ground, pale as death.","index":547741},{"text":"the ground, pale as death. He’ll be all right. I’m going to go and live with him. “<strong>Expecto patronum</strong>! Hermione, help me! <strong>Expecto patronum</strong>!” “Expecto —” Hermione whispered, “expecto — expecto —” But she couldn’t do it. The dementors","index":547918},{"text":"barely ten feet from them. They formed a solid wall around Harry and Hermione, and were getting closer. … “<strong>EXPECTO PATRONUM</strong>!” Harry yelled, trying to blot the screaming from his ears. “<strong>EXPECTO PATRONUM</strong>!” A thin wisp of silver","index":548190},{"text":"him. At the same moment, Harry felt Hermione collapse next to him. He was alone … completely alone. … “Expecto — <strong>expecto patronum</strong> —” Harry felt his knees hit the cold grass. Fog was clouding his eyes. With a huge effort,","index":548468},{"text":"he fought to remember — Sirius was innocent — innocent — We’ll be okay — I’m going to live with him — “<strong>Expecto patronum</strong>!” he gasped. By the feeble light of his formless Patronus, he saw a dementor halt, very close","index":548679},{"text":"It made a gesture as though to sweep the Patronus aside. “No — no —” Harry gasped. “He’s innocent … expecto — <strong>expecto patronum</strong> —” He could feel them watching him, hear their rattling breath like an evil wind around him. The","index":549028},{"text":"couldn’t move or speak. His Patronus flickered and died. White fog was blinding him. He had to fight … <strong>expecto patronum</strong> … he couldn’t see … and in the distance, he heard the familiar screaming … <strong>expecto patronum</strong> … he groped in","index":549611},{"text":"father — he had seen himself — Harry flung himself out from behind the bush and pulled out his wand. “<strong>EXPECTO PATRONUM</strong>!” he yelled. And out of the end of his wand burst, not a shapeless cloud of mist,","index":586922}],"Expelliarmus":[{"text":"face, it looked like a skull. His yellow teeth were bared in a grin. It was Sirius Black. “<strong>Expelliarmus</strong>!” he croaked, pointing Ron’s wand at them. Harry’s and Hermione’s wands shot out of their hands, high in","index":483775},{"text":"standing there with his wand covering Black, and then to Black himself, crumpled and bleeding at Harry’s feet. “<strong>Expelliarmus</strong>!” Lupin shouted. Harry’s wand flew once more out of his hand; so did the two Hermione was holding.","index":490720},{"text":"in a split second. Before Snape could take even one step toward him, he had raised his wand. “<strong>Expelliarmus</strong>!” he yelled — except that his wasn’t the only voice that shouted. There was a blast that made the","index":515874},{"text":"on the ground. Another bang — Crookshanks flew into the air and back to the earth in a heap. “<strong>Expelliarmus</strong>!” Harry yelled, pointing his own wand at Pettigrew; Lupin’s wand flew high into the air and out of","index":545142}],"Ferula":[{"text":"the hospital wing.” He hurried over to Ron, bent down, tapped Ron’s leg with his wand, and muttered, “<strong>Ferula</strong>.” Bandages spun up Ron’s leg, strapping it tightly to a splint. Lupin helped him to his feet; Ron","index":538597}],"Fidelius":[{"text":"You-Know-Who wasn’t an easy person to hide from. Dumbledore told them that their best chance was the <strong>Fidelius</strong> Charm.” “How does that work?” said Madam Rosmerta, breathless with interest. Professor Flitwick cleared his throat. “An immensely","index":291335},{"text":"James Potter insisted on using Black?” “He did,” said Fudge heavily. “And then, barely a week after the <strong>Fidelius</strong> Charm had been performed —” “Black betrayed them?” breathed Madam Rosmerta. “He did indeed. Black was tired of his","index":292763}],"Impervius":[{"text":"them to her, and as the team watched in amazement, Hermione tapped them with her wand and said, “<strong>Impervius</strong>!” “There!” she said, handing them back to Harry. “They’ll repel water!” Wood looked as though he could have","index":251248}],"Lumos":[{"text":"If only it would move, then he’d know whether it was just a stray cat or — something else. “<strong>Lumos</strong>,” Harry muttered, and a light appeared at the end of his wand, almost dazzling him. He held it","index":45628},{"text":"cold, damp earth. He stood up, looking around. It was pitch dark. He held up his wand, muttered, “<strong>Lumos</strong>!” and saw that he was in a very narrow, low, earthy passageway. He raised the map, tapped it","index":276920},{"text":"banging against his ribs. “What’s the matter?” said Ron. Harry pointed. Ron pulled out his wand and muttered, “<strong>Lumos</strong>!” A beam of light fell across the grass, hit the bottom of a tree, and illuminated its branches;","index":366338},{"text":"Hermione shriek with pain and fall too. Harry groped for his wand, blinking blood out of his eyes — “<strong>Lumos</strong>!” he whispered. The wandlight showed him the trunk of a thick tree; they had chased Scabbers into the","index":477980}],"Mobiliarbus":[{"text":"feet move toward the bar, pause, then turn and walk right toward him. Somewhere above him, Hermione whispered, “<strong>Mobiliarbus</strong>!” The Christmas tree beside their table rose a few inches off the ground, drifted sideways, and landed with","index":286307}],"Mobilicorpus":[{"text":"don’t revive him until we’re safely back in the castle. We can take him like this. …” He muttered, “<strong>Mobilicorpus</strong>.” As though invisible strings were tied to Snape’s wrists, neck, and knees, he was pulled into a standing","index":539185}],"Nox":[{"text":"where a wide shiny stripe had been made by something being dragged upstairs. They reached the dark landing. “<strong>Nox</strong>,” they whispered together, and the lights at the end of their wands went out. Only one door was","index":482640}],"Riddikulus":[{"text":"assume a shape that you find amusing. “We will practice the charm without wands first. After me, please … <strong>riddikulus</strong>!” “<strong>Riddikulus</strong>!” said the class together. “Good,” said Professor Lupin. “Very good. But that was the easy part, I’m","index":190215},{"text":"will assume the form of Professor Snape,” said Lupin. “And you will raise your wand — thus — and cry ‘<strong>Riddikulus</strong>’ — and concentrate hard on your grandmother’s clothes. If all goes well, Professor Boggart Snape will be forced into","index":191986},{"text":"away, his wand up, mouthing wordlessly. Snape was bearing down upon him, reaching inside his robes. “R — r — <strong>riddikulus</strong>!” squeaked Neville. There was a noise like a whip crack. Snape stumbled; he was wearing a long, lace-trimmed","index":194300},{"text":"to Parvati and it began to walk toward her very slowly, dragging its feet, its stiff arms rising — “<strong>Riddikulus</strong>!” cried Parvati. A bandage unraveled at the mummy’s feet; it became entangled, fell face forward, and its head","index":194906},{"text":"sound filled the room, a long, wailing shriek that made the hair on Harry’s head stand on end — “<strong>Riddikulus</strong>!” shouted Seamus. The banshee made a rasping noise and clutched her throat; her voice was gone. Crack! The","index":195362},{"text":"eyeball became a severed hand, which flipped over and began to creep along the floor like a crab. “<strong>Riddikulus</strong>!” yelled Dean. There was a snap, and the hand was trapped in a mousetrap. “Excellent! Ron, you next!”","index":195854},{"text":"hair, was advancing on Ron, clicking its pincers menacingly. For a moment, Harry thought Ron had frozen. Then — “<strong>Riddikulus</strong>!” bellowed Ron, and the spider’s legs vanished; it rolled over and over; Lavender Brown squealed and ran out","index":196180},{"text":"was. Then they saw a silvery-white orb hanging in the air in front of Lupin, who said, “<strong>Riddikulus</strong>!” almost lazily. Crack! “Forward, Neville, and finish him off!” said Lupin as the boggart landed on the floor","index":196631},{"text":"landed on the floor as a cockroach. Crack! Snape was back. This time Neville charged forward looking determined. “<strong>Riddikulus</strong>!” he shouted, and they had a split second’s view of Snape in his lacy dress before Neville let","index":196846},{"text":"legs felt like water, he was still on his feet — though for how much longer, he wasn’t sure — “<strong>Riddikulus</strong>!” roared Lupin, springing forward. There was a loud crack, and Harry’s cloudy Patronus vanished along with the dementor;","index":345218}],"Waddiwasi":[{"text":"he told the class over his shoulder. “Please watch closely.” He raised the wand to shoulder height, said, “<strong>Waddiwasi</strong>!” and pointed it at Peeves. With the force of a bullet, the wad of chewing gum shot out","index":185857}]},"4":{"Accio":[{"text":"your pocket?” “Nothing!” “Don’t you lie to me!” Mrs. Weasley pointed her wand at George’s pocket and said, “<strong>Accio</strong>!” Several small, brightly colored objects zoomed out of George’s pocket; he made a grab for them but missed,","index":100655},{"text":"possible, and it was only by using her Summoning Charm that Mrs. Weasley managed to find them all. “<strong>Accio</strong>! <strong>Accio</strong>! <strong>Accio</strong>!” she shouted, and toffees zoomed from all sorts of unlikely places, including the lining of George’s","index":101236},{"text":"Hermione, so he could try again, “threaten me with a dragon. Right …” He raised his wand once more. “<strong>Accio</strong> Dictionary!” The heavy book soared out of Hermione’s hand, flew across the room, and Harry caught it. “Harry,","index":516171},{"text":"focus his mind, entirely and absolutely, upon the thing that was his only chance. … He raised his wand. “<strong>Accio</strong> Firebolt!” he shouted. Harry waited, every fiber of him hoping, praying. … If it hadn’t worked … if it wasn’t","index":527200},{"text":"“It’s mine! Mine!” Snape had reached out for it, a horrible expression of dawning comprehension on his face — “<strong>Accio</strong> Parchment!” The map flew up into the air, slipped through Snape’s outstretched fingers, and soared down the stairs","index":704600},{"text":"eyes flamed in the darkness. Harry saw his mouth curl into a smile, saw him raise his wand. “<strong>Accio</strong>!” Harry yelled, pointing his wand at the Triwizard Cup. It flew into the air and soared toward him.","index":998393}],"(Age Line)":[{"text":"to compete. “To ensure that no underage student yields to temptation,” said Dumbledore, “I will be drawing an <strong>Age Line</strong> around the Goblet of Fire once it has been placed in the entrance hall. Nobody under the","index":379259},{"text":"name into the goblet. Now, I think it is time for bed. Good night to you all.” “An <strong>Age Line</strong>!” Fred Weasley said, his eyes glinting, as they all made their way across the Hall to the","index":379972},{"text":"how angry Dumbledore would be if someone younger than seventeen did find a way to get over the <strong>Age Line</strong>. … “Where is he?” said Ron, who wasn’t listening to a word of this conversation, but looking through","index":380777},{"text":"behind her students and organized them into a line. One by one, the Beauxbatons students stepped across the <strong>Age Line</strong> and dropped their slips of parchment into the blue-white flames. As each name entered the fire,","index":389170},{"text":"Fleur’s shoulder. “ ’Ogwarts cannot ’ave two champions. It is most injust.” “We were under the impression that your <strong>Age Line</strong> would keep out younger contestants, Dumbledore,” said Karkaroff, his steely smile still in place, though his eyes","index":408339},{"text":"cried Madame Maxime. Snape was now shaking his head, his lip curling. “He could not have crossed the <strong>Age Line</strong>,” said Professor McGonagall sharply. “I am sure we are all agreed on that —” “Dumbly-dorr must","index":409627},{"text":"peanuts into his hands. … Everyone wanted to know how he had done it, how he had tricked Dumbledore’s <strong>Age Line</strong> and managed to get his name into the goblet. … “I didn’t,” he said, over and over again,","index":423144},{"text":"the way Ron was smiling: It was more like a grimace. “Well … no one else got across the <strong>Age Line</strong>,” said Ron. “Not even Fred and George. What did you use — the Invisibility Cloak?” “The Invisibility Cloak","index":424656}],"Apparate":[{"text":"light a fire to send the boys back, and then I can repair your fireplace before I Dis<strong>apparate</strong>.” Harry was ready to bet that the Dursleys hadn’t understood a single word of this. They were still","index":66268},{"text":"“So they’re still in bed?” said Fred grumpily, pulling his bowl of porridge toward him. “Why can’t we <strong>Apparate</strong> too?” “Because you’re not of age and you haven’t passed your test,” snapped Mrs. Weasley. “And where have","index":97792},{"text":"out of the kitchen and they heard her climbing the stairs. “You have to pass a test to <strong>Apparate</strong>?” Harry asked. “Oh yes,” said Mr. Weasley, tucking the tickets safely into the back pocket of his jeans.","index":98027},{"text":"all do it?” “Charlie had to take the test twice,” said Fred, grinning. “He failed the first time, <strong>Apparate</strong>d five miles south of where he meant to, right on top of some poor old dear doing her","index":99405},{"text":"too many clogging up their buses and trains — remember, wizards are coming from all over the world. Some <strong>Apparate</strong>, of course, but we have to set up safe points for them to appear, well away from Muggles.","index":103368},{"text":"I believe there’s a handy wood they’re using as the Apparition point. For those who don’t want to <strong>Apparate</strong>, or can’t, we use Portkeys. They’re objects that are used to transport wizards from one spot to another","index":103565},{"text":"anti-Muggle security. Blimey, I’ll be glad when this is over. See you later, Arthur.” He Dis<strong>apparate</strong>d. “I thought Mr. Bagman was Head of Magical Games and Sports,” said Ginny, looking surprised. “He should know","index":114570},{"text":"cooking eggs and sausages when Bill, Charlie, and Percy came strolling out of the woods toward them. “Just <strong>Apparate</strong>d, Dad,” said Percy loudly. “Ah, excellent, lunch!” They were halfway through their plates of eggs and sausages when","index":127623},{"text":"we really can’t spare anyone at the moment. Oh — talk of the devil! Barty!” A wizard had just <strong>Apparate</strong>d at their fireside, and he could not have made more of a contrast with Ludo Bagman, sprawled on","index":133303},{"text":"Top Box with me — I’m commentating!” He waved, Barty Crouch nodded curtly, and both of them Dis<strong>apparate</strong>d. “What’s happening at Hogwarts, Dad?” said Fred at once. “What were they talking about?” “You’ll find out soon","index":136925},{"text":"of Muggles. …” Bagman swore loudly. “Damn them!” he said, looking quite distracted, and without another word, he Dis<strong>apparate</strong>d with a small pop! “Not exactly on top of things, Mr. Bagman, is he?” said Hermione, frowning. “He","index":189372},{"text":"trees. “We’re too late,” said the witch in the woolen dressing gown, shaking her head. “They’ll have Dis<strong>apparate</strong>d.” “I don’t think so,” said a wizard with a scrubby brown beard. It was Amos Diggory, Cedric’s father.","index":195735},{"text":"creature is permitted to carry or use a wand.” Just then there was another pop, and Ludo Bagman <strong>Apparate</strong>d right next to Mr. Weasley. Looking breathless and disorientated, he spun on the spot, goggling upward at the","index":197924},{"text":"“there … in the trees, sir. …” “You see, Amos?” said Mr. Weasley. “Whoever conjured the Mark could have Dis<strong>apparate</strong>d right after they’d done it, leaving Harry’s wand behind. A clever thing to do, not using their own","index":204862},{"text":"it’s not Him,” said Mr. Weasley impatiently. “We don’t know who it was; it looks like they Dis<strong>apparate</strong>d. Now excuse me, please, I want to get to bed.” He led Harry, Ron, and Hermione through the","index":209210},{"text":"tonight, whoever conjured it. It scared the Death Eaters away the moment they saw it. They all Dis<strong>apparate</strong>d before we’d got near enough to unmask any of them. We caught the Robertses before they hit the","index":212351},{"text":"little reunion for them,” he finished disgustedly. “But if they were the Death Eaters, why did they Dis<strong>apparate</strong> when they saw the Dark Mark?” said Ron. “They’d have been pleased to see it, wouldn’t they?” “Use","index":213742},{"text":"Mr. Weasley to Harry, Ron, and the twins, fastening a cloak over his shoulders and preparing to Dis<strong>apparate</strong>. “Molly, are you going to be all right taking the kids to King’s Cross?” “Of course I will,”","index":238299},{"text":"Weasley only smiled and waved. Before the train had rounded the corner, she, Bill, and Charlie had Dis<strong>apparate</strong>d. Harry, Ron, and Hermione went back to their compartment. The thick rain splattering the windows made it very","index":244280},{"text":"starry sky. “I don’t think so … not from that far away. …” “A Portkey?” Ron suggested. “Or they could <strong>Apparate</strong> — maybe you’re allowed to do it under seventeen wherever they come from?” “You can’t <strong>Apparate</strong> inside the Hogwarts","index":357465},{"text":"off to the campsite.” “How d’you know?” Hermione shot back. “How d’you know where he Dis<strong>apparate</strong>d to?” “Come off it,” said Ron incredulously. “Are you saying you reckon Ludo Bagman conjured the Dark Mark?”","index":783041},{"text":"head. “He seemed really weak — I don’t reckon he was up to Disapparating or anything.” “You can’t Dis<strong>apparate</strong> on the Hogwarts grounds, haven’t I told you enough times?” said Hermione. “Okay … how’s this for a theory,”","index":842304},{"text":"Potter. Summoned it from my office into the forest. He wasn’t anywhere on there.” “So he did Dis<strong>apparate</strong>?” said Ron. “You can’t Dis<strong>apparate</strong> on the grounds, Ron!” said Hermione. “There are other ways he could have","index":850607},{"text":"of summoning us to him. When he touched the Mark of any Death Eater, we were to Dis<strong>apparate</strong>, and <strong>Apparate</strong>, instantly, at his side. This Mark has been growing clearer all year. Karkaroff’s too. Why do","index":1059614}],"Avada Kedavra":[{"text":"slightly as, for the third time, she raised it into the air. “Yes?” said Moody, looking at her. “<strong>Avada Kedavra</strong>,” Hermione whispered. Several people looked uneasily around at her, including Ron. “Ah,” said Moody, another slight smile","index":317948},{"text":"her, including Ron. “Ah,” said Moody, another slight smile twisting his lopsided mouth. “Yes, the last and worst. <strong>Avada Kedavra</strong> … the Killing Curse.” He put his hand into the glass jar, and almost as though it knew","index":318139},{"text":"scuttle frantically across the wooden surface. Moody raised his wand, and Harry felt a sudden thrill of foreboding. “<strong>Avada Kedavra</strong>!” Moody roared. There was a flash of blinding green light and a rushing sound, as though a","index":318540},{"text":"With a massive effort, he pulled himself back to the present and listened to what Moody was saying. “<strong>Avada Kedavra</strong>’s a curse that needs a powerful bit of magic behind it — you could all get your wands","index":320763},{"text":"where you’re facing it. CONSTANT VIGILANCE!” he roared, and the whole class jumped again. “Now … those three curses — <strong>Avada Kedavra</strong>, Imperius, and Cruciatus — are known as the Unforgivable Curses. The use of any one of them on","index":321313},{"text":"“Fred and George were right, weren’t they? He really knows his stuff, Moody, doesn’t he? When he did <strong>Avada Kedavra</strong>, the way that spider just died, just snuffed it right —” But Ron fell suddenly silent at the","index":324356},{"text":"say, “Kill the spare.” A swishing noise and a second voice, which screeched the words to the night: “<strong>Avada Kedavra</strong>!” A blast of green light blazed through Harry’s eyelids, and he heard something heavy fall to the","index":950846},{"text":"for this. He knew he was facing the thing against which Moody had always warned … the un-blockable <strong>Avada Kedavra</strong> curse — and Voldemort was right — his mother was not here to die for him this time. … He","index":983850},{"text":"him, and threw himself around the headstone, facing Voldemort. Voldemort was ready. As Harry shouted, “Expelliarmus!” Voldemort cried, “<strong>Avada Kedavra</strong>!” A jet of green light issued from Voldemort’s wand just as a jet of red light blasted","index":988349}],"Avis":[{"text":"shot at Krum, who nodded. “Rather thicker than one usually sees … quite rigid … ten and a quarter inches … <strong>Avis</strong>!” The hornbeam wand let off a blast like a gun, and a number of small, twittering birds flew","index":459904}],"Confundus":[{"text":"hands. “Because they hoodwinked a very powerful magical object!” said Moody. “It would have needed an exceptionally strong <strong>Confundus</strong> Charm to bamboozle that goblet into forgetting that only three schools compete in the tournament. … I’m guessing","index":414092}],"Conjunctivitis":[{"text":"your name in that goblet shouldn’t be feeling too happy right now! I was going to suggest a <strong>Conjunctivitis</strong> Curse, as a dragon’s eyes are its weakest point — “That’s what Krum did!” Hermione whispered — but your way","index":603302}],"Crucio":[{"text":"away from Moody’s desk as possible. Moody raised his wand again, pointed it at the spider, and muttered, “<strong>Crucio</strong>!” At once, the spider’s legs bent in upon its body; it rolled over and began to twitch horribly,","index":316722},{"text":"The tip of a wand emerged from around the back of the chair. It was pointing at Wormtail. “<strong>Crucio</strong>!” said the cold voice. Wormtail screamed, screamed as though every nerve in his body were on fire, the","index":861107},{"text":"doing?” yelled Cedric’s voice. “What the hell d’you think you’re doing?” And then Harry heard Krum’s voice. “<strong>Crucio</strong>!” The air was suddenly full of Cedric’s yells. Horrified, Harry began sprinting up his path, trying to find","index":935854},{"text":"feet. “Master!” he shrieked, “Master, forgive me! Forgive us all!” Voldemort began to laugh. He raised his wand. “<strong>Crucio</strong>!” The Death Eater on the ground writhed and shrieked; Harry was sure the sound must carry to the","index":966336},{"text":"believed had been my downfall. …” Voldemort moved slowly forward and turned to face Harry. He raised his wand. “<strong>Crucio</strong>!” It was pain beyond anything Harry had ever experienced; his very bones were on fire; his head was","index":981206}],"Deletrius":[{"text":"above them; it looked as though it were made of thick gray smoke: the ghost of a spell. “<strong>Deletrius</strong>!” Mr. Diggory shouted, and the smoky skull vanished in a wisp of smoke. “So,” said Mr. Diggory with","index":202729}],"Densaugeo":[{"text":"second, they looked into each other’s eyes, then, at exactly the same time, both acted. “Furnunculus!” Harry yelled. “<strong>Densaugeo</strong>!” screamed Malfoy. Jets of light shot from both wands, hit each other in midair, and ricocheted off at","index":443228}],"Diffindo":[{"text":"Harry an idea. Pausing at a distance from them, he pulled out his wand, and took careful aim. “<strong>Diffindo</strong>!” Cedric’s bag split. Parchment, quills, and books spilled out of it onto the floor. Several bottles of ink","index":505981}],"(Drought Charm)":[{"text":"side of the table. “There’s nothing. Nothing. Closest was that thing to dry up puddles and ponds, that <strong>Drought Charm</strong>, but that was nowhere near powerful enough to drain the lake.” “There must be something,” Hermione muttered,","index":724504}],"Engorgio":[{"text":"be a bit bigger for you to get the idea,” he said, pointing his wand at the spider. “<strong>Engorgio</strong>!” The spider swelled. It was now larger than a tarantula. Abandoning all pretense, Ron pushed his chair backward,","index":316486}],"Ennervate":[{"text":"to take his silence for assent. He raised his own wand, pointed it at Winky, and said, “R<strong>ennervate</strong>!” Winky stirred feebly. Her great brown eyes opened and she blinked several times in a bemused sort of","index":199298},{"text":"like a ghostly bird. Then Dumbledore bent over Krum again, pointed his wand at him, and muttered, “R<strong>ennervate</strong>.” Krum opened his eyes. He looked dazed. When he saw Dumbledore, he tried to sit up, but Dumbledore","index":836328},{"text":"and poured three drops inside it. Then he pointed his wand at the man’s chest and said, “R<strong>ennervate</strong>.” Crouch’s son opened his eyes. His face was slack, his gaze unfocused. Dumbledore knelt before him, so that","index":1019567}],"Expecto Patronum":[{"text":"thought of getting out of the maze and celebrating with Ron and Hermione, raised his wand, and cried, “<strong>Expecto Patronum</strong>!” A silver stag erupted from the end of Harry’s wand and galloped toward the dementor, which fell","index":930534}],"Expelliarmus":[{"text":"more effect than Harry’s — Harry raised his wand as the spider opened its pincers once more and shouted “<strong>Expelliarmus</strong>!” It worked — the Disarming Spell made the spider drop him, but that meant that Harry fell twelve feet","index":943757},{"text":"at Hogwarts he had attended briefly two years ago. … All he had learned there was the Disarming Spell, “<strong>Expelliarmus</strong>” … and what use would it be to deprive Voldemort of his wand, even if he could, when he","index":983521},{"text":"in front of him, and threw himself around the headstone, facing Voldemort. Voldemort was ready. As Harry shouted, “<strong>Expelliarmus</strong>!” Voldemort cried, “Avada Kedavra!” A jet of green light issued from Voldemort’s wand just as a jet of","index":988316}],"(Extinguishing Spell)":[{"text":"fight ’em?” “Just get past them, I think,” said Charlie. “We’ll be on hand if it gets nasty, <strong>Extinguishing Spell</strong>s at the ready. They wanted nesting mothers, I don’t know why … but I tell you this, I","index":488221}],"Furnunculus":[{"text":"For a split second, they looked into each other’s eyes, then, at exactly the same time, both acted. “<strong>Furnunculus</strong>!” Harry yelled. “Densaugeo!” screamed Malfoy. Jets of light shot from both wands, hit each other in midair, and","index":443199},{"text":"on Malfoy as he followed Fred inside. “Interesting effect,” said George, looking down at Crabbe. “Who used the <strong>Furnunculus</strong> Curse?” “Me,” said Harry. “Odd,” said George lightly. “I used Jelly-Legs. Looks as though those two shouldn’t","index":1089231}],"Impedimenta":[{"text":"of his head. The skrewt issued a blast of fire from its end and flew forward toward him. “<strong>Impedimenta</strong>!” Harry yelled. The spell hit the skrewt’s armor again and ricocheted off; Harry staggered back a few paces","index":934923},{"text":"spell hit the skrewt’s armor again and ricocheted off; Harry staggered back a few paces and fell over. “<strong>IMPEDIMENTA</strong>!” The skrewt was inches from him when it froze — he had managed to hit it on its fleshy,","index":935059},{"text":"well have thrown a stone at it; the spider jerked, scuttled around, and ran at Harry instead. “Stupefy! <strong>Impedimenta</strong>! Stupefy!” But it was no use — the spider was either so large, or so magical, that the spells","index":943166},{"text":"shatter as the spells hit it. Gripping his wand more tightly, he dashed out from behind the angel — “<strong>Impedimenta</strong>!” he bellowed, pointing his wand wildly over his shoulder at the Death Eaters running at him. From a","index":997678}],"Imperio":[{"text":"his hand so that they could all see it. He then pointed his wand at it and muttered, “<strong>Imperio</strong>!” The spider leapt from Moody’s hand on a fine thread of silk and began to swing backward and","index":314093},{"text":"the space that Moody had cleared of desks. Moody raised his wand, pointed it at Harry, and said, “<strong>Imperio</strong>!” It was the most wonderful feeling. Harry felt a floating sensation as every thought and worry in his","index":341519},{"text":"drink only single-malt whiskey?” “It will be attended to,” said Dumbledore, also bowing. “Come,” said Madame Maxime <strong>imperio</strong>usly to her students, and the Hogwarts crowd parted to allow her and her students to pass up the","index":363077},{"text":"chandelier, and her gigantic black-satin bosom swelled. “What is ze meaning of zis, Dumbly-dorr?” she said <strong>imperio</strong>usly. “I’d rather like to know that myself, Dumbledore,” said Professor Karkaroff. He was wearing a steely smile,","index":407772},{"text":"flashed at the sight of them. All three of them bowed low to him, and after regarding them <strong>imperio</strong>usly for a moment, Buckbeak bent his scaly front knees and allowed Hermione to rush forward and stroke his","index":777579},{"text":"to beg. … “I asked you whether you want me to do that again,” said Voldemort softly. “Answer me! <strong>Imperio</strong>!” And Harry felt, for the third time in his life, the sensation that his mind had been wiped","index":986028}],"Incendio":[{"text":"his robes and took out his wand. Harry saw the Dursleys draw back against the wall as one. “<strong>Incendio</strong>!” said Mr. Weasley, pointing his wand at the hole in the wall behind him. Flames rose at once","index":69475}],"Lumos":[{"text":"Hermione anxiously, stopping so abruptly that Harry walked into her. “Ron, where are you? Oh this is stupid — <strong>lumos</strong>!” She illuminated her wand and directed its narrow beam across the path. Ron was lying sprawled on the","index":180897},{"text":"the Invisibility Cloak and go back to the library, he’d stay there all night if he had to. … “<strong>Lumos</strong>,” Harry whispered fifteen minutes later as he opened the library door. Wand tip alight, he crept along the","index":729207},{"text":"Harry shouted. No one answered. “They were here,” Harry said to Dumbledore. “They were definitely somewhere around here. …” “<strong>Lumos</strong>,” Dumbledore said, lighting his wand and holding it up. Its narrow beam traveled from black trunk to black","index":835449},{"text":"entered the maze. Harry felt almost as though he were underwater again. He pulled out his wand, muttered, “<strong>Lumos</strong>,” and heard Cedric do the same just behind him. After about fifty yards, they reached a fork. They","index":928147}],"Obliviate":[{"text":"that moment, a wizard in plus-fours appeared out of thin air next to Mr. Roberts’s front door. “<strong>Obliviate</strong>!” he said sharply, pointing his wand at Mr. Roberts. Instantly, Mr. Roberts’s eyes slid out of focus, his","index":113623}],"Orchideous":[{"text":"you …” Mr. Ollivander ran his fingers along the wand, apparently checking for scratches or bumps; then he muttered, “<strong>Orchideous</strong>!” and a bunch of flowers burst from the wand tip. “Very well, very well, it’s in fine working","index":458124}],"Point Me":[{"text":"growing darker with every passing minute as the sky overhead deepened to navy. He reached a second fork. “<strong>Point Me</strong>,” he whispered to his wand, holding it flat in his palm. The wand spun around once and","index":928935},{"text":"he might have a chance. … Harry broke into a run. He had a choice of paths up ahead. “<strong>Point Me</strong>!” he whispered again to his wand, and it spun around and pointed him to the right-hand","index":941972}],"Priori Incantatem":[{"text":"where the Death Eaters stood watching. “Now untie him, Wormtail, and give him back his wand.” \fChapter 34 <strong>Priori Incantatem</strong> Wormtail approached Harry, who scrambled to find his feet, to support his own weight before the ropes","index":982364},{"text":"Harry to Dumbledore. “Why?” Harry looked up at Dumbledore again, on whose face there was an arrested look. “<strong>Priori Incantatem</strong>,” he muttered. His eyes gazed into Harry’s and it was almost as though an invisible beam of","index":1039245}],"Prior Incantato":[{"text":"ears flapping, as Mr. Diggory raised his own wand again and placed it tip to tip with Harry’s. “<strong>Prior Incantato</strong>!” roared Mr. Diggory. Harry heard Hermione gasp, horrified, as a gigantic serpent-tongued skull erupted from the","index":202431}],"Quietus":[{"text":"and still grinning in a bemused sort of way), Bagman pointed his wand at his throat and muttered, “<strong>Quietus</strong>.” “They’ll be talking about this one for years,” he said hoarsely, “a really unexpected twist, that. … shame it","index":173874}],"Reducio":[{"text":"his eyes wide and horrified. Moody raised his wand. The spider’s legs relaxed, but it continued to twitch. “<strong>Reducio</strong>,” Moody muttered, and the spider shrank back to its proper size. He put it back into the jar.","index":317394}],"Reducto":[{"text":"at lunchtimes. Harry had soon mastered the Impediment Curse, a spell to slow down and obstruct attackers; the <strong>Reducto</strong>r Curse, which would enable him to blast solid objects out of his way; and the Four-Point Spell,","index":908455},{"text":"some kind of enchantment. He wondered whether he might be able to blast it out of the way. “<strong>Reducto</strong>!” he said. The spell shot straight through the mist, leaving it intact. He supposed he should have known","index":931514},{"text":"The spell shot straight through the mist, leaving it intact. He supposed he should have known better; the <strong>Reducto</strong>r Curse was for solid objects. What would happen if he walked through the mist? Was it worth chancing","index":931639},{"text":"began sprinting up his path, trying to find a way into Cedric’s. When none appeared, he tried the <strong>Reducto</strong>r Curse again. It wasn’t very effective, but it burned a small hole in the hedge through which Harry","index":936023}],"Relashio":[{"text":"risen out of the weed, had seized handfuls of Harry’s robes, and were attempting to drag him down. “<strong>Relashio</strong>!” Harry shouted, except that no sound came out. … A large bubble issued from his mouth, and his wand,","index":739953}],"Rennervate":[{"text":"seemed to take his silence for assent. He raised his own wand, pointed it at Winky, and said, “<strong>Rennervate</strong>!” Winky stirred feebly. Her great brown eyes opened and she blinked several times in a bemused sort of","index":199297},{"text":"trees like a ghostly bird. Then Dumbledore bent over Krum again, pointed his wand at him, and muttered, “<strong>Rennervate</strong>.” Krum opened his eyes. He looked dazed. When he saw Dumbledore, he tried to sit up, but Dumbledore","index":836327},{"text":"open and poured three drops inside it. Then he pointed his wand at the man’s chest and said, “<strong>Rennervate</strong>.” Crouch’s son opened his eyes. His face was slack, his gaze unfocused. Dumbledore knelt before him, so that","index":1019566}],"Reparo":[{"text":"hard behind them that the glass shattered. “Ron!” said Hermione reproachfully, and she pulled out her wand, muttered “<strong>Reparo</strong>!” and the glass shards flew back into a single pane and back into the door. “Well … making it","index":251231}],"Riddikulus":[{"text":"a dementor stumble. “Hang on!” he shouted, advancing in the wake of his silver Patronus. “You’re a boggart! <strong>Riddikulus</strong>!” There was a loud crack, and the shape-shifter exploded in a wisp of smoke. The silver stag","index":930824}],"Sonorus":[{"text":"are, Ludo,” said Fudge comfortably. Ludo whipped out his wand, directed it at his own throat, and said “<strong>Sonorus</strong>!” and then spoke over the roar of sound that was now filling the packed stadium; his voice echoed","index":151411},{"text":"judges’ table; he pointed his wand at his throat as he had done at the World Cup, said, “<strong>Sonorus</strong>!” and his voice boomed out across the dark water toward the stands. “Well, all our champions are ready","index":735545},{"text":"in different directions, to station themselves around the maze. Bagman now pointed his wand at his throat, muttered, “<strong>Sonorus</strong>,” and his magically magnified voice echoed into the stands. “Ladies and gentlemen, the third and final task of","index":926905}],"Stupefy":[{"text":"pausing to think, he yelled, “DUCK!” He seized the other two and pulled them down onto the ground. “<strong>STUPEFY</strong>!” roared twenty voices — there was a blinding series of flashes and Harry felt the hair on his head","index":193358},{"text":"“Stunning Spells, on the count of three!” Harry saw each of the dragon keepers pull out his wand. “<strong>Stupefy</strong>!” they shouted in unison, and the Stunning Spells shot into the darkness like fiery rockets, bursting in showers","index":485884},{"text":"over its back. Its thick armor glinted in the light from Harry’s wand, which he pointed at it. “<strong>Stupefy</strong>!” The spell hit the skrewt’s armor and rebounded; Harry ducked just in time, but could smell burning hair;","index":934696},{"text":"up and pointed his wand at Krum just as Krum looked up. Krum turned and began to run. “<strong>Stupefy</strong>!” Harry yelled. The spell hit Krum in the back; he stopped dead in his tracks, fell forward, and","index":936478},{"text":"of his hand as a gigantic spider stepped into the path and began to bear down upon Cedric. “<strong>Stupefy</strong>!” Harry yelled; the spell hit the spider’s gigantic, hairy black body, but for all the good it did,","index":942942},{"text":"as well have thrown a stone at it; the spider jerked, scuttled around, and ran at Harry instead. “<strong>Stupefy</strong>! Impedimenta! <strong>Stupefy</strong>!” But it was no use — the spider was either so large, or so magical, that the","index":943157},{"text":"leg connected with the pincers and next moment he was in excruciating pain. He could hear Cedric yelling “<strong>Stupefy</strong>!” too, but his spell had no more effect than Harry’s — Harry raised his wand as the spider opened","index":943616},{"text":"to think, he aimed high at the spider’s underbelly, as he had done with the skrewt, and shouted “<strong>Stupefy</strong>!” just as Cedric yelled the same thing. The two spells combined did what one alone had not: The","index":944044},{"text":"conquer you!” Moody raised his wand, he opened his mouth; Harry plunged his own hand into his robes — “<strong>Stupefy</strong>!” There was a blinding flash of red light, and with a great splintering and crashing, the door of","index":1012065}],"Switching Spell":[{"text":"the staff seemed oddly tense too. “Longbottom, kindly do not reveal that you can’t even perform a simple <strong>Switching Spell</strong> in front of anyone from Durmstrang!” Professor McGonagall barked at the end of one particularly difficult","index":349508},{"text":"down, and began to flick through each in turn, Hermione whispering nonstop at his elbow. “Well, there are <strong>Switching Spell</strong>s … but what’s the point of Switching it? Unless you swapped its fangs for wine-gums or something","index":502774}],"(Unbreakable Charm)":[{"text":"her I’ll let her out when we get back to London,” said Hermione. “I’ve put an <strong>Unbreakable Charm</strong> on the jar, you see, so she can’t transform. And I’ve told her she’s to keep","index":1086909}]},"5":{"Accio":[{"text":"pointed his wand at the bullfrog that had been hopping hopefully toward the other side of the table — “<strong>Accio</strong>!”— and it zoomed gloomily back into his hand. Charms was always one of the best lessons in which","index":626740},{"text":"Ginny. “That’s right,” said Sirius encouragingly, “come on, let’s all … let’s all have a drink while we’re waiting. <strong>Accio</strong> Butterbeer!” He raised his wand as he spoke and half a dozen bottles came flying toward them out","index":802139},{"text":"down, please!” squeaked Professor Flitwick. “That means you too, Stebbins! Please remain seated while I collect your parchment! <strong>Accio</strong>!” More than a hundred rolls of parchment zoomed into the air and into Professor Flitwick’s outstretched arms, knocking","index":1089235},{"text":"Fred. “Definitely,” said George. And before Umbridge could say a word, they raised their wands and said together, “<strong>Accio</strong> Brooms!” Harry heard a loud crash somewhere in the distance. Looking to his left he ducked just in","index":1144470},{"text":"off home, will you?” The words were hardly out of his mouth when the female Death Eater shrieked, “<strong>Accio</strong> Proph —” Harry was just ready for her. He shouted “Protego!” before she had finished her spell, and though","index":1330198},{"text":"sprawled on his back on the table, with his head lying inside the jar full of glittering wind. “<strong>Accio</strong> Wand!” cried Hermione. Harry’s wand flew from a dark corner into her hand and she threw it to","index":1342936},{"text":"way, get down —” But Ron had already pointed his wand at the tank. “Honest, Harry, they’re brains — look — <strong>Accio</strong> Brain!” The scene seemed momentarily frozen. Harry, Ginny, and Neville and each of the Death Eaters turned in","index":1355682},{"text":"jerking legs, but the Shield Charm had stopped the worst of the spell. Dolohov raised his wand again. “<strong>Accio</strong> Proph —” Sirius hurtled out of nowhere, rammed Dolohov with his shoulder, and sent him flying out of the","index":1365092},{"text":"hear the terror behind the anger now. “YOU’VE GOT IT, POTTER, AND YOU WILL GIVE IT TO ME — <strong>Accio</strong> Prophecy! <strong>ACCIO</strong> PROPHECY!” Harry laughed again because he knew it would incense her, the pain building in his","index":1380134}],"Alohomora":[{"text":"Ron said quietly. The Healer pointed her wand at the door of the Janus Thickey ward and muttered “<strong>Alohomora</strong>.” The door swung open and she led the way inside, keeping a firm grasp on Gilderoy’s arm until","index":862292},{"text":"gave me a knife that’ll open any lock,” said Harry. “So even if she’s bewitched the door so <strong>Alohomora</strong> won’t work, which I bet she has —” “What do you think about this?” Hermione demanded of Ron, and","index":1115626},{"text":"pointed her wand at the place where a lock would have been on an ordinary door and said, “<strong>Alohomora</strong>!” Nothing happened. “Sirius’s knife!” said Harry, and he pulled it out from inside his robes and slid it","index":1318875},{"text":"something large and heavy collide with the door Hermione had charmed shut. “Stand aside!” said a rough voice. “<strong>Alohomora</strong>!” As the door flew open, Harry, Hermione, and Neville dived under desks. They could see the bottom of","index":1340367}],"Apparate":[{"text":"when I warned him —” “This bloke Mundungus has been following me? Hang on — it was him! He Dis<strong>apparate</strong>d from the front of my house!” “Yes, yes, yes, but luckily I’d stationed Mr. Tibbies under a","index":34082},{"text":"on duty until midnight — where is he? How am I going to tell Dumbledore what’s happened, I can’t <strong>Apparate</strong> —” “I’ve got an owl, you can borrow her,” Harry groaned, wondering whether his spine was going to","index":36854},{"text":"journey.” “How’re we getting — wherever we’re going?” Harry asked. “Brooms,” said Lupin. “Only way. You’re too young to <strong>Apparate</strong>, they’ll be watching the Floo Network, and it’s more than our life’s worth to set up an unauthorized","index":84122},{"text":"flagon of butterbeer onto the table and spilling almost as much again. “Bill didn’t feel the need to <strong>Apparate</strong> every few feet! Charlie didn’t Charm everything he met! Percy —” She stopped dead, catching her breath with a","index":139946},{"text":"bit was —” Crack. “OUCH!” “Keep your voice down, Ron, or Mum’ll be back up here.” “You two just <strong>Apparate</strong>d on my knees!” “Yeah, well, it’s harder in the dark —” Harry saw the blurred outlines of Fred and","index":164572},{"text":"to work, do you?” Harry asked him, as they set off briskly around the square. “No, I usually <strong>Apparate</strong>,” said Mr. Weasley, “but obviously you can’t, and I think it’s best we arrive in a thoroughly non-magical","index":205731},{"text":"of Spells, Grade 5, by Miranda Goshawk and Defensive Magical Theory, by Wilbert Slinkhard.” Crack. Fred and George <strong>Apparate</strong>d right beside Harry. He was so used to them doing this by now that he didn’t even fall","index":267972},{"text":"law-breaking days are finally over,” said George, shaking his head. And with another loud crack, the twins Dis<strong>apparate</strong>d. “Those two!” said Hermione furiously, staring up at the ceiling, through which they could now hear Fred and","index":275182},{"text":"work, it’s mainly jus’ pullin’ the school carriages unless Dumbledore’s takin’ a long journey an’ don’ want ter <strong>Apparate</strong> — an’ here’s another couple, look —” Two more horses came quietly out of the trees, one of them passing","index":748666},{"text":"Hermione, sounding thoroughly exasperated, “you’ll read Hogwarts, A History, and perhaps that will remind you that you can’t <strong>Apparate</strong> or Dis<strong>apparate</strong> inside Hogwarts. Even Voldemort couldn’t just make you fly out of your dormitory, Harry.” “You didn’t","index":843439},{"text":"upside down to see whether it looked better that way when, with a loud crack, Fred and George <strong>Apparate</strong>d at the foot of his bed. “Merry Christmas,” said George. “Don’t go downstairs for a bit.” “Why not?”","index":846682},{"text":"“Where is he?” “I don’t know!” shouted Kingsley, also leaping to his feet. “Well, he can’t have Dis<strong>apparate</strong>d!” cried Umbridge. “You can’t inside this school —” “The stairs!” cried Dawlish, and he flung himself upon the door,","index":1055530},{"text":"“I saw him, Mr. Fudge, I swear, it was You-Know-Who, he grabbed a woman and Dis<strong>apparate</strong>d!” “I know, Williamson, I know, I saw him too!” gibbered Fudge, who was wearing pajamas under his pinstriped","index":1389297}],"Avada Kedavra":[{"text":"time.” “When he was powerful before?” “Yes.” “Like what kind of weapon?” said Harry. “Something worse than the <strong>Avada Kedavra</strong> — ?” “That’s enough.” Mrs. Weasley spoke from the shadows beside the door. Harry had not noticed her return","index":160865},{"text":"reckon it is?” said Harry. “Could be anything,” said Fred. “But there can’t be anything worse than the <strong>Avada Kedavra</strong> curse, can there?” said Ron. “What’s worse than death?” “Maybe it’s something that can kill loads of","index":165156},{"text":"more to say to you, Potter,” he said quietly. “You have irked me too often, for too long. <strong>AVADA KEDAVRA</strong>!” Harry had not even opened his mouth to resist. His mind was blank, his wand pointing uselessly","index":1381929}],"Bat-Bogey Hex":[{"text":"Ginny.” “What d’you mean?” said Harry. “You’ve never been on the receiving end of one of her <strong>Bat-Bogey Hex</strong>es, have you?” “Shhh!” said Fred, half-rising from the bed. “Listen!” They fell silent. Footsteps were","index":166151},{"text":"Impediment Jinx,” said Ron airily, now handing back Hermione’s wand too. “But Ginny was best, she got Malfoy — <strong>Bat-Bogey Hex</strong> — it was superb, his whole face was covered in the great flapping things. Anyway, we saw","index":1292443}],"(Cheering Charm)":[{"text":"hall two hours later, still clutching the exam paper. “I’m not sure I did myself justice on <strong>Cheering Charm</strong>s, I just ran out of time — did you put in the countercharm for hiccups? I wasn’t sure","index":1210429}],"Colloportus":[{"text":"in his hand, waited for the others to hurtle over the threshold before slamming the door behind them — “<strong>Colloportus</strong>!” gasped Hermione and the door sealed itself with an odd squelching noise. “Where — where are the others?” gasped","index":1338834},{"text":"in with Hermione. They were all over the threshold just in time to slam the door against Bellatrix. “<strong>Colloportus</strong>!” shouted Harry, and he heard three bodies slam into the door on the other side. “It doesn’t matter!”","index":1354019},{"text":"into a table and rolled over the top of it in his haste to reach the next door. “<strong>Colloportus</strong>!” There were footsteps running along behind the doors; every now and then another heavy body would launch itself","index":1354616}],"Crucio":[{"text":"hand clutching a wand rise on the end of his own arm … heard the high, cold voice say, “<strong>Crucio</strong>!” The man on the floor let out a scream of pain, attempted to stand but fell back, writhing.","index":1238643},{"text":"to him and his captor, her wand raised. “DON’D GIB ID DO DEM, HARRY!” Bellatrix raised her wand. “<strong>Crucio</strong>!” Neville screamed, his legs drawn up to his chest so that the Death Eater holding him was momentarily","index":1361197},{"text":"Harry such as he had never known before. He flung himself out from behind the fountain and bellowed “<strong>Crucio</strong>!” Bellatrix screamed. The spell had knocked her off her feet, but she did not writhe and shriek with","index":1377409},{"text":"I’ll give you a lesson —” Harry had been edging around the fountain on the other side. She screamed, “<strong>Crucio</strong>!” and he was forced to duck down again as the centaur’s arm, holding its bow, spun off and","index":1378179}],"Diffindo":[{"text":"He tugged and tore at them as the brain was pulled tight against him like an octopus’s body. “<strong>Diffindo</strong>!” yelled Harry, trying to sever the feelers wrapping themselves tightly around Ron before his eyes, but they would","index":1356806}],"(Disillusionment Charm)":[{"text":"Harry toward him with his wand. “I need to Disillusion you.” “You need to what?” said Harry nervously. “<strong>Disillusionment Charm</strong>,” said Moody, raising his wand. “Lupin says you’ve got an Invisibility Cloak, but it won’t stay on","index":89926},{"text":"wand; Harry felt as though something hot was trickling down his back this time and knew that the <strong>Disillusionment Charm</strong> must have lifted. “Now stay still, everyone, while I give us a bit of light in here,”","index":100508},{"text":"very cold trickled down the back of Harry’s neck; for a moment he thought someone was putting a <strong>Disillusionment Charm</strong> on him again, then he realized that Mrs. Weasley was attacking his hair with a wet comb.","index":204596}],"Entrail-Expelling":[{"text":"portrait of a rather vicious-looking wizard on the wall, captioned URQUHART RACKHARROW, 1612–1697, INVENTOR OF THE <strong>ENTRAIL-EXPELLING</strong> CURSE. There were only three patients. Mr. Weasley was occupying the bed at the far end of","index":820751}],"Evanesco":[{"text":"off toward an ancient dresser from which she started unloading dinner plates. Bill took out his wand, muttered “<strong>Evanesco</strong>!” and the scrolls vanished. “Sit down, Harry,” said Sirius. “You’ve met Mundungus, haven’t you?” The thing Harry had","index":133549},{"text":"loudly. “I forgot the hellebore. …” “I know you did, Potter, which means that this mess is utterly worthless. <strong>Evanesco</strong>.” The contents of Harry’s potion vanished; he was left standing foolishly beside an empty cauldron. “Those of you","index":389420}],"Expecto Patronum":[{"text":"face visible beneath its robes, sucking on the night as it came. Stumbling backward, Harry raised his wand. “<strong>Expecto Patronum</strong>!” A silvery wisp of vapor shot from the tip of the wand and the dementor slowed, but","index":29741},{"text":"slimy, scabbed hands slid from inside the dementor’s robes, reaching for him. A rushing noise filled Harry’s ears. “<strong>Expecto Patronum</strong>!” His voice sounded dim and distant. … Another wisp of silver smoke, feebler than the last, drifted from","index":30133},{"text":"see Ron and Hermione again — And their faces burst clearly into his mind as he fought for breath — “<strong>EXPECTO PATRONUM</strong>!” An enormous silver stag erupted from the tip of Harry’s wand; its antlers caught the dementor in","index":30920},{"text":"Patronus? For a bonus point … ?” Harry raised his wand, looked directly at Umbridge, and imagined her being sacked. “<strong>Expecto Patronum</strong>!” The silver stag erupted from the end of his wand and cantered the length of the hall.","index":1214814}],"Expelliarmus":[{"text":"sat down again, “shall we get practicing then? I was thinking, the first thing we should do is <strong>Expelliarmus</strong>, you know, the Disarming Charm. I know it’s pretty basic but I’ve found it really useful —” “Oh","index":658272},{"text":"it really useful —” “Oh please,” said Zacharias Smith, rolling his eyes and folding his arms. “I don’t think <strong>Expelliarmus</strong> is exactly going to help us against You-Know-Who, do you?” “I’ve used it against him,”","index":658466},{"text":"“Right — on the count of three, then — one, two, three —” The room was suddenly full of shouts of “<strong>Expelliarmus</strong>!”: Wands flew in all directions, missed spells hit books on shelves and sent them flying into the air.","index":659265},{"text":"merely causing them to jump backward a few paces or wince as the feeble spell whooshed over them. “<strong>Expelliarmus</strong>!” said Neville, and Harry, caught unawares, felt his wand fly out of his hand. “I DID IT!” said","index":659909},{"text":"being caught and punished by Filch for being out-of-bounds. He blew his whistle; everybody stopped shouting, “<strong>Expelliarmus</strong>!” and the last couple of wands clattered to the floor. “Well, that was pretty good,” said Harry, “but","index":664417},{"text":"he plunged his hand inside his robes, and his wand was halfway into the air when James shouted, “<strong>Expelliarmus</strong>!” Snape’s wand flew twelve feet into the air and fell with a little thud in the grass behind","index":1095353},{"text":"overturned his desk in his anxiety to help; pointing his wand wildly at the struggling pair he cried, “<strong>EXPELLIARMUS</strong>!” Both Harry’s and the Death Eater’s wands flew out of their hands and soared back toward the entrance","index":1341309}],"Flagrate":[{"text":"flames. “Wait!” said Hermione sharply, as Luna made to close the door of the brain room behind them. “<strong>Flagrate</strong>!” She drew with her wand in midair and a fiery X appeared on the door. No sooner had","index":1313506}],"(Flying Charm)":[{"text":"around the stadium. “What’s that Weasley’s riding?” Malfoy called in his sneering drawl. “Why would anyone put a <strong>Flying Charm</strong> on a moldy old log like that?” Crabbe, Goyle, and Pansy Parkinson guffawed and shrieked with laughter.","index":486339}],"Impedimenta":[{"text":"bellowing of the crowd around him, but he did not care, not until somebody in the vicinity yelled “<strong>IMPEDIMENTA</strong>!” and only when he was knocked over backward by the force of the spell did he abandon the","index":694035},{"text":"all divided up obediently; Harry partnered Neville as usual. The room was soon full of intermittent cries of “<strong>Impedimenta</strong>!” People froze for a minute or so, during which their partners would stare aimlessly around the room watching","index":763014},{"text":"and fell with a little thud in the grass behind him. Sirius let out a bark of laughter. “<strong>Impedimenta</strong>!” he said, pointing his wand at Snape, who was knocked off his feet, halfway through a dive toward","index":1095500},{"text":"open again and the two Death Eaters had come hurtling inside. With a cry of triumph, both yelled, “<strong>IMPEDIMENTA</strong>!” Harry, Hermione, and Neville were all knocked backward off their feet. Neville was thrown over the desk and","index":1345374},{"text":"pointed the wand instead at Neville, but Harry jabbed his own wand back over his shoulder and yelled, “<strong>Impedimenta</strong>!” Malfoy was blasted off his back. As Harry scrambled up again he looked around and saw Malfoy smash","index":1367283}],"Imperio":[{"text":"I think Molly’s right, Sirius. We’ve said enough.” Sirius half-shrugged but did not argue. Mrs. Weasley beckoned <strong>imperio</strong>usly to her sons and Hermione. One by one they stood up and Harry, recognizing defeat, followed suit. \fChapter","index":161867},{"text":"her traveling cloak, “I’m quite as good as new. You two — Crabbe — Goyle —” She beckoned them forward <strong>imperio</strong>usly and they came, shuffling their large feet and looking awkward. “Here,” said Professor McGonagall, thrusting her carpetbag","index":1451246}],"Impervius":[{"text":"in that storm?” “Hermione did it,” said Harry. He pulled out his wand, tapped his glasses and said, “<strong>Impervius</strong>!” “I think we all ought to try that,” said Angelina. “If we could just keep the rain off","index":635263},{"text":"we could just keep the rain off our faces it would really help visibility — all together, come on — <strong>Impervius</strong>! Okay. Let’s go.” They all stowed their wands back in the inside pockets of their robes, shouldered their","index":635430},{"text":"through the deepening mud to the middle of the pitch; visibility was still very poor even with the <strong>Impervius</strong> Charm; light was fading fast and curtains of rain were sweeping the grounds. “All right, on my whistle,”","index":635717}],"Incarcerous":[{"text":"animals!” “Be quiet!” shouted Hermione, but it was too late — Umbridge pointed her wand at Magorian and screamed, “<strong>Incarcerous</strong>!” Ropes flew out of midair like thick snakes, wrapping themselves tightly around the centaur’s torso and trapping his","index":1282873}],"Legilimens":[{"text":"at resisting the Imperius Curse. … You will find that similar powers are needed for this. … Brace yourself, now. … <strong>Legilimens</strong>!” Snape had struck before Harry was ready, before Harry had even begun to summon any force of resistance:","index":902573},{"text":"not to think, or remember, or feel. … “Let’s go again … on the count of three … one — two — three — <strong>Legilimens</strong>!” A great black dragon was rearing in front of him. … His father and mother were waving at him","index":905283},{"text":"it! Master yourself!” spat Snape. “Control your anger, discipline your mind! We shall try again! Get ready, now! <strong>Legilimens</strong>!” He was watching Uncle Vernon hammering the letter box shut. … A hundred dementors were drifting across the lake","index":906790},{"text":"my job. Now, if you are ready, we will start again. …” He raised his wand. “One — two — three — <strong>Legilimens</strong>!” A hundred dementors were swooping toward Harry across the lake in the grounds. … He screwed up his face","index":1000892},{"text":"not have time to gather himself together and attempt to clear his mind, for Snape had already cried “<strong>Legilimens</strong>!” He was hurtling along the corridor toward the Department of Mysteries, past the blank stone walls, past the","index":1003381},{"text":"laughed?” he croaked. “He did not wish to tell me,” said Dumbledore. “But I am a sufficiently accomplished <strong>Legilimens</strong> myself to know when I am being lied to and I — persuaded him — to tell me the full","index":1414776}],"Lumos":[{"text":"MOUTH SHUT! Wand!” Harry muttered frantically, his hands flying over the ground like spiders. “Where’s — wand — come on — <strong>Lumos</strong>!” He said the spell automatically, desperate for light to help him in his search — and to his disbelieving","index":29258},{"text":"“Why are we all standing in the dark?” said a third voice, this one completely unfamiliar, a woman’s. “<strong>Lumos</strong>.” A wand tip flared, illuminating the hall with magical light. Harry blinked. The people below were crowded around","index":77020},{"text":"we ge’ there, like.” “Good!” said Hermione, as Harry set her back on her feet. They both murmured “<strong>Lumos</strong>!” and their wand tips ignited. Hagrid’s face swam through the gloom by the light of the two wavering","index":1168786}],"Nox":[{"text":"Buckbeak’s room for hours at a time. His gloom seeped through the house, oozing under doorways like some <strong>nox</strong>ious gas, so that all of them became infected by it. Harry did not want to leave Sirius all","index":871960}],"Obliteration":[{"text":"walked back up to the castle through the thickening snow, leaving no trace behind them due to the <strong>Obliteration</strong> Charm Hermione was performing as they went. “Then I’ll go back again tomorrow,” said Hermione determinedly. “I’ll","index":738980}],"Permanent Sticking":[{"text":"said Sirius. “We’ve been trying to get her down for a month but we think she put a <strong>Permanent Sticking</strong> Charm on the back of the canvas. Let’s get downstairs, quick, before they all wake up again.”","index":130924},{"text":"it might be that,” said Sirius, casting a disdainful look at the opposite wall. “She’ll have put another <strong>Permanent Sticking</strong> Charm on the back of it, I don’t doubt, but if I can get rid of it","index":182868},{"text":"black. Only when Fred and George dropped in and offered to attach it to his forehead with a <strong>Permanent Sticking</strong> Charm did he wrap it tenderly in his maroon socks and lock it in his trunk. Mrs.","index":280816}],"Petrificus Totalus":[{"text":"the ground. Disentangling himself from his robes, he got quickly to his feet, wand up, but Sirius said, “<strong>Petrificus Totalus</strong>!” and Snape keeled over again at once, rigid as a board. “LEAVE HIM ALONE!” Lily shouted. She","index":1099008},{"text":"through the hole in his mask, but no sound came out; he was thrust aside by his fellow. “<strong>Petrificus Totalus</strong>!” shouted Harry, as the second Death Eater raised his wand. His arms and legs snapped together and","index":1346023},{"text":"doorway, his head bawling, his great fists still flailing uncontrollably at everything around him. Harry seized his chance: “<strong>PETRIFICUS TOTALUS</strong>!” The spell hit Dolohov before he could block it, and he toppled forward across his comrade, both","index":1348189},{"text":"wand to make the same slashing movement he had used on Harry and Hermione. Springing up, Harry yelled, “<strong>Petrificus Totalus</strong>!” Once again, Dolohov’s arms and legs snapped together and he keeled over backward, landing with a crash","index":1365537}],"Portus":[{"text":"carrying a blackened old kettle, which he placed carefully upon his desk. He raised his wand and murmured “<strong>Portus</strong>”; for a moment the kettle trembled, glowing with an odd blue light, then it quivered to a rest,","index":792367},{"text":"his hand, waited for the others to hurtle over the threshold before slamming the door behind them — “Collo<strong>portus</strong>!” gasped Hermione and the door sealed itself with an odd squelching noise. “Where — where are the others?” gasped","index":1338839},{"text":"with Hermione. They were all over the threshold just in time to slam the door against Bellatrix. “Collo<strong>portus</strong>!” shouted Harry, and he heard three bodies slam into the door on the other side. “It doesn’t matter!”","index":1354024},{"text":"a table and rolled over the top of it in his haste to reach the next door. “Collo<strong>portus</strong>!” There were footsteps running along behind the doors; every now and then another heavy body would launch itself","index":1354621},{"text":"place where the golden wizard’s head lay on the floor. He pointed his wand at it and muttered, “<strong>Portus</strong>.” The head glowed blue and trembled noisily against the wooden floor for a few seconds, then became still","index":1391759}],"Protego":[{"text":"breath. … And somehow, Snape was growing clearer, and the dementors were growing fainter … Harry raised his own wand. “<strong>Protego</strong>!” Snape staggered; his wand flew upward, away from Harry — and suddenly Harry’s mind was teeming with memories that","index":1001333},{"text":"his mouth when the female Death Eater shrieked, “Accio Proph —” Harry was just ready for her. He shouted “<strong>Protego</strong>!” before she had finished her spell, and though the glass sphere slipped to the tips of his fingers","index":1330255},{"text":"made the same slashing movement with his wand that he had used on Hermione just as Harry yelled, “<strong>Protego</strong>!” Harry felt something streak across his face like a blunt knife but the force of it knocked him","index":1364847},{"text":"as she peered around the fountain for him. She reacted so fast he barely had time to duck. “<strong>Protego</strong>!” The jet of red light, his own Stunning Spell, bounced back at him. Harry scrambled back behind the","index":1379006}],"Reducto":[{"text":"had mastered the Impediment Jinx after three meetings’ hard effort, how Parvati Patil had produced such a good <strong>Reducto</strong>r Curse that she had reduced the table carrying all the Sneakoscopes to dust. He was finding it almost","index":666859},{"text":"“But the Dark Lord knows you are not unintell —” “NOW!” yelled Harry. Five different voices behind him bellowed “<strong>REDUCTO</strong>!” Five curses flew in five different directions and the shelves opposite them exploded as they hit. The towering","index":1337134},{"text":"at the corner of Ron’s mouth and burst. “Anyway, one of them grabbed Ginny’s foot, I used the <strong>Reducto</strong>r Curse and blew up Pluto in his face, but …” Luna gestured hopelessly at Ginny, who was breathing in","index":1352470}],"Reparo":[{"text":"I’ll just clear this up.” He indicated the smashed bowl on the floor. Ron nodded and left. “<strong>Reparo</strong>,” Harry muttered, pointing his wand at the broken pieces of china. They flew back together, good as new,","index":552979},{"text":"had broken when he fell against it; the pickled slimy thing within was swirling in its draining potion. “<strong>Reparo</strong>!” hissed Snape, and the jar sealed itself once more. “Well, Potter … that was certainly an improvement. …” Panting slightly,","index":1002167},{"text":"desk with great difficulty, trembled for a few seconds, then folded, causing the cup to crack into two. “<strong>Reparo</strong>!” said Hermione quickly, mending Ron’s cup with a wave of her wand. “That’s all very well, but what","index":1151983}],"Riddikulus":[{"text":"couldn’t be — But wait a moment, it couldn’t be — Ron was downstairs — “Mrs. Weasley?” Harry croaked. “R-r-<strong>riddikulus</strong>!’’ Mrs. Weasley sobbed, pointing her shaking wand at Ron’s body. Crack. Ron’s body turned into Bill’s, spread-eagled","index":294001},{"text":"spread-eagled on his back, his eyes wide open and empty. Mrs. Weasley sobbed harder than ever. “R-<strong>riddikulus</strong>!” she sobbed again. Crack. Mr. Weasley’s body replaced Bill’s, his glasses askew, a trickle of blood running down","index":294213},{"text":"replaced Bill’s, his glasses askew, a trickle of blood running down his face. “No!” Mrs. Weasley moaned. “No … <strong>riddikulus</strong>! <strong>Riddikulus</strong>! <strong>RIDDIKULUS</strong>!” Crack. Dead twins. Crack. Dead Percy. Crack. Dead Harry … “Mrs. Weasley, just get out of here!”","index":294381},{"text":"and seemed to understand in an instant. Pulling out his own wand he said, very firmly and clearly, “<strong>Riddikulus</strong>!” Harry’s body vanished. A silvery orb hung in the air over the spot where it had lain. Lupin","index":294884}],"Scourgify":[{"text":"the trunk’s lid shut, “at least it’s all in. That could do with a bit of cleaning, too — <strong>Scourgify</strong> —” She pointed her wand at Hedwig’s cage; a few feathers and droppings vanished. “Well, that’s a bit better","index":88227},{"text":"mind,” said Ginny bracingly. “Look, we can get rid of all this easily.” She pulled out her wand. “<strong>Scourgify</strong>!” The Stinksap vanished. “Sorry,” said Neville again, in a small voice. Ron and Hermione did not turn up","index":313861},{"text":"and hexes, but his wand being ten feet away nothing happened. “Wash out your mouth,” said James coldly. “<strong>Scourgify</strong>!” Pink soap bubbles streamed from Snape’s mouth at once; the froth was covering his lips, making him gag,","index":1096801}],"Silencio":[{"text":"very, very close call last night,” said Hermione. “I just wonder if Umbridge knows how close it was. <strong>Silencio</strong>!” The bullfrog on which she was practicing her Silencing Charm was struck dumb mid-croak and glared at","index":628203},{"text":"his wand without really concentrating; his bullfrog swelled like a green balloon and emitted a high-pitched whistle. “<strong>Silencio</strong>!” said Hermione hastily, pointing her wand at Harry’s frog, which deflated silently before them. “Well, he mustn’t do","index":628576},{"text":"“I don’t reckon he’ll risk it again,” said Ron. “He’s not stupid, he knows she nearly got him. <strong>Silencio</strong>!” The large and ugly raven in front of him let out a derisive caw. “<strong>Silencio</strong>! <strong>SILENCIO</strong>!” The raven","index":628898},{"text":"Ron testily. “Fine, let’s swap,” said Hermione, seizing Ron’s raven and replacing it with her own fat bullfrog. “<strong>Silencio</strong>!” The raven continued to open and close its sharp beak, but no sound came out. “Very good, Miss","index":629307},{"text":"jumped. “Now, let me see you try, Mr. Weasley!” “Wha — ? Oh — oh, right,” said Ron, very flustered. “Er — <strong>Silencio</strong>!” He jabbed at the bullfrog so hard that he poked it in the eye; the frog gave a","index":629608},{"text":"dizzy and bewildered to react. “WE’VE GOT HIM!” yelled the Death Eater nearest Harry, “IN AN OFFICE OFF —” “<strong>Silencio</strong>!” cried Hermione, and the man’s voice was extinguished. He continued to mouth through the hole in his mask,","index":1345847}],"Stupefy":[{"text":"the second floor. “Hurry, Filch, hurry!” shrieked Umbridge. “They’ll be all over the school unless we do something — <strong>Stupefy</strong>!” A jet of red light shot out of the end of her wand and hit one of the","index":1071314},{"text":"merely ducked his head and sprinted onward; a hand caught him by the shoulder; he heard Hermione shout “<strong>Stupefy</strong>!” and the hand released him at once. They were at the end of row ninety-seven; Harry turned","index":1338330},{"text":"saw the knees of the Death Eaters bend. Poking his wand out from under the desk he shouted, “<strong>STUPEFY</strong>!” A jet of red light hit the nearest Death Eater; he fell backward into a grandfather clock and","index":1340760},{"text":"Neville, clearly determined to repair the damage. Harry flung himself sideways as Neville took aim again and shouted, “<strong>STUPEFY</strong>!” The jet of red light flew right over the Death Eater’s shoulder and hit a glass-fronted cabinet","index":1341783},{"text":"slipped so that he could not see, he ripped it off with his free hand and shouted, “STUP —” “<strong>STUPEFY</strong>!” screamed Hermione, who had just caught up with them. The jet of red light hit the Death Eater","index":1342359},{"text":"relinquished Harry at once with a howl of pain and Harry whirled around to face him and gasped, “<strong>STUPEFY</strong>!” The Death Eater keeled over backward and his mask slipped off. It was Macnair, Buckbeak’s would-be killer,","index":1363888},{"text":"him, and I know spells of such power that you, pathetic little boy, can never hope to compete —” “<strong>Stupefy</strong>!” yelled Harry. He had edged right around to where the goblin stood beaming up at the now headless","index":1378774}],"Switching Spell":[{"text":"went to bed, his head buzzing with complex spell models and theories. He forgot the definition of a <strong>Switching Spell</strong> during his written exam next morning, but thought his practical could have been a lot worse. At","index":1213483}],"Tarantallegra":[{"text":"his attacker was now bearing down upon Harry and Neville: Dolohov, his long pale face twisted with glee. “<strong>Tarantallegra</strong>!” he shouted, his wand pointing at Neville, whose legs went immediately into a kind of frenzied tap dance,","index":1364549}],"Wingardium Leviosa":[{"text":"within. The brains slipped and slid over him and began spinning their long, colored tentacles, but he shouted, “<strong>Wingardium Leviosa</strong>!” and they flew into the air away from him. Slipping and sliding he ran on toward the","index":1375174}]},"6":{"Accio":[{"text":"so he tried to summon his wand, which had fallen out of his hand, by saying the words “<strong>Accio</strong> Wand!” over and over again in his head, but nothing happened. He thought he could hear the rustling","index":227766},{"text":"it?” “Me? Oh … okay …” Harry had not expected this, but cleared his throat and said loudly, wand aloft, “<strong>Accio</strong> Horcrux!” With a noise like an explosion, something very large and pale erupted out of the dark water","index":840734},{"text":"very frightened. “Shall I run and fetch — ?” “No, Harry can do it.” Harry raised his wand at once. “<strong>Accio</strong> Rosmerta’s Brooms!” A second later they heard a loud bang as the front door of the pub burst","index":871004}],"Aguamenti":[{"text":"Saturday at breakfast. “We’ve got Quidditch tryouts this morning!” said Ron. “And we’re supposed to be practicing that <strong>Aguamenti</strong> Charm from Flitwick! Anyway, explain what? How are we going to tell him we hated his stupid subject?”","index":322663},{"text":"the goblet he had dropped in the basin; he barely registered the golden locket lying curled beneath it. “<strong>Aguamenti</strong>!” he shouted, jabbing the goblet with his wand. The goblet filled with clear water; Harry dropped to his","index":860303},{"text":"to his lips — but it was empty. Dumbledore groaned and began to pant. “But I had some — wait — <strong>Aguamenti</strong>!” said Harry again, pointing his wand at the goblet. Once more, for a second, clear water gleamed within","index":860577},{"text":"could hear him; he had rolled onto his side and was drawing great, rattling breaths that sounded agonizing. “<strong>Aguamenti</strong> — <strong>Aguamenti</strong> — <strong>AGUAMENTI</strong>!” The goblet filled and emptied once more. And now Dumbledore’s breathing was fading. His brain whirling","index":860964},{"text":"cut under one eye, which was swelling rapidly. “We should put out your house,” said Harry, “the charm’s ‘<strong>Aguamenti</strong>’ …” “Knew it was summat like that,” mumbled Hagrid, and he raised a smoldering pink, flowery umbrella and said,","index":906902},{"text":"“Knew it was summat like that,” mumbled Hagrid, and he raised a smoldering pink, flowery umbrella and said, “<strong>Aguamenti</strong>!” A jet of water flew out of the umbrella tip. Harry raised his wand arm, which felt like","index":907025},{"text":"water flew out of the umbrella tip. Harry raised his wand arm, which felt like lead, and murmured “<strong>Aguamenti</strong>” too: Together, he and Hagrid poured water on the house until the last flame was extinguished. “S’not","index":907145}],"Alohomora":[{"text":"behind. But when he put out a hand to push open the gates, he found them chained shut. “<strong>Alohomora</strong>!” he said confidently, pointing his wand at the padlock, but nothing happened. “That won’t work on these,” said","index":232789}],"Anapneo":[{"text":"of pheasant; in his haste to answer Slughorn he swallowed too fast, turned purple, and began to choke. “<strong>Anapneo</strong>,” said Slughorn calmly, pointing his wand at Belby, whose airway seemed to clear at once. “Not … not much","index":210733}],"Apparate":[{"text":"memorial and a few benches. His comprehension catching up with his senses, Harry realized that he had just <strong>Apparate</strong>d for the first time in his life. “Are you all right?” asked Dumbledore, looking down at him solicitously.","index":87113},{"text":"a look over his shoulder and grasped his wand reassuringly in his pocket. “Professor, why couldn’t we just <strong>Apparate</strong> directly into your old colleague’s house?” “Because it would be quite as rude as kicking down the front","index":89388},{"text":"In any case, most Wizarding dwellings are magically protected from unwanted Apparators. At Hogwarts, for instance —” “— you can’t <strong>Apparate</strong> anywhere inside the buildings or grounds,” said Harry quickly. “Hermione Granger told me.” “And she is quite right.","index":89740},{"text":"she survived,” said Dumbledore, reseating himself behind his desk and indicating that Harry should sit down too. “Ogden <strong>Apparate</strong>d back to the Ministry and returned with reinforcements within fifteen minutes. Morfin and his father attempted to fight,","index":313472},{"text":"his hands fly off Mundungus’s throat. Gasping and spluttering, Mundungus seized his fallen case, then — CRACK — he Dis<strong>apparate</strong>d. Harry swore at the top of his voice, spinning on the spot to see where Mundungus had gone.","index":364784},{"text":"hat to match his smoking jacket. Gripping Harry’s arm so tightly he might have been hoping to Dis<strong>apparate</strong> with him, Slughorn led him purposefully into the party; Harry seized Luna’s hand and dragged her along with","index":469340},{"text":"ever since — oh no, here he comes!” She moved so fast it was as though she had Dis<strong>apparate</strong>d; one moment she was there, the next, she had squeezed between two guffawing witches and vanished. “Seen Hermione?”","index":473800},{"text":"actual test?” “Soon as we’re seventeen. That’s only March for me!” “Yeah, but you wouldn’t be able to <strong>Apparate</strong> in here, not in the castle …” “Not the point, is it? Everyone would know I could <strong>Apparate</strong> if","index":528084},{"text":"a hoselike jet that ricocheted off the ceiling and knocked Professor Flitwick flat on his face. “Harry’s already <strong>Apparate</strong>d,” Ron told a slightly abashed Seamus, after Professor Flitwick had dried himself off with a wave of his","index":528941},{"text":"Twycross continued, as though there had been no interruption. “As you may know, it is usually impossible to <strong>Apparate</strong> or Dis<strong>apparate</strong> within Hogwarts. The headmaster has lifted this enchantment, purely within the Great Hall, for one hour,","index":571527},{"text":"hour, so as to enable you to practice. May I emphasize that you will not be able to <strong>Apparate</strong> outside the walls of this Hall, and that you would be unwise to try. “I would like each","index":571734},{"text":"command, now … one —” Harry glanced around again; lots of people were looking positively alarmed at being asked to <strong>Apparate</strong> so quickly. “— two —” Harry tried to fix his thoughts on his hoop again; he had already forgotten what","index":574923},{"text":"don’t care about that now —” “What d’you mean, you don’t care? Don’t you want to learn to <strong>Apparate</strong>?” said Ron incredulously. “I’m not fussed, really, I prefer flying,” said Harry, glancing over his shoulder to","index":577448},{"text":"he slid out of bed to get dressed. “Come on, if you don’t hurry up, you’ll have to <strong>Apparate</strong> on an empty stomach. … Might make it easier, I suppose …” Ron looked thoughtfully at the box of Chocolate","index":583850},{"text":"place (heavily supervised) in Hogsmeade. Ron had panicked on reading this notice; he had still not managed to <strong>Apparate</strong> and feared he would not be ready for the test. Hermione, who had now achieved Apparition twice, was","index":669757},{"text":"seventeen for another four months, could not take the test whether ready or not. “At least you can <strong>Apparate</strong>, though!” said Ron tensely. “You’ll have no trouble come July!” “I’ve only done it once,” Harry reminded","index":670018},{"text":"hear —” “Get out of it,” Harry snapped at him, and Kreacher made one last deep bow and Dis<strong>apparate</strong>d. “You’d better go and get some sleep too, Dobby.” “Thank you, Harry Potter, sir!” squeaked Dobby happily, and","index":677856},{"text":"girls’ dormitories had closed behind her he rounded on Ron. “What d’you think?” “Wish I could Dis<strong>apparate</strong> like a house-elf,” said Ron, staring at the spot where Dobby had vanished. “I’d have that","index":681149},{"text":"said Snape. “I would expect nothing more sophisticated from you, Ronald Weasley, the boy so solid he cannot <strong>Apparate</strong> half an inch across a room.” “No!” whispered Hermione, grabbing Harry’s arm as he opened his mouth furiously.","index":689396},{"text":"were only three of them in Potions that afternoon: Harry, Ernie, and Draco Malfoy. “All too young to <strong>Apparate</strong> just yet?” said Slughorn genially. “Not turned seventeen yet?” They shook their heads. “Ah well,” said Slughorn cheerily,","index":707490},{"text":"at the bottom of the drive came into view, “will we be Apparating?” “Yes,” said Dumbledore. “You can <strong>Apparate</strong> now, I believe?” “Yes,” said Harry, “but I haven’t got a license.” He felt it best to be","index":829089},{"text":"more worried by Dumbledore’s silence than he had been by his weakened voice. “We’re nearly there. … I can <strong>Apparate</strong> us both back. … Don’t worry. …” “I am not worried, Harry,” said Dumbledore, his voice a little stronger despite","index":866929},{"text":"toward them on high-heeled, fluffy slippers, wearing a silk dressing gown embroidered with dragons. “I saw you <strong>Apparate</strong> as I was pulling my bedroom curtains! Thank goodness, thank goodness, I couldn’t think what to — but what’s","index":869510},{"text":"cabinet was traveling between them, but he couldn’t make anyone hear him. … In the end, he managed to <strong>Apparate</strong> out, even though he’d never passed his test. He nearly died doing it. Everyone thought it was a","index":879104},{"text":"just make out three figures racing across the lawn, heading for the gates beyond which they could Dis<strong>apparate</strong> — by the looks of them, the huge blond Death Eater and, some way ahead of him, Snape and","index":899386},{"text":"him. Snape and Malfoy, however, were still running; they would soon be beyond the gates, able to Dis<strong>apparate</strong> — Harry tore past Hagrid and his opponent, took aim at Snape’s back, and yelled, “Stupefy!” He missed; the","index":900997},{"text":"located his wand, he turned only to see the hippogriff circling the gates. Snape had managed to Dis<strong>apparate</strong> just beyond the school’s boundaries. “Hagrid,” muttered Harry, still dazed, looking around. “HAGRID?” He stumbled toward the burning","index":905843},{"text":"walked back into his empty canvas. “Minerva, the Minister will be here within seconds, he has just Dis<strong>apparate</strong>d from the Ministry.” “Thank you, Everard,” said Professor McGonagall, and she turned quickly to her teachers. “I","index":938508}],"Avada Kedavra":[{"text":"far as I am aware, they do not know to this day how the Riddles died, for the <strong>Avada Kedavra</strong> curse does not usually leave any sign of damage. … The exception sits before me,” Dumbledore added, with","index":545447},{"text":"the harsh lines of his face. “Severus … please …” Snape raised his wand and pointed it directly at Dumbledore. “<strong>Avada Kedavra</strong>!” A jet of green light shot from the end of Snape’s wand and hit Dumbledore squarely in","index":892403},{"text":"and Ron groaned. Luna’s mouth trembled. “— more Death Eaters arrived — and then Snape — and Snape did it. The <strong>Avada Kedavra</strong>.” Harry couldn’t go on. Madam Pomfrey burst into tears. Nobody paid her any attention except Ginny, who","index":918238}],"Avis":[{"text":"night. The Weasleys and their guests were sitting in the living room, which Ginny had decorated so l<strong>avis</strong>hly that it was rather like sitting in a paper-chain explosion. Fred, George, Harry, and Ron were the","index":490781}],"Bat-Bogey Hex":[{"text":"Slughorn’s great belly. “You want to be careful, Blaise! I saw this young lady perform the most marvelous <strong>Bat-Bogey Hex</strong> as I was passing her carriage! I wouldn’t cross her!” Zabini merely looked contemptuous. “Anyway,” said","index":213710},{"text":"who had seen Ginny glowering in Ron’s direction and, remembering her reputation as an accomplished caster of the <strong>Bat-Bogey Hex</strong>, soared over to intervene before things got out of hand. “Peakes, go and pack up the","index":431577}],"Crucio":[{"text":"who was throwing hex after hex at her while she dodged them: Amycus was giggling, enjoying the sport: “<strong>Crucio</strong> — <strong>Crucio</strong> — you can’t dance forever, pretty —” “Impedimenta!” yelled Harry. His jinx hit Amycus in the chest: He gave","index":895398}],"Diffindo":[{"text":"old copy of Advanced Potion-Making out of his bag and tapped the cover with his wand, muttering, “<strong>Diffindo</strong>!” The cover fell off. He did the same thing with the brand-new book (Hermione looked scandalized). He","index":325948}],"(Disillusionment Charm)":[{"text":"around your house, making sure that all family members are aware of emergency measures such as Shield and <strong>Disillusionment Charm</strong>s, and, in the case of underage family members, Side-Along-Apparition. 4.\tAgree on security questions with","index":62302}],"Ennervate":[{"text":"said Harry, shaking Dumbledore, “no, you’re not dead, you said it wasn’t poison, wake up, wake up — R<strong>ennervate</strong>!” he cried, his wand pointing at Dumbledore’s chest; there was a flash of red light but nothing happened.","index":859888},{"text":"cried, his wand pointing at Dumbledore’s chest; there was a flash of red light but nothing happened. “R<strong>ennervate</strong> — sir — please —” Dumbledore’s eyelids flickered; Harry’s heart leapt. “Sir, are you — ?” “Water,” croaked Dumbledore. “Water,” panted Harry. “Yes","index":860006}],"Episkey":[{"text":"Healing Spells, but it seemed rude to say this, so he stayed stock-still and closed his eyes. “<strong>Episkey</strong>,” said Tonks. Harry’s nose felt very hot, and then very cold. He raised a hand and felt it","index":230338},{"text":"can fix that,” said Harry, landing beside the two girls, pointing his wand at Demelza’s mouth, and saying “<strong>Episkey</strong>.” “And Ginny, don’t call Ron a prat, you’re not the Captain of this team —” “Well, you seemed too","index":423640}],"Expelliarmus":[{"text":"drawing his wand as he did so. The door burst open and somebody erupted through it and shouted, “<strong>Expelliarmus</strong>!” Harry’s body became instantly rigid and immobile, and he felt himself fall back against the tower wall, propped","index":874343},{"text":"propped like an unsteady statue, unable to move or speak. He could not understand how it had happened — <strong>Expelliarmus</strong> was not a Freezing Charm — Then, by the light of the Mark, he saw Dumbledore’s wand flying in","index":874566}],"Impedimenta":[{"text":"swiped his wand through the air; six or seven of them crumpled, but more were coming toward him. “<strong>Impedimenta</strong>! Incarcerous!” A few of them stumbled, one or two of them bound in ropes, but those climbing onto","index":862604},{"text":"her while she dodged them: Amycus was giggling, enjoying the sport: “Crucio — Crucio — you can’t dance forever, pretty —” “<strong>Impedimenta</strong>!” yelled Harry. His jinx hit Amycus in the chest: He gave a piglike squeal of pain, was lifted","index":895452},{"text":"wand ready, that the brother and sister he had overtaken using his shortcut were closing in behind him. … “<strong>Impedimenta</strong>!” he yelled as he rolled over again, crouching close to the dark ground, and miraculously his jinx hit","index":900359}],"Imperio":[{"text":"standing on top of it. Inside it was a magnificent snowy owl. Her amber eyes surveyed the room <strong>imperio</strong>usly, her head swiveling occasionally to gaze at her snoring master. Once or twice she clicked her beak impatiently,","index":61189},{"text":"house-elf Harry had ever seen laced her fleshy feet into tight satin slippers. “Hurry up, Hokey!” said Hepzibah <strong>imperio</strong>usly. “He said he’d come at four, it’s only a couple of minutes to and he’s never been late","index":647112}],"Incarcerous":[{"text":"his wand through the air; six or seven of them crumpled, but more were coming toward him. “Impedimenta! <strong>Incarcerous</strong>!” A few of them stumbled, one or two of them bound in ropes, but those climbing onto the","index":862617}],"Incendio":[{"text":"complete it; Harry rolled over and scrambled back up again as the huge Death Eater behind him yelled, “<strong>Incendio</strong>!” Harry heard an explosive bang and a dancing orange light spilled over all of them: Hagrid’s house was","index":901488},{"text":"to be having a word with them about who they let buy their products.” “We tried everything, Lumos, <strong>Incendio</strong>,” said Ginny. “Nothing would penetrate the darkness; all we could do was grope our way out of the","index":923762}],"Langlock":[{"text":"up his nosey, draw his cork and pull his earsies —” Harry aimed his wand at Peeves and said, “<strong>Langlock</strong>!” Peeves clutched at his throat, gulped, then swooped from the room making obscene gestures but unable to speak,","index":627316}],"Legilimens":[{"text":"mistaken? Or that I have somehow hoodwinked him? Fooled the Dark Lord, the greatest wizard, the most accomplished <strong>Legilimens</strong> the world has ever seen?” Bellatrix said nothing, but looked, for the first time, a little discomfited. Snape","index":40312}],"Levicorpus":[{"text":"There were many crossings-out and alterations, but finally, crammed into a corner of the page, the scribble: <strong>Levicorpus</strong> (nvbl) While the wind and sleet pounded relentlessly on the windows, and Neville snored loudly, Harry stared at","index":353041},{"text":"Snape so far. Pointing his wand at nothing in particular, he gave it an upward flick and said <strong>Levicorpus</strong>! inside his head. “Aaaaaaaargh!” There was a flash of light and the room was full of voices: Everyone","index":353594},{"text":"got his old Potions book. He wrote spells all over it, spells he invented. One of them was <strong>Levicorpus</strong> —” “Oh, that one had a great vogue during my time at Hogwarts,” said Lupin reminiscently. “There were a","index":500551},{"text":"reacted instinctively; his wand was out of his pocket and the incantation sprang to mind without conscious thought: <strong>Levicorpus</strong>! Ron yelled as his heel was wrenched upward once more; he dangled helplessly, upside down, his robes hanging","index":587127},{"text":"hex missed Harry by inches, shattering the lamp on the wall beside him; Harry threw himself sideways, thought <strong>Levicorpus</strong>! and flicked his wand, but Malfoy blocked the jinx and raised his wand for another — “No! No! Stop","index":782056}],"Liberacorpus":[{"text":"it and deciphered one cramped word underneath the spell: Praying that this was the counter-jinx, Harry thought <strong>Liberacorpus</strong>! with all his might. There was another flash of light, and Ron fell in a heap onto his","index":354292}],"Lumos":[{"text":"Harry at his heels, then pushed the front door very slowly, his wand raised and at the ready. “<strong>Lumos</strong>.” Dumbledore’s wand tip ignited, casting its light up a narrow hallway. To the left, another door stood open.","index":93130},{"text":"The lower rocks were slippery with seawater. Harry could feel flecks of cold salt spray hitting his face. “<strong>Lumos</strong>,” said Dumbledore, as he reached the boulder closest to the cliff face. A thousand flecks of golden light","index":832812},{"text":"going to be having a word with them about who they let buy their products.” “We tried everything, <strong>Lumos</strong>, Incendio,” said Ginny. “Nothing would penetrate the darkness; all we could do was grope our way out of","index":923755}],"Muffliato":[{"text":"he had twice used, to general applause, on an unsuspecting Argus Filch); and, perhaps most useful of all, <strong>Muffliato</strong>, a spell that filled the ears of anyone nearby with an unidentifiable buzzing, so that lengthy conversations could","index":352374},{"text":"who maintained a rigidly disapproving expression throughout and refused to talk at all if Harry had used the <strong>Muffliato</strong> spell on anyone in the vicinity. Sitting up in bed, Harry turned the book sideways so as to","index":352718},{"text":"grapefruit. “Okay, Professor, we’re starting now!” said Ron, adding quietly, when she had turned away again, “should’ve used <strong>Muffliato</strong>, Harry.” “No, we shouldn’t!” said Hermione at once, looking, as she always did, intensely cross at the thought","index":414836},{"text":"a yelp. “What’s going — ?” Harry pointed his wand hastily at the door of Madam Pomfrey’s office and muttered, “<strong>Muffliato</strong>!” so that she would not come running. Then he scrambled to the end of his bed for a","index":625749},{"text":"a painful death. “Yeah, I did,” said Harry, glancing toward Madam Pomfrey’s office door to check that the <strong>Muffliato</strong> spell was still working; there was no sign that she had heard any of the commotion. “I’ve","index":628444},{"text":"Harry told Ron and Hermione everything that had happened during next morning’s Charms lesson (having first cast the <strong>Muffliato</strong> spell upon those nearest them). They were both satisfyingly impressed by the way he had wheedled the memory","index":767763}],"Nox":[{"text":"combination of sheer luck and more talented friends. He is mediocre to the last degree, though as ob<strong>nox</strong>ious and self-satisfied as was his father before him. I have done my utmost to have him thrown","index":48185},{"text":"Filch,” said Hagrid shortly. “They’re with me, aren’ they?” “And what difference does that make?” asked Filch ob<strong>nox</strong>iously. “I’m a ruddy teacher, aren’ I, yeh sneakin’ Squib!” said Hagrid, firing up at once. There was","index":605698}],"Oppugno":[{"text":"and erectly toward the door. Harry glanced at Ron, who was looking relieved that nothing worse had happened. “<strong>Oppugno</strong>!” came a shriek from the doorway. Harry spun around to see Hermione pointing her wand at Ron, her","index":449478}],"Petrificus Totalus":[{"text":"hide from Pansy? Was he about to see the mysterious broken object it was so important to mend? “<strong>Petrificus Totalus</strong>!” Without warning, Malfoy pointed his wand at Harry, who was instantly paralyzed. As though in slow motion,","index":225183},{"text":"sunken, sightless eyes were moving toward the rock: an army of the dead rising from the black water. “<strong>Petrificus Totalus</strong>!” yelled Harry, struggling to cling to the smooth, soaked surface of the island as he pointed his","index":862004},{"text":"hands clawing at its slippery surface, their blank, frosted eyes upon him, trailing waterlogged rags, sunken faces leering. “<strong>Petrificus Totalus</strong>!” Harry bellowed again, backing away as he swiped his wand through the air; six or seven of","index":862444},{"text":"aside as the brutal-faced Death Eater, last to leave the tower top, was disappearing through the door. “<strong>Petrificus Totalus</strong>!” The Death Eater buckled as though hit in the back with something solid and fell to the","index":893468},{"text":"face, the stench of sweat and blood filling his nose and mouth, hot greedy breath at his throat — “<strong>Petrificus Totalus</strong>!” Harry felt Fenrir collapse against him; with a stupendous effort he pushed the werewolf off and onto","index":894765}],"Protego":[{"text":"his wand on Harry so fast that Harry reacted instinctively; all thought of nonverbal spells forgotten, he yelled, “<strong>Protego</strong>!” His Shield Charm was so strong Snape was knocked off-balance and hit a desk. The whole class","index":265285}],"Reducto":[{"text":"that moment there were renewed sounds of scuffling from below and a voice shouted, “They’ve blocked the stairs — <strong>Reducto</strong>! <strong>REDUCTO</strong>!” Harry’s heart leapt: So these four had not eliminated all opposition, but merely broken through the fight","index":890578}],"Relashio":[{"text":"daughter’s throat. Both Harry and Ogden yelled “No!” at the same time; Ogden raised his wand and cried, “<strong>Relashio</strong>!” Gaunt was thrown backward, away from his daughter; he tripped over a chair and fell flat on his","index":312139}],"Rennervate":[{"text":"“No,” said Harry, shaking Dumbledore, “no, you’re not dead, you said it wasn’t poison, wake up, wake up — <strong>Rennervate</strong>!” he cried, his wand pointing at Dumbledore’s chest; there was a flash of red light but nothing happened.","index":859887},{"text":"he cried, his wand pointing at Dumbledore’s chest; there was a flash of red light but nothing happened. “<strong>Rennervate</strong> — sir — please —” Dumbledore’s eyelids flickered; Harry’s heart leapt. “Sir, are you — ?” “Water,” croaked Dumbledore. “Water,” panted Harry. “Yes","index":860005}],"Reparo":[{"text":"room, but before she had time to raise her wand, Ogden had lifted his own and said firmly, “<strong>Reparo</strong>.” The pot mended itself instantly. Gaunt looked for a moment as though he was going to shout at","index":304366},{"text":"thing with the brand-new book (Hermione looked scandalized). He then swapped the covers, tapped each, and said, “<strong>Reparo</strong>!” There sat the Prince’s copy, disguised as a new book, and there sat the fresh copy from Flourish","index":326108},{"text":"wouldn’t,” said Ron, in a very quiet voice. Harry missed the pod, hit the bowl, and shattered it. “<strong>Reparo</strong>,” he said hastily, poking the pieces with his wand, and the bowl sprang back together again. The crash,","index":418332},{"text":"Hermione kindly, hurrying forward to help her. “Here …” She tapped the broken scales with her wand and said, “<strong>Reparo</strong>.” The girl did not say thank you, but remained rooted to the spot as they passed and watched","index":631485}],"Revelio":[{"text":"as she pulled his copy of Advanced Potion-Making out of his bag and raised her wand. “Specialis <strong>Revelio</strong>!” she said, rapping it smartly on the front cover. Nothing whatsoever happened. The book simply lay there, looking","index":285283},{"text":"nonverbal incantations that she did not need to say the words aloud. Ernie Macmillan, however, was muttering, “Specialis <strong>Revelio</strong>!” over his cauldron, which sounded impressive, so Harry and Ron hastened to imitate him. It took Harry only","index":561196}],"Sectumsempra":[{"text":"to Snape in our first year,” said Hermione dismissively. Harry ignored her. He had just found an incantation (“<strong>Sectumsempra</strong>!”) scrawled in a margin above the intriguing words “For Enemies,” and was itching to try it out, but","index":668967},{"text":"fierce pride, and so did my parents — that there was all the difference in the world. \fChapter 24 <strong>Sectumsempra</strong> Exhausted but delighted with his night’s work, Harry told Ron and Hermione everything that had happened during next","index":767587},{"text":"away again when he noticed the corner of a page folded down; turning to it, he saw the <strong>Sectumsempra</strong> spell, captioned “For Enemies,” that he had marked a few weeks previously. He had still not found out","index":774830},{"text":"Moaning Myrtle, who screamed loudly; water poured everywhere and Harry slipped as Malfoy, his face contorted, cried, “Cruci —” “<strong>SECTUMSEMPRA</strong>!” bellowed Harry from the floor, waving his wand wildly. Blood spurted from Malfoy’s face and chest as though","index":782558},{"text":"“Well, of course I’m glad Harry wasn’t cursed!” said Hermione, clearly stung. “But you can’t call that <strong>Sectumsempra</strong> spell good, Ginny, look where it’s landed him! And I’d have thought, seeing what this has done","index":795102},{"text":"merely stepped over or on the fallen bodies. Still slashing at the air with his wand, Harry yelled, “<strong>Sectumsempra</strong>! <strong>SECTUMSEMPRA</strong>!” But though gashes appeared in their sodden rags and their icy skin, they had no blood to","index":862836},{"text":"was dabbing at his wounds with some harsh-smelling green ointment. Harry remembered how Snape had mended Malfoy’s <strong>Sectumsempra</strong> wounds so easily with his wand. “Can’t you fix them with a charm or something?” he asked the","index":916238},{"text":"known where you were getting it all from.” “He knew,” said Harry bitterly. “He knew when I used <strong>Sectumsempra</strong>. He didn’t really need Legilimency. … He might even have known before then, with Slughorn talking about how brilliant","index":953220}],"Specialis Revelio":[{"text":"indignantly, as she pulled his copy of Advanced Potion-Making out of his bag and raised her wand. “<strong>Specialis Revelio</strong>!” she said, rapping it smartly on the front cover. Nothing whatsoever happened. The book simply lay there,","index":285273},{"text":"at nonverbal incantations that she did not need to say the words aloud. Ernie Macmillan, however, was muttering, “<strong>Specialis Revelio</strong>!” over his cauldron, which sounded impressive, so Harry and Ron hastened to imitate him. It took Harry","index":561186}],"Stupefy":[{"text":"gates, able to Disapparate — Harry tore past Hagrid and his opponent, took aim at Snape’s back, and yelled, “<strong>Stupefy</strong>!” He missed; the jet of red light soared past Snape’s head; Snape shouted, “Run, Draco!” and turned. Twenty","index":901088}],"Tergeo":[{"text":"squinting at his distorted reflection. “You’re covered in blood!” said Hermione. “Come here —” She raised her wand, said “<strong>Tergeo</strong>!” and siphoned off the dried blood. “Thanks,” said Harry, feeling his now clean face. “How’s my nose looking?”","index":238457}],"(Unbreakable Vow)":[{"text":"to it. “If you are there to protect him … Severus, will you swear it? Will you make the <strong>Unbreakable Vow</strong>?” “The <strong>Unbreakable Vow</strong>?” Snape’s expression was blank, unreadable. Bellatrix, however, let out a cackle of triumphant laughter.","index":55061},{"text":"Narcissa’s tear-filled blue ones as she continued to clutch his hand. “Certainly, Narcissa, I shall make the <strong>Unbreakable Vow</strong>,” he said quietly. “Perhaps your sister will consent to be our Bonder.” Bellatrix’s mouth fell open. Snape","index":55541},{"text":"the door and disappeared through it. Harry thought he heard a sob before it slammed. \fChapter 15 The <strong>Unbreakable Vow</strong> Snow was swirling against the icy windows once more; Christmas was approaching fast. Hagrid had already single-handedly","index":450011},{"text":"“I am trying to help you. I swore to your mother I would protect you. I made the <strong>Unbreakable Vow</strong>, Draco —” “Looks like you’ll have to break it, then, because I don’t need your protection! It’s my","index":481812},{"text":"“He said he’d promised Malfoy’s mother to protect him, that he’d made an Unbreakable Oath or something —” “An <strong>Unbreakable Vow</strong>?” said Ron, looking stunned. “Nah, he can’t have. … Are you sure?” “Yes, I’m sure,” said Harry.","index":484597},{"text":"you sure?” “Yes, I’m sure,” said Harry. “Why, what does it mean?” “Well, you can’t break an <strong>Unbreakable Vow</strong>. …” “I’d worked that much out for myself, funnily enough. What happens if you break it, then?”","index":484761}]},"7":{"Accio":[{"text":"air, hurtling straight toward the ground. “Hagrid!” Harry called, holding on to the bike for dear life. “Hagrid — <strong>Accio</strong> Hagrid!” The motorbike sped up, sucked toward the earth. Face level with the handlebars, Harry could see nothing","index":90785},{"text":"“Well … it was easy,” said Hermione in a small voice. “I just did a Summoning Charm. You know — <strong>Accio</strong>. And — they zoomed out of Dumbledore’s study window right into the girls’ dormitory.” “But when did you do","index":149287},{"text":"beside his camp bed, pointed it at the cluttered desk where he had left his glasses, and said, “<strong>Accio</strong> Glasses!” Although they were only around a foot away, there was something immensely satisfying about seeing them zoom","index":164816},{"text":"way,” said Hermione, as Harry wiped his inky fingers on his jeans. She raised her wand and said, “<strong>Accio</strong> Locket!” Nothing happened. Ron, who had been searching the folds of the faded curtains, looked disappointed. “Is that","index":278793},{"text":"placed it in his pocket. Then he turned to face the room again, raised his wand, and murmured, “<strong>Accio</strong> Locket.” Nothing happened, but he had not expected it to; no doubt Umbridge knew all about protective charms","index":373482},{"text":"“Quickly!” He grabbed his wand from the ground and pointed it into the depths of the magical bag. “<strong>Accio</strong> Dittany!” A small brown bottle zoomed out of the bag; he caught it and hastened back to Hermione","index":401986},{"text":"ought to be a few salmon in here, or d’you reckon it’s too early in the season? <strong>Accio</strong> Salmon!” There were several distinct splashes and then the slapping sounds of fish against flesh. Somebody grunted appreciatively.","index":439909},{"text":"powerful, muscular — “No!” he gasped, pinned to the floor. “Yes,” whispered the voice. “Yesss … hold you … hold you …” “<strong>Accio</strong> … <strong>Accio</strong> Wand …” But nothing happened and he needed his hands to try to force the snake from him","index":509628},{"text":"reposing upon the bottom of the frozen pool. He pointed the wand at the silvery shape and murmured, “<strong>Accio</strong> Sword.” It did not stir. He had not expected it to. If it had been that easy, the","index":551906},{"text":"Tom Riddle. “And how the hell are we going to get up there without touching anything?” asked Ron. “<strong>Accio</strong> Cup!” cried Hermione, who had evidently forgotten in her desperation what Griphook had told them during their planning","index":807669},{"text":"consequences, then hesitated, looking up and down aisles of junk; he could not remember where to go next. … “<strong>Accio</strong> Diadem!” cried Hermione in desperation, but nothing flew through the air toward them. It seemed that, like the","index":928611}],"Aguamenti":[{"text":"dropped his wand: It hit Mundungus on the nose and shot red sparks into his eyebrows, which ignited. “<strong>Aguamenti</strong>!” screamed Hermione, and a jet of water streamed from her wand, engulfing a spluttering and choking Mundungus. Harry","index":329685},{"text":"pursuing them, licking up the sides of the junk bulwarks, which were crumbling to soot at their touch. “<strong>Aguamenti</strong>!” Harry bawled, but the jet of water that soared from the tip of his wand evaporated in the","index":935215}],"Alohomora":[{"text":"said Harry. He pushed the door: It was locked. Hermione pointed her wand at the handle and said, “<strong>Alohomora</strong>.” There was a click, and the door swung open. They moved over the threshold together, gazing around. Regulus’s","index":276624}],"Apparate":[{"text":"some portion of approval. “We now have several people planted within the Department of Magical Transport. If Potter <strong>Apparate</strong>s or uses the Floo Network, we shall know immediately.” “He will not do either,” said Snape. “The Order","index":8101},{"text":"made it an imprisonable offense to connect this house to the Floo Network, place a Portkey here, or <strong>Apparate</strong> in or out. All done in the name of your protection, to prevent You-Know-Who getting in","index":66930},{"text":"walked away into the darkness toward the gate. Harry thought he heard the faintest pop as Kingsley Dis<strong>apparate</strong>d just beyond the Burrow’s boundaries. Mr. and Mrs. Weasley came racing down the back steps, Ginny behind them.","index":112519},{"text":"for them. Dung panicked, I heard him cry out, Mad-Eye tried to stop him, but he Dis<strong>apparate</strong>d. Voldemort’s curse hit Mad-Eye full in the face, he fell backward off his broom and — there was","index":113723},{"text":"next booth. Hermione dropped her voice to a whisper. “I say we find a quiet place to Dis<strong>apparate</strong> and head for the countryside. Once we’re there, we could send a message to the Order.” “Can you","index":243389},{"text":"to come back,” he repeated. “I know, but —” “Well, it’s obvious, isn’t it, Harry?” said Ron. “He Dis<strong>apparate</strong>d!” “But … you couldn’t <strong>Apparate</strong> in and out of that cave,” said Harry, “otherwise Dumbledore —” “Elf magic isn’t like","index":289175},{"text":"said Harry, “otherwise Dumbledore —” “Elf magic isn’t like wizard’s magic, is it?” said Ron. “I mean, they can <strong>Apparate</strong> and Dis<strong>apparate</strong> in and out of Hogwarts when we can’t.” There was silence as Harry digested this. How","index":289353},{"text":"being watched. There are a couple of Death Eaters in the square outside —” “We know —” “I had to <strong>Apparate</strong> very precisely onto the top step outside the front door to be sure that they would not see","index":302696},{"text":"finished, Lupin looked aghast. “But how did they find you so quickly? It’s impossible to track anyone who <strong>Apparate</strong>s, unless you grab hold of them as they disappear!” “And it doesn’t seem likely they were just strolling","index":303818},{"text":"Kingsley saved us,” said Lupin. “Thanks to his warning most of the wedding guests were able to Dis<strong>apparate</strong> before they arrived.” “Were they Death Eaters or Ministry people?” interjected Hermione. “A mixture; but to all intents","index":304677},{"text":"said all along I didn’t wanna do it —” “For your information, none of the rest of us Dis<strong>apparate</strong>d,” said Hermione. “Well, you’re a bunch of bleedin’ ’eroes then, aren’t you, but I never pretended I was","index":326790},{"text":"Meanwhile, inside number twelve, Harry had just entered the hall. He had nearly lost his balance as he <strong>Apparate</strong>d onto the top step just outside the front door, and thought that the Death Eaters might have caught","index":332059},{"text":"brushing his hair out of his eyes. “Well, if all three of us go we’ll have to Dis<strong>apparate</strong> separately,” Ron was saying. “We can’t all fit under the Cloak anymore.” Harry’s scar was becoming more and","index":343859},{"text":"see a couple of puffy-eyed Death Eaters watching the house from across the misty square. Hermione Dis<strong>apparate</strong>d with Ron first, then came back for Harry. After the usual brief spell of darkness and near suffocation,","index":350832},{"text":"than a minute later, there was a tiny pop and a little Ministry witch with flyaway gray hair <strong>Apparate</strong>d feet from them, blinking a little in the sudden brightness; the sun had just come out from behind","index":352118},{"text":"I don’t think we’re going to be able to go back there.” “What d’you — ?” “As we Dis<strong>apparate</strong>d, Yaxley caught hold of me and I couldn’t get rid of him, he was too strong, and he","index":403269},{"text":"at the apparently deserted glade. He could not help remembering what had happened the last time they had <strong>Apparate</strong>d to the first place Hermione had thought of — how Death Eaters had found them within minutes. Had it","index":405419},{"text":"all the marks and impressions on the ground that might show they had camped there. Then they Dis<strong>apparate</strong>d to the outskirts of a small market town. Once they had pitched the tent in the shelter of","index":424318},{"text":"After a few minutes she returned, her sopping hair plastered to her face. “He’s g-g-gone! Dis<strong>apparate</strong>d!” She threw herself into a chair, curled up, and started to cry. Harry felt dazed. He stooped, picked","index":463300},{"text":"times, Hermione seemed unable to find any more reasons to delay: She and Harry grasped hands and Dis<strong>apparate</strong>d, reappearing on a windswept heather-covered hillside. The instant they arrived, Hermione dropped Harry’s hand and walked away","index":465633},{"text":"and Disapparating while underneath the Invisibility Cloak together — that Hermione agreed to make the journey. They were to <strong>Apparate</strong> to the village under cover of darkness, so it was late afternoon when they finally swallowed Polyjuice Potion,","index":481318},{"text":"nervous. “The snow in the dark, it plays tricks on your eyes. … But perhaps we ought to Dis<strong>apparate</strong> under the Invisibility Cloak, just in case?” Half an hour later, with the tent packed, Harry wearing the","index":544688},{"text":"hour later, with the tent packed, Harry wearing the Horcrux, and Hermione clutching the beaded bag, they Dis<strong>apparate</strong>d. The usual tightness engulfed them; Harry’s feet parted company with the snowy ground, then slammed hard onto what","index":544858},{"text":"her temporarily speechless, and Ron seized his opportunity. “I wanted to come back the minute I’d Dis<strong>apparate</strong>d, but I walked straight into a gang of Snatchers, Hermione, and I couldn’t go anywhere!” “A gang of","index":572838},{"text":"hit the one holding me in the stomach, grabbed his wand, Disarmed the bloke holding mine, and Dis<strong>apparate</strong>d. I didn’t do it so well, Splinched myself again” — Ron held up his right hand to show two","index":574199},{"text":"was supposed to do, I knew it would take me where I needed to go. So I Dis<strong>apparate</strong>d and came out on the side of a hill. There was snow everywhere. …” “We were there,” said Harry.","index":577679},{"text":"so I clicked the Deluminator again, the blue light came out and went inside me, and I Dis<strong>apparate</strong>d and arrived here in these woods. I still couldn’t see you, so I just had to hope one","index":578663},{"text":"an excellent view of the village of Ottery St. Catchpole from the breezy hillside to which they Dis<strong>apparate</strong>d next morning. From their high vantage point the village looked like a collection of toy houses in the","index":593599},{"text":"there if you looked through the Lovegoods’ window. Let’s try the next lot of hills.” So they Dis<strong>apparate</strong>d a few miles farther north. “Aha!” shouted Ron, as the wind whipped their hair and clothes. Ron was","index":595616},{"text":"hair; Harry could feel his long yellow nails scratching his scalp. “On three! One — two — three —” They Dis<strong>apparate</strong>d, pulling the prisoners with them. Harry struggled, trying to throw off Greyback’s hand, but it was hopeless: Ron","index":680297},{"text":"cellar floor, looking groggy and disoriented, many welts across his swarthy face. Ron was now trying to Dis<strong>apparate</strong> without a wand. “There’s no way out, Ron,” said Luna, watching his fruitless efforts. “The cellar is completely","index":697051},{"text":"of light flew back into the air from his pocket, revealing Dobby the house-elf, who had just <strong>Apparate</strong>d into their midst. “DOB — !” Harry hit Ron on the arm to stop him shouting, and Ron looked terrified","index":699946},{"text":"awful scream drowned Harry’s words: Hermione was being tortured again. He cut to the essentials. “You can Dis<strong>apparate</strong> out of this cellar?” he asked Dobby, who nodded, his ears flapping. “And you can take humans with","index":700571},{"text":"sky from far away, over a dark and stormy sea, and soon he would be close enough to <strong>Apparate</strong> to them, and Harry could see no way out. “Now,” said Bellatrix softly, as Draco hurried back to","index":708398},{"text":"clung to the sword, over one shoulder, Harry seized Dobby’s hand and spun on the spot to Dis<strong>apparate</strong>. As he turned into darkness he caught one last view of the drawing room: of the pale, frozen","index":710793},{"text":"just beyond the boundary wall, where the Fidelius Charm stopped working and they would be able to Dis<strong>apparate</strong>. Once past the gate, Griphook spoke. “I should climb up now, Harry Potter, I think?” Harry bent down","index":783862}],"Avada Kedavra":[{"text":"into her hair. Snape looked back at her, quite impassive, as she turned slowly away from him again. “<strong>Avada Kedavra</strong>.” The flash of green light illuminated every corner of the room. Charity fell, with a resounding crash,","index":17735},{"text":"and if I Stunned him and he’d fallen, he’d have died the same as if I’d used <strong>Avada Kedavra</strong>! Expelliarmus saved me from Voldemort two years ago,” Harry added defiantly. Lupin was reminding him of the","index":102723},{"text":"hold him off!” Hold him off, without a wand in his hand! … He laughed before casting the curse. … “<strong>Avada Kedavra</strong>!” The green light filled the cramped hallway, it lit the pram pushed against the wall, it made","index":514982},{"text":"not like it crying, he had never been able to stomach the small ones whining in the orphanage — “<strong>Avada Kedavra</strong>!” And then he broke: He was nothing, nothing but pain and terror, and he must hide himself,","index":517009},{"text":"straight at Crabbe’s head. It only missed because Malfoy pulled him out of the way. “It’s that Mudblood! <strong>Avada Kedavra</strong>!” Harry saw Hermione dive aside, and his fury that Crabbe had aimed to kill wiped all else","index":933597},{"text":"the aisle, shot a full Body-Bind Curse at Crabbe, which narrowly missed. Crabbe wheeled around and screamed, “<strong>Avada Kedavra</strong>!” again. Ron leapt out of sight to avoid the jet of green light. The wandless Malfoy cowered","index":934428},{"text":"heard the high voice shriek as he too yelled his best hope to the heavens, pointing Draco’s wand: “<strong>Avada Kedavra</strong>!” “Expelliarmus!” The bang was like a cannon blast, and the golden flames that erupted between them, at","index":1103161}],"Avis":[{"text":"“She’s not that fond of brooms.” Fleur walked over to stand beside him, giving him a soppy, sl<strong>avis</strong>h look that Harry hoped with all his heart would never appear on his face again. “Miss Granger with","index":76722}],"Bluebell Flames":[{"text":"a little behind him. It was gloriously warm after the pool and the forest, the only illumination the <strong>bluebell flames</strong> still shimmering in a bowl on the floor. Hermione was fast asleep, curled up under her blankets,","index":569497}],"Caterwauling":[{"text":"“Couple more?” repeated Aberforth ominously. “What d’you mean, a couple more, Longbottom? There’s a curfew and a <strong>Caterwauling</strong> Charm on the whole village!” “I know, that’s why they’ll be Apparating directly into the bar,” said Neville.","index":845472}],"Cave Inimicum":[{"text":"hands a tent peg soared, to land with a final thud at the end of a guy rope. “<strong>Cave Inimicum</strong>,” Hermione finished with a skyward flourish. “That’s as much as I can do. At the very least,","index":407375},{"text":"it to Harry. “Hermione, you’re a genius, a total genius, I can’t believe we got out of that!” “<strong>Cave Inimicum</strong> … Didn’t I say it was an Erumpent horn, didn’t I tell him? And now his house has","index":634932}],"Confringo":[{"text":"Death Eaters, Harry spat blood out of his mouth, pointed his wand at the falling sidecar, and yelled, “<strong>Confringo</strong>!” He knew a dreadful, gut-wrenching pang for Hedwig as it exploded; the Death Eater nearest it was","index":86433},{"text":"The snake lunged as he took a running leap, dragging Hermione with him; as it struck, Hermione screamed, “<strong>Confringo</strong>!” and her spell flew around the room, exploding the wardrobe mirror and ricocheting back at them, bouncing from","index":511659}],"Confundus":[{"text":"told me that there are plans to lay a false trail; this must be it. No doubt a <strong>Confundus</strong> Charm has been placed upon Dawlish. It would not be the first time; he is known to be","index":5117}],"Crucio":[{"text":"what, knowing in his heart that it was useless. “What else did you take, what else? ANSWER ME! <strong>CRUCIO</strong>!” Hermione’s screams echoed off the walls upstairs, Ron was half sobbing as he pounded the walls with his","index":697581},{"text":"off himself, raised his wand, and said, “You shouldn’t have done that.” As Amycus spun around, Harry shouted, “<strong>Crucio</strong>!” The Death Eater was lifted off his feet. He writhed through the air like a drowning man, thrashing","index":876787},{"text":"from the other side of the junk wall. “What’s going on?” “Harry?” mimicked Crabbe. “What’s going — no, Potter! <strong>Crucio</strong>!” Harry had lunged for the tiara; Crabbe’s curse missed him but hit the stone bust, which flew into","index":932865},{"text":"the tumult. “Harry Potter is dead by my hand, and no man alive can threaten me now! Watch! <strong>Crucio</strong>!” Harry had been expecting it, knew his body would not be allowed to remain unsullied upon the forest","index":1075739}],"(Cushioning Charm)":[{"text":"felt himself glide back toward the ground as though weightless, landing painlessly on the rocky passage floor. “C-<strong>Cushioning Charm</strong>,” Hermione spluttered, as Ron pulled her to her feet, but to Harry’s horror he saw that she","index":800389}],"Defodio":[{"text":"only cling to its back, expecting to be shaken off at any moment; then he heard Hermione yelling, “<strong>Defodio</strong>!” She was helping the dragon enlarge the passageway, carving out the ceiling as it struggled upward toward the","index":813869}],"Deprimo":[{"text":"the sideboard. “Obliviate!” cried Hermione, pointing her wand first into his face, then at the floor beneath them. “<strong>Deprimo</strong>!” She had blasted a hole in the sitting room floor. They fell like boulders, Harry still holding onto","index":634024}],"Descendo":[{"text":"to the door. “C’mon.” “Why?” Harry asked, following Ron out of the room onto the tiny landing. “<strong>Descendo</strong>,” muttered Ron, pointing his wand at the low ceiling. A hatch opened right over their heads and a","index":142551},{"text":"fifty-foot mountain of old furniture, of broken trunks, of old books and robes and unidentifiable junk, and shouted, “<strong>Descendo</strong>!” The wall began to totter, then the top third crumbled into the aisle next door where Ron stood.","index":931813}],"Diffindo":[{"text":"from underneath the bench, shaking bits of glass ashtray out of her hair and trembling all over. “D-<strong>diffindo</strong>,” she said, pointing her wand at Ron, who roared in pain as she slashed open the knee of","index":245710},{"text":"the knee of his jeans, leaving a deep cut. “Oh, I’m so sorry, Ron, my hand’s shaking! <strong>Diffindo</strong>!” The severed ropes fell away. Ron got to his feet, shaking his arms to regain feeling in them.","index":245882},{"text":"I?” muttered Harry, tugging at the chains binding her arms. “Well, I’ve had a change of heart. <strong>Diffindo</strong>!” Nothing happened. “Hermione, how do I get rid of these chains?” “Wait, I’m trying something up here","index":392212},{"text":"mirror, and the old Snitch on top of his clothes, then he pointed Hermione’s wand at the ice. “<strong>Diffindo</strong>.” It cracked with a sound like a bullet in the silence: The surface of the pool broke and","index":553946}],"(Disillusionment Charm)":[{"text":"be rippling, the air itself quivering. Then, one by one, figures began to pop into sight as their <strong>Disillusionment Charm</strong>s lifted. Dominating the scene was Hagrid, wearing a helmet and goggles and sitting astride an enormous motorbike","index":64152},{"text":"charm over us, right?” he whispered to Hermione. “I did everything,” she whispered back, “Muffliato, Muggle-Repelling and <strong>Disillusionment Charm</strong>s, all of it. They shouldn’t be able to hear or see us, whoever they are.” Heavy scuffing","index":438646},{"text":"much as his. “We’ll need to practice Disapparating together under the Invisibility Cloak for a start, and perhaps <strong>Disillusionment Charm</strong>s would be sensible too, unless you think we should go the whole hog and use Polyjuice Potion?","index":479397},{"text":"Cloak of Invisibility, Miss Granger! I mean to say, it is not a traveling cloak imbued with a <strong>Disillusionment Charm</strong>, or carrying a Bedazzling Hex, or else woven from Demiguise hair, which will hide one initially but","index":615628},{"text":"the Cloak, Hermione! Why else would he want it? He didn’t need a Cloak, he could perform a <strong>Disillusionment Charm</strong> so powerful that he made himself completely invisible without one!” Something fell to the floor and rolled,","index":644867},{"text":"the castle windows, and he could conceal himself … and in a second he had cast upon himself a <strong>Disillusionment Charm</strong> that hid him even from his own eyes. And he walked on, around the edge of the","index":749781}],"Duro":[{"text":"They shot through the concealing tapestry at the bottom and spun onto the floor, hitting the opposite wall. “<strong>Duro</strong>!” cried Hermione, pointing her wand at the tapestry, and there were two loud, sickening crunches as the tapestry","index":953066}],"Engorgio":[{"text":"him the previous night, which Hermione had since condescended to examine, and had decided was made of blackthorn. “<strong>Engorgio</strong>.” The spider gave a little shiver, bouncing slightly in the web. Harry tried again. This time the spider","index":586595}],"Erecto":[{"text":"now performing complicated figure-of-eight movements with her wand, “so Ron’s dad said I could borrow it. <strong>Erecto</strong>!” she added, pointing her wand at the misshapen canvas, which in one fluid motion rose into the air","index":407106}],"Expecto Patronum":[{"text":"a terrible scream of fear as a slimy, scabbed hand grasped her chin and forced her face back. “<strong>EXPECTO PATRONUM</strong>!” The silver stag soared from the tip of Harry’s wand and leaped toward the dementors, which fell","index":391536},{"text":"and walked, still gleaming brightly, toward the door. “As many as we can muster; do yours, Hermione.” “Expec — <strong>Expecto patronum</strong>,” said Hermione. Nothing happened. “It’s the only spell she ever has trouble with,” Harry told a completely","index":393264},{"text":"she ever has trouble with,” Harry told a completely bemused Mrs. Cattermole. “Bit unfortunate, really … Come on, Hermione. …” “<strong>Expecto patronum</strong>!” A silver otter burst from the end of Hermione’s wand and swam gracefully through the air to","index":393464},{"text":"Severus,” said Dumbledore seriously. “Have you grown to care for the boy, after all?” “For him?” shouted Snape. “<strong>Expecto Patronum</strong>!” From the tip of his wand burst the silver doe: She landed on the office floor, bounded","index":1018750}],"Expelliarmus":[{"text":"the red light of his next Stunning Spell, Harry saw the strangely blank face of Stanley Shunpike — Stan — “<strong>Expelliarmus</strong>!” Harry yelled. “That’s him, it’s him, it’s the real one!” The hooded Death Eater’s shout reached Harry even","index":87376},{"text":"I Stunned him and he’d fallen, he’d have died the same as if I’d used Avada Kedavra! <strong>Expelliarmus</strong> saved me from Voldemort two years ago,” Harry added defiantly. Lupin was reminding him of the sneering Hufflepuff","index":102738},{"text":"course not,” said Lupin, “but the Death Eaters — frankly, most people! — would have expected you to attack back! <strong>Expelliarmus</strong> is a useful spell, Harry, but the Death Eaters seem to think it is your signature move, and","index":103465},{"text":"Mundungus Fletcher, Master.” Mundungus scrambled up and pulled out his wand; Hermione, however, was too quick for him. “<strong>Expelliarmus</strong>!” Mundungus’s wand soared into the air, and Hermione caught it. Wild-eyed, Mundungus dived for the stairs: Ron","index":325332},{"text":"itself. Harry held it up. “Lumos!” The wand sparked feebly, then went out. Harry pointed it at Hermione. “<strong>Expelliarmus</strong>!” Hermione’s wand gave a little jerk, but did not leave her hand. The feeble attempt at magic was","index":522244},{"text":"had burst into the drawing room; Bellatrix looked around, shocked; she turned her wand to face Ron instead — “<strong>Expelliarmus</strong>!” he roared, pointing Wormtail’s wand at Bellatrix, and hers flew into the air and was caught by Harry,","index":707033},{"text":"at Crabbe and Goyle, who were both aiming at Harry: Their split second’s hesitation was all Harry needed. “<strong>Expelliarmus</strong>!” Goyle’s wand flew out of his hand and disappeared into the bulwark of objects beside him; Goyle leapt","index":934049},{"text":"high voice shriek as he too yelled his best hope to the heavens, pointing Draco’s wand: “Avada Kedavra!” “<strong>Expelliarmus</strong>!” The bang was like a cannon blast, and the golden flames that erupted between them, at the dead","index":1103178}],"Expulso":[{"text":"the spell missed, rebounded on the window, and hit the waitress, who collapsed in front of the door. “<strong>Expulso</strong>!” bellowed the Death Eater, and the table behind which Harry was standing blew up: The force of the","index":245195}],"Fidelius":[{"text":"Secret-Keeper in turn. “And as there are around twenty of us, that greatly dilutes the power of the <strong>Fidelius</strong> Charm. Twenty times as many opportunities for the Death Eaters to get the secret out of somebody. We","index":131335},{"text":"I forced him to let go with a Revulsion Jinx, but I’d already taken him inside the <strong>Fidelius</strong> Charm’s protection. Since Dumbledore died, we’re Secret-Keepers, so I’ve given him the secret, haven’t I?” There","index":403856},{"text":"able to see the cottage at all; he did not know what happened when the subjects of a <strong>Fidelius</strong> Charm died. Then the little lane along which they were walking curved to the left and the heart","index":483323},{"text":"little on the ice. “Harry —” “Look. … Look at it, Hermione. …” “I don’t … oh!” He could see it; the <strong>Fidelius</strong> Charm must have died with James and Lily. The hedge had grown wild in the sixteen years since","index":495755},{"text":"along a new and darker street he moved, and now his destination was in sight at last, the <strong>Fidelius</strong> Charm broken, though they did not know it yet. … And he made less noise than the dead leaves","index":513758},{"text":"saying so for months. We’re the biggest blood-traitor family there is.” “How are they protected?” asked Harry. “<strong>Fidelius</strong> Charm. Dad’s Secret-Keeper. And we’ve done it on this cottage too; I’m Secret-Keeper here. None","index":721428},{"text":"fading stars, then turned and began to walk toward the point, just beyond the boundary wall, where the <strong>Fidelius</strong> Charm stopped working and they would be able to Disapparate. Once past the gate, Griphook spoke. “I should","index":783802}],"Fiendfyre":[{"text":"or the castle, but from the thing that had just fragmented in his fingers. “It must have been <strong>Fiendfyre</strong>!” whimpered Hermione, her eyes on the broken pieces. “Sorry?” “<strong>Fiendfyre</strong> — cursed fire — it’s one of the substances that","index":941316}],"Flagrante":[{"text":"to discern amongst them. “It burned me!” moaned Hermione, sucking her blistered fingers. “They have added Gemino and <strong>Flagrante</strong> Curses!” said Griphook. “Everything you touch will burn and multiply, but the copies are worthless — and if you","index":805966}],"Geminio":[{"text":"“I know that, Harry, but if she wakes up and the locket’s gone — I need to duplicate it — <strong>Geminio</strong>! There … That should fool her. …” Hermione came running downstairs. “Let’s see. … Relashio!” The chains clinked and withdrew into","index":392459}],"Glisseo":[{"text":"open. “POTTER!” Two masked Death Eaters stood there, but even before their wands were fully raised, Hermione shouted, “<strong>Glisseo</strong>!” The stairs beneath their feet flattened into a chute and she, Harry, and Ron hurtled down it, unable","index":952745}],"Homenum Revelio":[{"text":"we go any farther, I think we’d better check,” whispered Hermione, and she raised her wand and said, “<strong>Homenum revelio</strong>.” Nothing happened. “Well, you’ve just had a big shock,” said Ron kindly. “What was that supposed to","index":254299},{"text":"did you? And you think you’ll get your girl back like this?” “I swear … I swear … Potter’s upstairs!” “<strong>Homenum revelio</strong>,” said the voice at the foot of the stairs. Harry heard Hermione gasp, and he had the","index":631896}],"Impedimenta":[{"text":"again: Crouching as low as he could, he pointed at the middle of the oncoming figures and yelled, “<strong>Impedimenta</strong>!” The jinx hit the middle Death Eater in the chest: For a moment the man was absurdly spread-eagled","index":85619}],"Imperio":[{"text":"beneath the cloak, pointed it at the old goblin, and whispered, for the first time in his life, “<strong>Imperio</strong>!” A curious sensation shot down Harry’s arm, a feeling of tingling warmth that seemed to flow from his","index":795093},{"text":"have done, which wandmaker did you use?” Harry acted without thinking: Pointing his wand at Travers, he muttered, “<strong>Imperio</strong>!” once more. “Oh yes, I see,” said Travers, looking down at Bellatrix’s wand, “yes, very handsome. And is","index":795702},{"text":"have the authority. But there will not be room for the wizard.” Harry pointed his wand at Travers. “<strong>Imperio</strong>!” The wizard turned and set off along the dark track at a smart pace. “What are you making","index":798630},{"text":"need him,” said Griphook, “we cannot enter the vault without a Gringotts goblin. And we need the Clankers!” “<strong>Imperio</strong>!” Harry said again; his voice echoed through the stone passage as he felt again the sense of heady","index":801428},{"text":"act, Professor McGonagall rose to her feet, pointed her wand at the groggy Death Eater, and said, “<strong>Imperio</strong>.” Amycus got up, walked over to his sister, picked up her wand, then shuffled obediently to Professor McGonagall","index":878944}],"Impervius":[{"text":"wrong with an Atmospheric Charm, which will be more difficult to fix, so as an interim measure try <strong>Impervius</strong> to protect his belongings —” “Say it again, slowly —” said Ron, searching his pockets desperately for a quill, but","index":363621},{"text":"and yelled as Harry thrust the sword through the handle of Hufflepuff’s cup, hooking it onto the blade. “<strong>Impervius</strong>!” screeched Hermione in an attempt to protect herself, Ron, and the goblins from the burning metal. Then the","index":809547}],"Levicorpus":[{"text":"there, we’ve got to get rid of it —” She raised her wand, pointed it at Harry, and whispered, “<strong>Levicorpus</strong>.” Hoisted into the air by his ankle, Harry hit a suit of armor and replicas burst out of","index":809098}],"Liberacorpus":[{"text":"fingers were left in view. Harry seized Griphook’s fingers and pulled. The blistered goblin emerged by degrees, howling. “<strong>Liberacorpus</strong>!” yelled Harry, and with a crash he and Griphook landed on the surface of the swelling treasure, and","index":810012}],"Lumos":[{"text":"his sleeping bag, picked up his wand, and crept out of the room. On the landing he whispered, “<strong>Lumos</strong>,” and started to climb the stairs by wandlight. On the second landing was the bedroom in which he","index":261861},{"text":"protruding from under the bed before Bathilda closed the door and even that was swallowed by the darkness. “<strong>Lumos</strong>,” said Harry, and his wand ignited. He gave a start: Bathilda had moved close to him in those","index":507054},{"text":"this —” “Please, Hermione, try!” “R-Reparo.” The dangling half of the wand resealed itself. Harry held it up. “<strong>Lumos</strong>!” The wand sparked feebly, then went out. Harry pointed it at Hermione. “Expelliarmus!” Hermione’s wand gave a little","index":522165},{"text":"his vision, brightening when he lowered his eyelids, disorienting him. Now fear came: Her presence had meant safety. “<strong>Lumos</strong>!” he whispered, and the wand-tip ignited. The imprint of the doe faded away with every blink of","index":549845},{"text":"Ron gave a shout of surprise. “Light your wands, can’t you? And hurry, we have very little time!” “<strong>Lumos</strong>!” Harry shone his lit wand around the vault: Its beam fell upon glittering jewels; he saw the fake","index":805228},{"text":"The metal shell broke open. He lowered his shaking hand, raised Draco’s wand beneath the Cloak, and murmured, “<strong>Lumos</strong>.” The black stone with its jagged crack running down the center sat in the two halves of the","index":1033968}],"Meteolojinx Recanto":[{"text":"think they said —” “Yes, a lot of offices have been raining lately,” said Mr. Weasley. “Did you try <strong>Meteolojinx Recanto</strong>? It worked for Bletchley.” “<strong>Meteolojinx Recanto</strong>?” whispered Ron. “No, I didn’t. Thanks, D — I mean, thanks, Arthur.”","index":379472}],"Muffliato":[{"text":"old Snitch and watching its wings flutter feebly. At last, Hermione tapped on the door and tiptoed inside. “<strong>Muffliato</strong>,” she whispered, waving her wand in the direction of the stairs. “Thought you didn’t approve of that spell?”","index":194925},{"text":"no bustling or talk or swift footsteps here; the purple-carpeted corridors were as hushed as though the <strong>Muffliato</strong> charm had been cast over the place. Her office must be up here, Harry thought. It seemed most","index":368759},{"text":"taking a seat behind the latter. He was worried about making Hermione jump. He thought of casting the <strong>Muffliato</strong> charm upon Umbridge and Yaxley, but even murmuring the word might cause Hermione alarm. Then Umbridge raised her","index":387597},{"text":"was as if Hermione had cast a heat haze upon their clearing. “Salvio Hexia … Protego Totalum … Repello Muggletum … <strong>Muffliato</strong> … You could get out the tent, Harry. …” “Tent?” “In the bag!” “In the … of course,” said Harry. He","index":406423},{"text":"them, he heard voices again. He looked around at the Sneakoscope. It was not moving. “You cast the <strong>Muffliato</strong> charm over us, right?” he whispered to Hermione. “I did everything,” she whispered back, “<strong>Muffliato</strong>, Muggle-Repelling and","index":438514}],"Nox":[{"text":"forced the bundle of slippery cloth into his free hand. With difficulty he dragged it over himself, murmured, “<strong>Nox</strong>,” extinguishing his wandlight, and continued on his hands and knees, as silently as possible, all his senses straining,","index":966355}],"Obliviate":[{"text":"know the theory.” She took a deep, calming breath, then pointed her wand at Dolohov’s forehead and said, “<strong>Obliviate</strong>.” At once, Dolohov’s eyes became unfocused and dreamy. “Brilliant!” said Harry, clapping her on the back. “Take care","index":247513},{"text":"She was standing with one foot in midair, with the dumbstruck look of one who had just been <strong>Obliviate</strong>d; her eyes had even drifted out of focus. “… at the time,” she finished in a whisper. “Something wrong?”","index":280316},{"text":"tight,” she whispered. “Hold tight … any second …” Xenophilius’s paper-white face appeared over the top of the sideboard. “<strong>Obliviate</strong>!” cried Hermione, pointing her wand first into his face, then at the floor beneath them. “Deprimo!” She had","index":633924}],"Obscuro":[{"text":"always helps,” said a cold, snide voice, and Phineas Nigellus slid into his portrait. At once, Hermione cried: “<strong>Obscuro</strong>!” A black blindfold appeared over Phineas Nigellus’s clever, dark eyes, causing him to bump into the frame and","index":450559}],"Permanent Sticking":[{"text":"silvery-gray silk was visible. Harry could only assume that Sirius’s parents had been unable to remove the <strong>Permanent Sticking</strong> Charm that kept them on the wall, because he was sure they would not have appreciated their","index":263634}],"Petrificus Totalus":[{"text":"him into the wall and he felt his wand leave his hand as the Cloak slipped off him. “<strong>Petrificus Totalus</strong>!” screamed Hermione from out of sight, and the Death Eater fell forward like a statue to land","index":245406}],"Piertotum Locomotor":[{"text":"McGonagall had taken leave of her senses, but hobbled away, hunch-shouldered, muttering under his breath. “And now — <strong>Piertotum Locomotor</strong>!” cried Professor McGonagall. And all along the corridor the statues and suits of armor jumped down","index":891112}],"Priori Incantatem":[{"text":"beyond repair,” said Harry quietly. “No!” said Hermione, sounding frightened. “He can’t know that, Harry, how could he — ?” “<strong>Priori Incantatem</strong>,” said Harry. “We left your wand and the blackthorn wand at the Malfoys’, Hermione. If they examine","index":743203}],"Protego":[{"text":"in the crowd; then he saw Lupin and Tonks, their wands raised, and heard both of them shout, “<strong>Protego</strong>!”, a cry that was echoed on all sides — “Ron! Ron!” Hermione called, half sobbing as she and Harry","index":237205},{"text":"the surrounding air: It was as if Hermione had cast a heat haze upon their clearing. “Salvio Hexia … <strong>Protego</strong> Totalum … Repello Muggletum … Muffliato … You could get out the tent, Harry. …” “Tent?” “In the bag!” “In the … of","index":406385},{"text":"movement: Harry reacted, but before either wand was clear of its owner’s pocket, Hermione had raised her own. “<strong>Protego</strong>!” she cried, and an invisible shield expanded between her and Harry on the one side and Ron on","index":462205},{"text":"my wand?” She looked as though ready to wrestle it out of Harry’s hands and he reacted instinctively. “<strong>Protego</strong>!” The invisible shield erupted between Ron and Hermione: The force of it knocked her backward onto the floor.","index":570792},{"text":"corner of a field at dusk; Hermione was already running in a circle around them, waving her wand. “<strong>Protego</strong> Totalum … Salvio Hexia …” “That treacherous old bleeder!” Ron panted, emerging from beneath the Invisibility Cloak and throwing it","index":634701},{"text":"think I can hear people coming!” said Hermione, and she pointed Bellatrix’s wand at the waterfall and cried, “<strong>Protego</strong>!” They saw the Shield Charm break the flow of enchanted water as it flew up the passageway. “Good","index":801858},{"text":"sorry to interrupt, but this is important. Have you got any idea where the diadem of Ravenclaw is?” “— <strong>Protego</strong> Horribilis — the diadem of Ravenclaw?” squeaked Flitwick. “A little extra wisdom never goes amiss, Potter, but I hardly","index":888978},{"text":"lieutenant exploded with the force of a bomb. Voldemort raised his wand and directed it at Molly Weasley. “<strong>Protego</strong>!” roared Harry, and the Shield Charm expanded in the middle of the Hall, and Voldemort stared around for","index":1093061}],"Protego Horribilis":[{"text":"sorry to interrupt, but this is important. Have you got any idea where the diadem of Ravenclaw is?” “— <strong>Protego Horribilis</strong> — the diadem of Ravenclaw?” squeaked Flitwick. “A little extra wisdom never goes amiss, Potter, but I hardly","index":888978}],"Protego Totalum":[{"text":"the surrounding air: It was as if Hermione had cast a heat haze upon their clearing. “Salvio Hexia … <strong>Protego Totalum</strong> … Repello Muggletum … Muffliato … You could get out the tent, Harry. …” “Tent?” “In the bag!” “In the … of","index":406385},{"text":"corner of a field at dusk; Hermione was already running in a circle around them, waving her wand. “<strong>Protego Totalum</strong> … Salvio Hexia …” “That treacherous old bleeder!” Ron panted, emerging from beneath the Invisibility Cloak and throwing it","index":634701}],"Reducio":[{"text":"sharply. “I’m sorry I said Dumbledore was young, okay?” Harry had forgotten Ron’s hatred of spiders. “Sorry — <strong>Reducio</strong>.” The spider did not shrink. Harry looked down at the blackthorn wand. Every minor spell he had cast","index":586863}],"Relashio":[{"text":"gone — I need to duplicate it — Geminio! There … That should fool her. …” Hermione came running downstairs. “Let’s see. … <strong>Relashio</strong>!” The chains clinked and withdrew into the arms of the chair. Mrs. Cattermole looked just as frightened as","index":392549},{"text":"pull the crushing metal fingers from around Wormtail’s throat, but it was no use. Pettigrew was turning blue. “<strong>Relashio</strong>!” said Ron, pointing the wand at the silver hand, but nothing happened; Pettigrew dropped to his knees, and","index":704682},{"text":"came to Harry. Pointing his wand at the thick cuffs chaining the beast to the floor, he yelled, “<strong>Relashio</strong>!” The cuffs broke open with loud bangs. “This way!” Harry yelled, and still shooting Stunning Spells at the","index":812419}],"Reparo":[{"text":"Hagrid yelled, and from inside his jacket pocket he pulled his flowery pink umbrella. “Hagrid! No! Let me!” “<strong>REPARO</strong>!” There was a deafening bang and the sidecar broke away from the bike completely: Harry sped forward, propelled","index":84934},{"text":"to Hermione. “Mend it. Please.” “Harry, I don’t think, when it’s broken like this —” “Please, Hermione, try!” “R-<strong>Reparo</strong>.” The dangling half of the wand resealed itself. Harry held it up. “Lumos!” The wand sparked feebly, then","index":522090},{"text":"broken wand upon the headmaster’s desk, touched it with the very tip of the Elder Wand, and said, “<strong>Reparo</strong>.” As his wand resealed, red sparks flew out of its end. Harry knew that he had succeeded. He","index":1111839}],"Repello Muggletum":[{"text":"air: It was as if Hermione had cast a heat haze upon their clearing. “Salvio Hexia … Protego Totalum … <strong>Repello Muggletum</strong> … Muffliato … You could get out the tent, Harry. …” “Tent?” “In the bag!” “In the … of course,” said","index":406403}],"Revelio":[{"text":"go any farther, I think we’d better check,” whispered Hermione, and she raised her wand and said, “Homenum <strong>revelio</strong>.” Nothing happened. “Well, you’ve just had a big shock,” said Ron kindly. “What was that supposed to do?”","index":254307},{"text":"you? And you think you’ll get your girl back like this?” “I swear … I swear … Potter’s upstairs!” “Homenum <strong>revelio</strong>,” said the voice at the foot of the stairs. Harry heard Hermione gasp, and he had the odd","index":631904}],"Salvio Hexia":[{"text":"disturbances in the surrounding air: It was as if Hermione had cast a heat haze upon their clearing. “<strong>Salvio Hexia</strong> … Protego Totalum … Repello Muggletum … Muffliato … You could get out the tent, Harry. …” “Tent?” “In the bag!” “In","index":406370},{"text":"a field at dusk; Hermione was already running in a circle around them, waving her wand. “Protego Totalum … <strong>Salvio Hexia</strong> …” “That treacherous old bleeder!” Ron panted, emerging from beneath the Invisibility Cloak and throwing it to Harry.","index":634719}],"Sectumsempra":[{"text":"voice. “Snape’s work,” said Lupin. “Snape?” shouted Harry. “You didn’t say —” “He lost his hood during the chase. <strong>Sectumsempra</strong> was always a speciality of Snape’s. I wish I could say I’d paid him back in kind,","index":106299},{"text":"George. … A Death Eater moved ahead of Snape and raised his wand, pointing it directly at Lupin’s back — “<strong>Sectumsempra</strong>!” shouted Snape. But the spell, intended for the Death Eater’s wand hand, missed and hit George instead — And","index":1020485}],"(Stinging Jinx)":[{"text":"him?” Lucius asked Greyback. “How did he get into this state?” “That wasn’t us.” “Looks more like a <strong>Stinging Jinx</strong> to me,” said Lucius. His gray eyes raked Harry’s forehead. “There’s something there,” he whispered, “it could","index":686455}],"Stupefy":[{"text":"after them, and Harry had to sink low into the sidecar to avoid them. Wriggling around he cried, “<strong>Stupefy</strong>!” and a red bolt of light shot from his own wand, cleaving a gap between the four pursuing","index":82546},{"text":"Death Eaters’ spells shattered the tiled wall where Ron’s head had just been, as Harry, still invisible, yelled, “<strong>Stupefy</strong>!” The great blond Death Eater was hit in the face by a jet of red light: He slumped","index":244686},{"text":"credentials. He raised his wand, not even troubling to keep it concealed beneath the Invisibility Cloak, and said, “<strong>Stupefy</strong>!” There was a flash of red light; Umbridge crumpled and her forehead hit the edge of the balustrade:","index":390492},{"text":"Harry’s disembodied hand and wand pointing at him. He tried to draw his own wand, but too late: “<strong>Stupefy</strong>!” Yaxley slid to the ground to lie curled on the floor. “Harry!” “Hermione, if you think I was","index":390921},{"text":"roar of anger from his fellows: Scabior drew his wand. “What d’you think you’re playing at, woman?” “<strong>Stupefy</strong>!” she screamed. “<strong>Stupefy</strong>!” They were no match for her, even though there were four of them against one","index":690405},{"text":"was caught by Harry, who had sprinted after Ron. Lucius, Narcissa, Draco, and Greyback wheeled about; Harry yelled, “<strong>Stupefy</strong>!” and Lucius Malfoy collapsed onto the hearth. Jets of light flew from Draco’s, Narcissa’s, and Greyback’s wands; Harry","index":707246},{"text":"an armchair and wrested the three wands from Draco’s grip, pointed all of them at Greyback, and yelled, “<strong>Stupefy</strong>!” The werewolf was lifted off his feet by the triple spell, flew up to the ceiling, and then","index":709485},{"text":"on the hot metal, Harry struggled to his feet and knew that the only way out was through. “<strong>Stupefy</strong>!” he bellowed, and Ron and Hermione joined in: Jets of red light flew into the crowd of goblins,","index":811944}],"Tergeo":[{"text":"clean out the oven earlier. Hastily pulling out his wand, he pointed it at the rag and said, “<strong>Tergeo</strong>.” The wand siphoned off most of the grease. Looking rather pleased with himself, Ron handed the slightly smoking","index":138470},{"text":"saw a few tiny movements from the pictures. As Bathilda fumbled with logs for the fire, he muttered “<strong>Tergeo</strong>”: The dust vanished from the photographs, and he saw at once that half a dozen were missing from","index":503344}],"Wingardium Leviosa":[{"text":"then the sidecar began to lose height — In desperation Harry pointed his wand at the sidecar and shouted, “<strong>Wingardium Leviosa</strong>!” The sidecar rose like a cork, unsteerable but at least still airborne: He had but a split","index":85197},{"text":"“Oh — right — yeah —” Ron looked around, then directed his wand at a twig on the ground and said, “<strong>Wingardium Leviosa</strong>!” The twig flew up from the ground, spun through the air as if caught by a gust","index":964791}]}}